Repository: pypi-data/pypi-mirror-384
Catalog: packages/kadi/kadi-1.8.0-py3-none-any.whl/kadi/translations/*/LC_MESSAGES/messages.po
Languages: de

source: Current state
de: Aktueller Stand

source: Customization
de: Personalisierung

source: Dear administrator of the Shibboleth Identity Provider &quot;%(idp_displayname)s&quot;, I tried to log in to a service with the entityID &quot;%(sp_entity_id)s&quot;. Unfortunately, the login failed because the Identity Provider &quot;%(idp_displayname)s&quot; did not release the requested user attributes to this service. To be able to access this service, I kindly ask you to ensure that your Identity Provider releases my user attributes to &quot;%(sp_entity_id)s&quot;. The attributes that were not released to the service are:
de: Sehr geehrter Administrator des Shibboleth Identity Providers &quot;%(idp_displayname)s&quot;, Ich habe versucht, mich bei einem Dienst mit der EntityID &quot;%(sp_entity_id)s&quot; anzumelden. Leider ist die Anmeldung fehlgeschlagen, weil der Identity Provider &quot;%(idp_displayname)s&quot; die angeforderten Benutzerattribute nicht für diesen Dienst freigegeben hat. Um auf diesen Dienst zugreifen zu können, möchte ich Sie bitten, sicherzustellen, dass Ihr Identity Provider meine Benutzerattribute für &quot;%(sp_entity_id)s&quot; freigibt. Die Attribute, die nicht für den Dienst freigegeben wurden, sind:

source: Default record template
de: Standard-Record-Template

source: Default template
de: Standard-Template

source: Default to editing mode in extras editor
de: Bearbeitungsmodus des Extras-Editors standardmäßig aktivieren

source: Delete
de: Löschen

source: Delete application
de: Applikation löschen

source: Delete collection
de: Collection löschen

source: Delete file
de: Datei löschen

source: Delete group
de: Gruppe löschen

source: Delete record
de: Record löschen

source: Delete template
de: Template löschen

source: Delete this collection.
de: Diese Collection löschen.

source: Delete this group.
de: Diese Gruppe löschen.

source: Delete this record.
de: Diesen Record löschen.

source: Delete this template.
de: Dieses Template löschen.

source: Delete user
de: Benutzer löschen

source: Deleted
de: Gelöscht

source: Deleted at
de: Gelöscht am

source: Deleted resources
de: Gelöschte Ressourcen

source: Deny
de: Verweigern

source: Description
de: Beschreibung

source: Directly add user or group roles to a record.
de: Benutzer- oder Gruppenrollen direkt zu einem Record hinzufügen.

source: Directly add user or group roles to this collection.
de: Benutzer- oder Gruppenrollen direkt zu dieser Collection hinzufügen.

source: Directly add user or group roles to this record.
de: Benutzer- oder Gruppenrollen direkt zu diesem Record hinzufügen.

source: Directly add user or group roles to this template.
de: Benutzer- oder Gruppenrollen direkt zu diesem Template hinzufügen.

source: Directly link a record with one or more collections.
de: Einen Record direkt mit einer oder mehreren Collections verlinken.

source: Directly link a record with one or more other records.
de: Einen Record direkt mit einem oder mehreren anderen Records verlinken.

source: Directly link this collection with a parent collection.
de: Diese Collection direkt mit einer Eltern-Collection verlinken.

source: Directly link this collection with one or more records.
de: Diese Collection direkt mit einem oder mehreren Records verlinken.

source: Directly link this record with one or more collections.
de: Diesen Record direkt mit einer oder mehreren Collections verlinken.

source: Directly link this record with one or more other records.
de: Diesen Record direkt mit einem oder mehreren anderen Records verlinken.

source: Disconnect service
de: Dienst trennen

source: Display name
de: Anzeigename

source: Do not index website
de: Website nicht indizieren

source: Documentation
de: Dokumentation

source: Download all
de: Alle herunterladen

source: Duplicate value.
de: Doppelter Wert.

source: Each rule is applied when a new user registers, but it can also be applied retroactively to all existing users.
de: Jede Regel wird bei der Registrierung eines neuen Benutzers angewandt, sie kann aber auch rückwirkend auf alle bestehenden Benutzer angewandt werden.

source: Edit
de: Bearbeiten

source: Edit application
de: Applikation bearbeiten

source: Edit collection
de: Collection bearbeiten

source: Edit file
de: Datei bearbeiten

source: Edit group
de: Gruppe bearbeiten

source: Edit link
de: Link bearbeiten

source: Edit profile
de: Profil bearbeiten

source: Edit record
de: Record bearbeiten

source: Edit record link
de: Record-Link bearbeiten

source: Edit template
de: Template bearbeiten

source: Edit this collection.
de: Diese Collection bearbeiten.

source: Edit this group.
de: Diese Gruppe bearbeiten.

source: Edit this record and its files.
de: Diesen Record und seine Dateien bearbeiten.

source: Edit this template.
de: Dieses Template bearbeiten.

source: Email confirmation
de: E-Mail-Bestätigung

source: Email confirmed successfully.
de: E-Mail erfolgreich bestätigt.

source: Empty trash
de: Papierkorb leeren

source: Enforce legal notices
de: Rechtliche Hinweise durchsetzen

source: Enter MIME types
de: MIME-Types eingeben

source: Enter a new password
de: Geben Sie ein neues Passwort ein

source: Enter or search for a name
de: Name eingeben oder suchen

source: Enter or search for a record type
de: Record-Typ eingeben oder suchen

source: Enter or search for tags
de: Tags eingeben oder suchen

source: Enter tags
de: Tags eingeben

source: Enter types
de: Typen eingeben

source: Error authenticating user.
de: Fehler beim Authentifizieren des Benutzers.

source: Error changing password.
de: Fehler beim Ändern des Passworts.

source: Error changing preferences.
de: Fehler beim Ändern der Präferenzen.

source: Error connecting service.
de: Fehler beim Verbinden des Dienstes.

source: Error creating access token.
de: Fehler beim Erstellen des Access Tokens.

source: Error creating collection.
de: Fehler beim Erstellen der Collection.

source: Error creating group.
de: Fehler beim Erstellen der Gruppe.

source: Error creating record links.
de: Fehler beim Erstellen der Record-Links.

source: Error creating record.
de: Fehler beim Erstellen des Records.

source: Error creating template.
de: Fehler beim Erstellen des Templates.

source: Error editing application.
de: Fehler beim Bearbeiten der Applikation.

source: Error editing collection.
de: Fehler beim Bearbeiten der Collection.

source: Error editing file.
de: Fehler beim Bearbeiten der Datei.

source: Error editing group.
de: Fehler beim Bearbeiten der Gruppe.

source: Error editing record link.
de: Fehler beim Bearbeiten des Record-Links.

source: Error editing record.
de: Fehler beim Bearbeiten des Records.

source: Error editing template.
de: Fehler beim Bearbeiten des Templates.

source: Error importing file.
de: Fehler beim Importieren der Datei.

source: Error merging users.
de: Fehler beim Zusammenführen der Benutzer.

source: Error publishing collection.
de: Fehler beim Publizieren der Collection.

source: Error publishing record.
de: Fehler beim Publizieren des Records.

source: Error registering application.
de: Fehler beim Registrieren der Applikation.

source: Error registering user.
de: Fehler bei der Registrierung des Benutzers.

source: Error starting publishing task.
de: Fehler beim Starten des Publizierungs-Tasks.

source: Error updating profile.
de: Fehler beim Aktualisieren des Profils.

source: Example authorization request
de: Beispielhafte Autorisierungsanfrage

source: Exclude this website from being indexed by all major search engines.
de: Diese Website von der Indizierung durch alle gängigen Suchmaschinen ausschließen.

source: Existing record
de: Existierender Record

source: Expired
de: Abgelaufen

source: Expires at
de: Läuft ab am

source: Export as
de: Exportieren als

source: Extra metadata
de: Extra-Metadaten

source: Failure
de: Fehlgeschlagen

source: Favorite collections
de: Favorisierte Collections

source: Favorite groups
de: Favorisierte Gruppen

source: Favorite records
de: Favorisierte Records

source: Favorite templates
de: Favorisierte Templates

source: Favorites
de: Favoriten

source: File deleted successfully.
de: Datei erfolgreich gelöscht.

source: File imported successfully.
de: Datei erfolgreich importiert.

source: File revisions
de: Dateirevisionen

source: Filename
de: Dateiname

source: Files
de: Dateien

source: Filter by collection
de: Nach Collection filtern

source: Filter by creator
de: Nach Ersteller filtern

source: Filter by display name or username
de: Nach Anzeigename oder Benutzernamen filtern

source: Filter by file MIME type
de: Nach Datei-MIME-Typ filtern

source: Filter by tag
de: Nach Tag filtern

source: Filter by type
de: Nach Typ filtern

source: Filter by visibility
de: Nach Sichtbarkeit filtern

source: Find term
de: Term finden

source: Forgot your password?
de: Haben Sie Ihr Passwort vergessen?

source: Generated at
de: Generiert am

source: Get started
de: Erste Schritte

source: Group
de: Gruppe

source: Group created successfully.
de: Gruppe erfolgreich erstellt.

source: Group roles
de: Gruppenrollen

source: Group successfully moved to the trash.
de: Gruppe erfolgreich in den Papierkorb verschoben.

source: Groups
de: Gruppen

source: Groups can be used to group several users together, which primarily facilitates access management.
de: Mit Gruppen können mehrere Benutzer zusammengefasst werden, was vor allem die Verwaltung von Zugriffsrechten erleichtert.

source: Hello %(displayname)s
de: Hallo %(displayname)s

source: Help
de: Hilfe

source: Hide
de: Ausblenden

source: Hide introduction
de: Einleitung ausblenden

source: Hide the "Get started" section on the home page.
de: Blenden Sie den Abschnitt "Erste Schritte" auf der Startseite aus.

source: I accept the %(legal_notices)s.
de: Ich akzeptiere die %(legal_notices)s.

source: Identifier is already in use.
de: Identifier wird bereits verwendet.

source: If you did not request a password reset, you can ignore this email.
de: Wenn Sie kein neues Passwort angefordert haben, können Sie diese E-Mail ignorieren.

source: If you have not received a confirmation email yet, please click the button below to resend it.
de: Wenn Sie noch keine Bestätigungs-E-Mail erhalten haben, klicken Sie bitte auf die Schaltfläche unten, um sie erneut zu senden.

source: If your account was created recently, a system administrator may need to activate it first. Otherwise, your account may have been disabled.
de: Wenn Ihr Konto erst kürzlich erstellt wurde, muss es möglicherweise erst von einem Systemadministrator aktiviert werden. Andernfalls wurde Ihr Konto möglicherweise deaktiviert.

source: Image
de: Bild

source: In addition to the navigation bar, a navigation footer is available on the bottom of all pages, regardless of being logged in or not. This footer provides quick navigation to various informational pages and also contains a selection for switching the current language.
de: Zusätzlich zur Navigationsleiste ist eine Navigationsfußzeile am unteren Rand aller Seiten verfügbar, unabhängig davon, ob Sie eingeloggt sind oder nicht. Diese Fußzeile bietet eine schnelle Navigation zu verschiedenen Informationsseiten und enthält auch eine Auswahl zum Umschalten der aktuellen Sprache.

source: In this menu, it is possible to change basic user information, which is displayed on a user's profile. Note that some options might be disabled, depending on the type of the user account.
de: In diesem Menü können die grundlegenden Benutzerinformationen geändert werden, die im Profil eines Benutzers angezeigt werden. Beachten Sie, dass einige Optionen je nach Art des Benutzerkontos deaktiviert sein können.

source: In this menu, users can change their password. Depending on the type of user account this menu item may be hidden.
de: In diesem Menü können Benutzer ihr Passwort ändern. Je nach Art des Benutzerkontos kann dieser Menüpunkt ausgeblendet sein.

source: In this menu, users can change their preferences regarding the behavior or appearance of Kadi4Mat.
de: In diesem Menü können Benutzer ihre Präferenzen bezüglich des Verhaltens oder des Aussehens von Kadi4Mat ändern.

source: In this menu, users can manage their connections with different third-party services. Each service has to be registered as a plugin in the application and can be used for different tasks, e.g. publishing resources. Note that if no services are available in the current Kadi4Mat instance, this menu item is hidden.
de: In diesem Menü können Benutzer ihre Verbindungen mit verschiedenen Diensten von Drittanbietern verwalten. Jeder Dienst muss als Plugin in der Anwendung registriert werden und kann für verschiedene Aufgaben verwendet werden, z. B. für die Publizierung von Ressourcen. Wenn in der aktuellen Kadi4Mat-Instanz keine Dienste verfügbar sind, wird dieser Menüpunkt ausgeblendet.

source: In this view, all registered users of the current Kadi4Mat instance are shown. Clicking on a user leads to a separate page, which contains another navigation menu, providing access to different subpages. The respective contents of these pages are briefly described below.
de: In dieser Ansicht werden alle registrierten Benutzer der aktuellen Kadi4Mat-Instanz angezeigt. Ein Klick auf einen Benutzer führt zu einer separaten Seite, die ein weiteres Navigationsmenü enthält, das Zugang zu verschiedenen Unterseiten bietet. Die jeweiligen Inhalte dieser Seiten werden im Folgenden kurz beschrieben.

source: Inactive
de: Inaktiv

source: Include child collections
de: Kind-Collections einbeziehen

source: Incoming record links
de: Eingehende Record-Links

source: Index image
de: Indexbild

source: Information
de: Informationen

source: Initial user password
de: Initiales Benutzerpasswort

source: Instructions on how to reset your password will be sent to the email associated with this username.
de: Anweisungen zum Zurücksetzen Ihres Passworts werden an die mit diesem Benutzernamen verknüpfte E-Mail gesendet.

source: Integer values must be between %(min)s and %(max)s.
de: Integer-Werte müssen zwischen %(min)s und %(max)s liegen.

source: Invalid Identity Provider.
de: Ungültiger Identity Provider.

source: Invalid JSON data.
de: Ungültige JSON-Daten.

source: Invalid credentials.
de: Ungültige Anmeldedaten.

source: Invalid value.
de: Ungültiger Wert.

source: Last modified
de: Zuletzt geändert

source: Last modified at
de: Zuletzt geändert am

source: Last used
de: Zuletzt verwendet

source: Latest release
de: Neuester Release

source: Latest updates
de: Neueste Updates

source: Latest version
de: Neueste Version

source: Legal notice
de: Impressum

source: Legals
de: Rechtliches

source: License
de: Lizenz

source: Link already exists.
de: Link existiert bereits.

source: Link collections
de: Collections verlinken

source: Link record
de: Record verlinken

source: Link records
de: Records verlinken

source: Linked child collections
de: Verlinkte Kind-Collections

source: Linked collections
de: Verlinkte Collections

source: Linked records
de: Verlinkte Records

source: Linking resources requires link permission in both resources that should be linked together. Note that users still won't be able to view any linked resources if they have no explicit permission to do so. However, a limited subset of information about record links (the ID of the link, the linked record, the name and the term IRI of the link) will always be shown as part of the record revisions.
de: Ressourcen zu verlinken erfordert Linkrechte in beiden Ressourcen, die miteinander verlinkt werden sollen. Beachten Sie, dass Benutzer nach wie vor keine verlinkten Ressourcen einsehen können, wenn sie keine ausdrücklichen Zugriffsrechte dazu haben. Eine begrenzte Menge von Informationen über Record-Links (die ID des Links, der verlinkte Record, der Name und der Term-IRI des Links) wird jedoch immer als Teil der Recordrevisionen angezeigt.

source: Links to all legal notices can also be found in the navigation footer at any time.
de: Links zu allen rechtlichen Hinweisen können auch jederzeit in der Navigationsfußzeile gefunden werden.

source: Local
de: Lokal

source: Local user &quot;%(username)s&quot; was registered with an initial password. Please keep it somewhere safe as you will not be able to access it again. Alternatively, the user may reset their password on their own.
de: Der lokale Benutzer &quot;%(username)s&quot; wurde mit einem Initialpasswort registriert. Bitte bewahren Sie es an einem sicheren Ort auf, da Sie später nicht mehr darauf zugreifen können. Alternativ kann der Benutzer sein Passwort selbst zurücksetzen.

source: Login
de: Anmelden

source: Login failed
de: Anmeldung fehlgeschlagen

source: Login failed due to missing user attributes
de: Anmeldung aufgrund fehlender Benutzerattribute fehlgeschlagen

source: Login with LDAP
de: Login mit LDAP

source: Login with OpenID Connect
de: Login mit OpenID Connect

source: Login with Shibboleth
de: Login mit Shibboleth

source: Login with credentials
de: Login mit Anmeldedaten

source: Logout
de: Ausloggen

source: MIME type
de: MIME-Typ

source: Manage applications
de: Applikationen verwalten

source: Manage links
de: Links verwalten

source: Manage links of this collection with other resources.
de: Links dieser Collection mit anderen Ressourcen verwalten.

source: Manage links of this record with other resources.
de: Links dieses Records mit anderen Ressourcen verwalten.

source: Manage members
de: Mitglieder verwalten

source: Manage members of this group.
de: Mitglieder dieser Gruppe verwalten.

source: Manage permissions
de: Zugriffsrechte verwalten

source: Manage permissions of this collection.
de: Zugriffsrechte dieser Collection verwalten.

source: Manage permissions of this record.
de: Zugriffsrechte dieses Records verwalten.

source: Manage permissions of this template.
de: Zugriffsrechte dieses Templates verwalten.

source: Manage tokens
de: Tokens verwalten

source: Manage users
de: Benutzer verwalten

source: Managing existing collections
de: Verwalten bestehender Collections

source: Managing existing groups
de: Verwalten bestehender Gruppen

source: Managing existing records
de: Verwalten bestehender Records

source: Managing existing templates
de: Verwalten bestehender Templates

source: Maximum upload quota exceeded (%(filesize)s).
de: Maximale Upload-Quote überschritten (%(filesize)s).

source: Member since
de: Mitglied seit

source: Members
de: Mitglieder

source: Merge users
de: Benutzer zusammenführen

source: Merging users allows permanently combining multiple accounts into one. The primary user determines the user ID as well as other user attributes that will be taken over, such as the displayname or profile information, while all resources, permissions and settings of the secondary user will be migrated to the primary user. This also includes the identities used for authentication, i.e. the merged user will be able to log in with the credentials of both users afterwards.
de: Das Zusammenführen von Benutzern ermöglicht es, mehrere Konten dauerhaft zu einem einzigen zusammenzufassen. Der primäre Benutzer bestimmt die Benutzer-ID sowie andere Benutzerattribute, die übernommen werden, wie z. B. den Anzeigenamen oder Profilinformationen, während alle Ressourcen, Zugriffsrechte und Einstellungen des sekundären Benutzers auf den primären Benutzer migriert werden. Dies gilt auch für die zur Authentifizierung verwendeten Identitäten, d. h. der zusammengeführte Benutzer kann sich anschließend mit den Anmeldeinformationen beider Benutzer anmelden.

source: Metadata
de: Metadaten

source: Minimum value cannot be greater than maximum value.
de: Das Minimum kann nicht größer als das Maximum sein.

source: Miscellaneous
de: Sonstiges

source: More information
de: Mehr Informationen

source: Must be equal to or greater than %(min)s.
de: Muss gleich oder größer sein als %(min)s.

source: Must be equal to or smaller than %(max)s.
de: Muss gleich oder kleiner sein als %(max)s.

source: Must be one of: %(options)s.
de: Muss einer der folgenden Werte sein: %(options)s.

source: My created resources
de: Meine erstellten Ressourcen

source: Name is already in use.
de: Name wird bereits verwendet.

source: Navigation footer items
de: Fußzeilen-Navigationselemente

source: Never
de: Nie

source: New collection
de: Neue Collection

source: New group
de: Neue Gruppe

source: New members
de: Neue Mitglieder

source: New password
de: Neues Passwort

source: New permissions
de: Neue Zugriffsrechte

source: New record
de: Neuer Record

source: New record links
de: Neue Record-Links

source: New resource
de: Neue Ressource

source: New template
de: Neues Template

source: Next file
de: Nächste Datei

source: Next record
de: Nächster Record

source: Next revision
de: Nächste Revision

source: No applications.
de: Keine Applikationen.

source: No authentication providers have been configured.
de: Es wurden keine Authentifizierungsprovider konfiguriert.

source: No collections.
de: Keine Collections.

source: No deleted resources.
de: Keine gelöschten Ressourcen.

source: No description.
de: Keine Beschreibung.

source: No files.
de: Keine Dateien.

source: No groups.
de: Keine Gruppen.

source: No information provided.
de: Keine Angaben gemacht.

source: No members.
de: Keine Mitglieder.

source: No personal access tokens.
de: Keine persönlichen Access Tokens.

source: No preview available.
de: Keine Vorschau vorhanden.

source: No record links.
de: Keine Record-Links.

source: No records.
de: Keine Records.

source: No rules.
de: Keine Regeln.

source: No template
de: Kein Template

source: No templates.
de: Keine Templates.

source: No users.
de: Keine Benutzer.

source: None
de: Keine

source: Not a valid %(type)s.
de: Kein gültiger Typ.

source: Not a valid IRI.
de: Kein gültiger IRI.

source: Not a valid MIME type.
de: Kein gültiger MIME-Typ.

source: Not a valid ORCID iD.
de: Keine gültige ORCID iD.

source: Not a valid UUIDv%(version)s.
de: Keine gültige UUIDv%(version)s.

source: Not a valid identifier. Valid are lower case alphanumeric characters, hyphens and underscores.
de: Kein gültiger Identifier. Gültig sind alphanumerische Kleinbuchstaben, Bindestriche und Unterstriche.

source: Not a valid license.
de: Keine gültige Lizenz.

source: Not a valid username. Valid are alphanumeric characters with single hyphens or underscores in between.
de: Kein gültiger Benutzername. Gültig sind alphanumerische Zeichen mit einzelnen Bindestrichen oder Unterstrichen dazwischen.

source: Not publicly visible.
de: Nicht öffentlich sichtbar.

source: Note that a success message only indicates that the background task for sending emails was started successfully.
de: Beachten Sie, dass eine Erfolgsmeldung nur anzeigt, dass der Hintergrund-Task zum Versenden von E-Mails erfolgreich gestartet wurde.

source: Note that changing the scopes will require existing users of your application to redo the authorization flow once their current access token is expired.
de: Beachten Sie, dass eine Änderung der Scopes dazu führt, dass bestehende Benutzer Ihrer Applikation den Autorisierungs-Flow neu durchführen müssen, sobald ihr aktuelles Zugriffstoken abgelaufen ist.
