Repository: pypi-data/pypi-mirror-384
Catalog: packages/kadi/kadi-1.8.0-py3-none-any.whl/kadi/translations/*/LC_MESSAGES/messages.po
Languages: de

source: %(em_open)sExtras%(em_close)s templates are focused on the generic extra metadata of a record. These kind of templates can be selected and combined wherever such metadata can be specified, including when creating other templates.
de: %(em_open)sExtras%(em_close)s-Templates sind auf die generischen Extra-Metadaten eines Records ausgerichtet. Diese Art von Templates kann überall dort ausgewählt und kombiniert werden, wo solche Metadaten angegeben werden können, auch bei der Erstellung anderer Templates.

source: %(em_open)sRecord%(em_close)s templates can contain all of the metadata that can be specified for a record, including its generic extra metadata, linked collections, record links and permissions. Note that concerning linked resources or groups, their IDs will be visible to all users who can access the template. Record templates can be selected in most places where new records can be created as well as for the creation of generic extra metadata.
de: %(em_open)sRecord%(em_close)s-Templates können alle Metadaten enthalten, die für einen Record angegeben werden können, einschließlich seiner generischen Extra-Metadaten, verknüpften Collections, Record-Links und Zugriffsrechte. Beachten Sie, dass bezüglich verlinkter Ressourcen oder Gruppen deren IDs für alle Benutzer sichtbar sind, die auf das Template zugreifen können. Record-Templates können an den meisten Stellen ausgewählt werden, an denen neue Records erstellt werden können, sowie für die Erstellung von generischen Extra-Metadaten.

source: %(num)d new file revision
de: %(num)d neue Dateirevision

source: %(num)d new record revision
de: %(num)d neue Recordrevision

source: %(strong_open)sKadi4Mat%(strong_close)s, or %(strong_open)sKadi%(strong_close)s for short, is a generic and open source virtual research environment. Originally developed in the context of materials science, Kadi4Mat can be used for the management of any type of research data within different research disciplines and use cases. Kadi4Mat is being developed as part of several research projects at the %(strong_open)sKarlsruhe Institute of Technology (KIT)%(strong_close)s.
de: %(strong_open)sKadi4Mat%(strong_close)s, oder kurz %(strong_open)sKadi%(strong_close)s, ist eine generische und quelloffene virtuelle Forschungsumgebung. Ursprünglich im Kontext der Materialwissenschaften entwickelt, kann Kadi4Mat für die Verwaltung jeglicher Art von Forschungsdaten innerhalb verschiedener Forschungsdisziplinen und Anwendungsfälle verwendet werden. Kadi4Mat wird im Rahmen mehrerer Forschungsprojekte am %(strong_open)sKarlsruher Institut für Technologie (KIT)%(strong_close)s entwickelt.

source: A confirmation email has been sent.
de: Eine Bestätigungs-E-Mail wurde gesendet.

source: A corresponding shortcut in the navigation footer will be created automatically.
de: Eine entsprechende Verknüpfung wird automatisch in der Navigationsfußzeile erstellt.

source: A file with that name already exists.
de: Eine Datei mit diesem Namen existiert bereits.

source: A nested value which can be used to combine multiple metadata entries under a single key.
de: Ein verschachtelter Wert, der verwendet werden kann, um mehrere Metadateneinträge unter einem einzigen Schlüssel zusammenzufassen.

source: A nested value which is similar to dictionaries with the difference that none of the values in a list have a key.
de: Ein verschachtelter Wert, der ähnlich wie ein Dictionary ist, mit dem Unterschied, dass keiner der Werte in einer Liste einen Schlüssel hat.

source: A new OAuth2 application has been registered. Please keep the client secret somewhere safe as you will not be able to access it again.
de: Eine neue OAuth2-Applikation wurde registriert. Bitte bewahren Sie das Client Secret an einem sicheren Ort auf, da Sie später nicht mehr darauf zugreifen können.

source: A new personal access token has been created. Please keep it somewhere safe as you will not be able to access it again.
de: Ein neues persönliches Access Token wurde erstellt. Bitte bewahren Sie es an einem sicheren Ort auf, da Sie später nicht mehr darauf zugreifen können.

source: A password reset email has been sent.
de: Eine E-Mail zum Zurücksetzen des Passworts wurde gesendet.

source: A publishing task is already in progress.
de: Ein Publizierungs-Task läuft bereits.

source: A record template that will be used as a default when adding new records to this collection.
de: Ein Record-Template, das als Standard verwendet wird, wenn neue Records zu dieser Collection hinzugefügt werden.

source: A single boolean value which can either be %(em_open)strue%(em_close)s or %(em_open)sfalse%(em_close)s.
de: Ein einzelner boolescher Wert, der entweder %(em_open)strue%(em_close)s oder %(em_open)sfalse%(em_close)s sein kann.

source: A single date and time value.
de: Ein einzelner Datums- und Zeitwert.

source: A single floating point value using double-precision (64 Bit). Float values can optionally have a unit further describing them.
de: Ein einzelner Fließkommawert mit doppelter Genauigkeit (64 Bit). Float-Werte können optional mit einer Einheit versehen werden, die sie weiter beschreibt.

source: A single integer value. Limited to values between -(2%(sup_open)s53%(sup_close)s - 1) and (2%(sup_open)s53%(sup_close)s - 1). Integer values can optionally have a unit further describing them.
de: Ein einzelner ganzzahliger Wert. Begrenzt auf Werte zwischen -(2%(sup_open)s53%(sup_close)s - 1) und (2%(sup_open)s53%(sup_close)s - 1). Integer-Werte können optional mit einer Einheit versehen werden, die sie weiter beschreibt.

source: A single text value.
de: Ein einzelner Textwert.

source: A test email has been sent.
de: Eine Test-E-Mail wurde versandt.

source: AND
de: UND

source: About
de: Über

source: Accept legal notices
de: Rechtliche Hinweise akzeptieren

source: Access token created successfully.
de: Access Token erfolgreich erstellt.

source: Access tokens can be used to directly interact with the HTTP API that Kadi4Mat provides. Please see the %(help)s page for more information.
de: Access Tokens können verwendet werden, um direkt mit der HTTP-API zu interagieren, die Kadi4Mat zur Verfügung stellt. Weitere Informationen finden Sie auf der %(help)s-Seite.

source: Account inactive
de: Konto inaktiv

source: Account type
de: Kontotyp

source: Active
de: Aktiv

source: Add files
de: Dateien hinzufügen

source: Add members
de: Mitglieder hinzufügen

source: Add permissions
de: Zugriffsrechte hinzufügen

source: Add rule
de: Regel hinzufügen

source: Additional information to be publicly displayed in your profile.
de: Zusätzliche Informationen, die öffentlich in Ihrem Profil angezeigt werden.

source: Additional settings
de: Weitere Einstellungen

source: Additional settings of the template itself.
de: Weitere Einstellungen des Templates selbst.

source: Advanced search
de: Erweiterte Suche

source: After logging in, the menu at the top left of the navigation bar allows access to %(records_a_open)sRecords%(a_close)s, %(collections_a_open)sCollections%(a_close)s, %(templates_a_open)sTemplates%(a_close)s, %(users_a_open)sUsers%(a_close)s and %(groups_a_open)sGroups%(a_close)s. Each navigation item leads to the corresponding main page of the respective resource, where existing resources can be searched and, if applicable, new resources can be created. Details about each resource type are described in the following sections.
de: Nach dem Einloggen ermöglicht das Menü oben links in der Navigationsleiste den Zugriff auf %(records_a_open)sRecords%(a_close)s, %(collections_a_open)sCollections%(a_close)s, %(templates_a_open)sTemplates%(a_close)s, %(users_a_open)sBenutzer%(a_close)s und %(groups_a_open)sGruppen%(a_close)s. Jeder Navigationspunkt führt zu der entsprechenden Hauptseite der jeweiligen Ressource, auf der existierende Ressourcen durchsucht und ggf. neue Ressourcen angelegt werden können. Details zu den einzelnen Ressourcentypen werden in den folgenden Abschnitten beschrieben.

source: All
de: Alle

source: Also known as
de: Auch bekannt als

source: Always enable the editing mode by default when using the generic record metadata editor.
de: Den Bearbeitungsmodus bei Verwendung des generischen Record-Metadaten-Editors standardmäßig immer aktivieren.

source: Amount of active collections
de: Anzahl der aktiven Collections

source: Amount of active files
de: Anzahl der aktiven Dateien

source: Amount of active groups
de: Anzahl der aktiven Gruppen

source: Amount of active records
de: Anzahl der aktiven Records

source: Amount of active templates
de: Anzahl der aktiven Templates

source: Amount of active users
de: Anzahl der aktiven Benutzer

source: An IRI specifying an existing term that the link should represent.
de: Ein IRI, der einen bestehenden Term angibt, den der Link repräsentieren soll.

source: An application is requesting access to your account
de: Eine Applikation fordert den Zugriff auf Ihr Konto an

source: An optional list of keywords further describing a record.
de: Eine optionale Liste von Schlüsselwörtern zur weiteren Beschreibung eines Records.

source: An optional list of keywords further describing the collection.
de: Eine optionale Liste von Schlüsselwörtern zur weiteren Beschreibung der Collection.

source: An optional list of keywords further describing the record.
de: Eine optionale Liste von Schlüsselwörtern zur weiteren Beschreibung des Records.

source: An unknown error occured.
de: Ein unbekannter Fehler ist aufgetreten.

source: Application deleted successfully.
de: Applikation erfolgreich gelöscht.

source: Application registered successfully.
de: Applikation erfolgreich registriert.

source: Applications
de: Applikationen

source: Applications can be used to integrate another service with the HTTP API that Kadi4Mat provides. Please see the %(help)s page for more information.
de: Applikationen können verwendet werden, um einen anderen Dienst mit der HTTP-API zu integrieren, die Kadi4Mat zur Verfügung stellt. Weitere Informationen finden Sie auf der %(help)s-Seite.

source: Apply permissions
de: Zugriffsrechte anwenden

source: Apply retroactively
de: Rückwirkend anwenden

source: Apply template
de: Template anwenden

source: As template
de: Als Template

source: Aside from the metadata, it is possible to set the visibility of a record to either %(em_open)sprivate%(em_close)s or %(em_open)spublic%(em_close)s, the latter giving every logged-in user the ability to search for the record and view its contents without requiring explicit read permissions to do so. Finally, a record may directly be linked to other resources and its permissions may directly be specified, both of which aspects can also be managed after creating the record.
de: Abgesehen von den Metadaten ist es möglich, die Sichtbarkeit eines Records entweder auf %(em_open)sprivat%(em_close)s oder %(em_open)söffentlich%(em_close)s zu setzen, wobei letzteres jedem angemeldeten Benutzer die Möglichkeit gibt, nach dem Record zu suchen und seinen Inhalt einzusehen, ohne dass dafür explizite Leserechte benötigt werden. Schließlich kann ein Record direkt mit anderen Ressourcen verknüpft werden und die Zugriffsrechte des Records direkt angegeben werden, wobei beide Aspekte auch nach der Erstellung des Records verwaltet werden können.

source: Attribute
de: Attribut

source: Authorize
de: Autorisieren

source: Authorize application
de: Applikation autorisieren

source: Authorized applications
de: Autorisierte Applikationen

source: Automatically set based on your %(type)s account.
de: Automatisch festgelegt auf der Grundlage Ihres %(type)s-Kontos.

source: Back to applications
de: Zurück zu den Applikationen

source: Back to collection
de: Zurück zur Collection

source: Back to file
de: Zurück zur Datei

source: Back to group
de: Zurück zur Gruppe

source: Back to record
de: Zurück zum Record

source: Back to record link
de: Zurück zum Record-Link

source: Back to template
de: Zurück zum Template

source: Before proceeding, you must accept our %(legal_notices)s.
de: Bevor Sie fortfahren, müssen Sie unsere %(legal_notices)s akzeptieren.

source: Before proceeding, your registered email address %(email)s needs to be confirmed.
de: Bevor Sie fortfahren, müssen Sie Ihre registrierte E-Mail-Adresse %(email)s bestätigen.

source: Besides linking collections to records, collections can also be linked to other collections, which is shown in this tab. This functionality can be used to create simple hierarchies of parent and child collections in order to improve the structuring of multiple resources, e.g. by representing projects and corresponding subprojects. Note that each collection may only have one parent collection, while the required permissions to link collections are handled similarly to other resource links.
de: Neben der Verlinkung von Collections mit Records können Collections auch mit anderen Collections verlinkt werden, was auf diesem Tab angezeigt wird. Diese Funktion kann verwendet werden, um einfache Hierarchien von übergeordneten und untergeordneten Collections zu erstellen und damit die Strukturierung mehrerer Ressourcen zu verbessern, z. B. durch die Repräsentation von Projekten und entsprechenden Unterprojekten. Beachten Sie, dass jede Collection nur eine übergeordnete Collection haben kann, während die erforderlichen Zugriffsrechte für die Verlinkung von Collections ähnlich wie bei anderen Ressourcenlinks gehandhabt werden.

source: Besides managing members directly, it is possible to automate the assignment of roles within a group by specifying rules with different conditions. Each rule is applied when a new user registers, but it can also be applied retroactively to all existing users.
de: Neben der direkten Verwaltung der Mitglieder ist es möglich, die Zuweisung von Rollen innerhalb einer Gruppe zu automatisieren, indem Regeln mit verschiedenen Bedingungen festgelegt werden. Jede Regel wird angewandt, wenn sich ein neuer Benutzer anmeldet, kann aber auch rückwirkend auf alle bestehenden Benutzer angewandt werden.

source: Besides managing the permissions of collections themselves, it is also possible to manage the roles of users and groups of all linked records in a collection in the corresponding tab, as collection permissions are currently not inherited by linked resources. Specifically, this applies to all linked records where the current user can manage permissions. When selecting an empty role, any existing permissions of the corresponding user or group will be removed instead.
de: Neben der Verwaltung der Zugriffsrechte von Collections selbst ist es ebenfalls möglich, die Rollen von Benutzern und Gruppen aller verlinkten Records in einer Collection in dem entsprechenden Tab zu verwalten, da die Zugriffsrechte von Collections derzeit nicht an verlinkte Ressourcen vererbt werden. Dies gilt genauer gesagt für alle verlinkten Records, bei denen der aktuelle Benutzer Zugriffsrechte verwalten kann. Wenn eine leere Rolle ausgewählt wird, werden stattdessen alle bestehenden Zugriffsrechte des entsprechenden Benutzers oder der Gruppe entfernt.

source: Broadcast message
de: Broadcast-Nachricht

source: Can create new resources.
de: Kann neue Ressourcen erstellen.

source: Can manage any resource.
de: Kann jede Ressource verwalten.

source: Cannot be used together with %(type)s.
de: Kann nicht zusammen mit diesem Typ verwendet werden.

source: Changes saved successfully.
de: Änderungen erfolgreich gespeichert.

source: Changes since last update of record link
de: Änderungen seit letztem Update des Record-Links

source: Check out the help page
de: Besuchen Sie die Hilfeseite

source: Child collections
de: Kind-Collections

source: Click here to reset it.
de: Klicken Sie hier um es zurückzusetzen.

source: Clicking on a file leads to a separate overview page of the corresponding file, which shows all additional file metadata. Furthermore, many file types include a built-in preview functionality. Here, it is also possible to edit a file's metadata or content, where editing the metadata also allows deleting the file. Some file types may offer direct editing of the actual file content, otherwise the regular upload functionality can be used.
de: Ein Klick auf eine Datei führt zu einer separaten Übersichtsseite der entsprechenden Datei, die alle zusätzlichen Metadaten der Datei anzeigt. Darüber hinaus verfügen viele Dateitypen über eine integrierte Vorschaufunktion. Hier ist es auch möglich, die Metadaten oder den Inhalt einer Datei zu bearbeiten, wobei die Bearbeitung der Metadaten auch das Löschen der Datei ermöglicht. Bei einigen Dateitypen ist eine direkte Bearbeitung des eigentlichen Dateiinhalts möglich, ansonsten kann die reguläre Upload-Funktionalität verwendet werden.

source: Collection created successfully.
de: Collection erfolgreich erstellt.

source: Collection successfully moved to the trash.
de: Collection erfolgreich in den Papierkorb verschoben.

source: Collections represent logical groupings (e.g. projects, simulation studies or experiments) of multiple records or other collections.
de: Collections stellen logische Gruppierungen (z. B. Projekte, Simulationsstudien oder Experimente) von mehreren Records oder anderen Collections dar.

source: Collections shared with this group
de: Mit dieser Gruppe geteilte Collections

source: Collections shared with this user
de: Mit diesem Benutzer geteilte Collections

source: Common groups
de: Gemeinsame Gruppen

source: Compare changes
de: Änderungen vergleichen

source: Condition
de: Bedingung

source: Configuration
de: Konfiguration

source: Configure
de: Konfigurieren

source: Confirm email address
de: E-Mail-Adresse bestätigen

source: Confirmed
de: Bestätigt

source: Connect service
de: Dienst verbinden

source: Connected
de: Verbunden

source: Connected services
de: Verbundene Dienste

source: Connecting your account to this external Kadi4Mat instance makes it possible to use it in federated search of different resources.
de: Die Verbindung Ihres Kontos mit dieser externen Kadi4Mat-Instanz ermöglicht deren Nutzung in der föderierten Suche nach verschiedenen Ressourcen.

source: Connection summary: * IdP: %(idp_entity_id)s (%(idp_displayname)s) * SP: %(sp_entity_id)s * Time: %(timestamp)s (UTC) Kind regards
de: Zusammenfassung der Verbindung: * IdP: %(idp_entity_id)s (%(idp_displayname)s) * SP: %(sp_entity_id)s * Zeit: %(timestamp)s (UTC) Mit freundlichen Grüßen

source: Continue
de: Weiter

source: Continue tour
de: Tour fortsetzen

source: Copy collection
de: Collection kopieren

source: Copy record
de: Record kopieren

source: Copy template
de: Template kopieren

source: Could not apply rule retroactively.
de: Die Regel konnte nicht rückwirkend angewendet werden.

source: Could not retrieve latest version
de: Konnte die neueste Version nicht abrufen

source: Could not send confirmation email.
de: Bestätigungs-E-Mail konnte nicht gesendet werden.

source: Could not send test email.
de: Test-E-Mail konnte nicht gesendet werden.

source: Create collection
de: Collection erstellen

source: Create group
de: Gruppe erstellen

source: Create image
de: Bild erstellen

source: Create new collection
de: Neue Collection erstellen

source: Create new group
de: Neue Gruppe erstellen

source: Create new record
de: Neuen Record erstellen

source: Create new template
de: Neues Template erstellen

source: Create record
de: Record erstellen

source: Create record and add files
de: Record erstellen und Dateien hinzufügen

source: Create template
de: Template erstellen

source: Create text
de: Text erstellen

source: Create token
de: Token erstellen

source: Created at
de: Erstellt am

source: Created by
de: Erstellt von

source: Created collections
de: Erstellte Collections

source: Created groups
de: Erstellte Gruppen

source: Created records
de: Erstellte Records

source: Created templates
de: Erstellte Templates

source: Creating a new collection is similar to creating new records, except that only some basic metadata are necessary. Additionally, it is possible to specify a %(a_open)sRecord Template%(a_close)s to use as default when adding new records to a collection. Note that a limited subset of information about such templates will always be shown as part of the collection revisions (the ID of the template) and when editing the collection (the ID and identifier of the template).
de: Die Erstellung einer neuen Collection ähnelt dem Erstellen neuer Records, mit dem Unterschied, dass nur einige grundlegende Metadaten erforderlich sind. Zusätzlich ist es möglich, ein %(a_open)sRecord-Template%(a_close)s anzugeben, das beim Hinzufügen neuer Records zu einer Collection als Standard verwendet wird. Beachten Sie, dass eine begrenzte Menge von Informationen über solche Templates immer als Teil der Collectionrevisionen (die ID des Templates) und beim Bearbeiten der Collection (die ID und der Identifier des Templates) angezeigt wird.

source: Creating a new group is again similar to creating other resources. Aside from basic metadata, a group picture can also be uploaded, which will be shown on the group overview as well as on search result pages.
de: Die Erstellung einer neuen Gruppe erfolgt ähnlich wie das Erstellen anderer Ressourcen. Neben den grundlegenden Metadaten kann auch ein Gruppenbild hochgeladen werden, das in der Gruppenübersicht und auf den Suchergebnisseiten angezeigt wird.

source: Creating a new record first requires entering its metadata. This includes basic information, such as title, (unique) identifier and description. Additionally, generic extra metadata can be specified, specific for each different kind of record. This metadata consists of enhanced key-value pairs, where each entry has at least a unique key, a type and a corresponding value. Optionally, a description, an additional term IRI (Internationalized Resource Identifier) and validation instructions can be specified. It is also possible to create templates for the generic metadata, as described in %(a_open)sTemplates%(a_close)s. The following values types can be used for this metadata:
de: Um einen neuen Record zu erstellen, müssen zunächst dessen Metadaten eingegeben werden. Dazu gehören grundlegende Informationen wie Titel, (eindeutiger) Identifier und Beschreibung. Darüber hinaus können generische Extra-Metadaten angegeben werden, die für die verschiedenen Arten von Records spezifisch sind. Diese Metadaten bestehen aus erweiterten Schlüssel-Wert-Paaren, wobei jeder Eintrag mindestens einen eindeutigen Schlüssel, einen Typ und einen entsprechenden Wert hat. Optional können eine Beschreibung, ein zusätzlicher Term-IRI (Internationalized Resource Identifier) und Validierungsanweisungen angegeben werden. Es ist auch möglich, Templates für die generischen Metadaten zu erstellen, wie in %(a_open)sTemplates%(a_close)s beschrieben. Die folgenden Wertetypen können für diese Metadaten verwendet werden:

source: Creating a new template is similar to creating other kinds of resources. Each template requires at least setting a title and identifier for the template itself, while the actual template data depends on the specific type of template.
de: Die Erstellung eines neuen Templates ähnelt der Erstellung anderer Arten von Ressourcen. Für jedes Template müssen zumindest ein Titel und ein Identifier für das Template selbst festgelegt werden, während die eigentlichen Template-Daten von der jeweiligen Art des Templates abhängen.

source: Creating new collections
de: Erstellen neuer Collections

source: Creating new groups
de: Erstellen neuer Gruppen

source: Creating new records
de: Erstellen neuer Records

source: Creating new templates
de: Erstellen neuer Templates

source: Credentials
de: Anmeldedaten

source: Current password
de: Aktuelles Passwort

source: Current server time
de: Aktuelle Serverzeit
