Repository: pypi-data/pypi-mirror-384
Catalog: packages/kadi/kadi-1.8.0-py3-none-any.whl/kadi/translations/*/LC_MESSAGES/messages.po
Languages: de

source: When selecting an empty role, any existing permissions of the corresponding user or group will be removed instead.
de: Wenn eine leere Rolle ausgewählt wird, werden stattdessen alle bestehenden Zugriffsrechte des entsprechenden Benutzers oder der Gruppe entfernt.

source: Wrong email address? Enter your new email address here:
de: Falsche E-Mail-Adresse? Geben Sie hier Ihre neue E-Mail-Adresse ein:

source: You are currently logged in as
de: Sie sind momentan eingeloggt als

source: You do not have permission to access the requested resource.
de: Sie haben keine Berechtigung für den Zugriff auf die angeforderte Ressource.

source: You have to be logged in to access this page.
de: Sie müssen eingeloggt sein, um auf diese Seite zugreifen zu können.

source: Your email address has not yet been confirmed.
de: Ihre E-Mail-Adresse wurde noch nicht bestätigt.

source: Your home organization %(strong_open)s%(idp_displayname)s%(strong_close)s (%(idp_entity_id)s) did not provide all information about you that is required to log in to Kadi4Mat.
de: Ihre Heimatorganisation %(strong_open)s%(idp_displayname)s%(strong_close)s (%(idp_entity_id)s) hat nicht alle Informationen über Sie bereitgestellt, die für die Anmeldung in Kadi4Mat erforderlich sind.

source: Your personal access token
de: Ihr persönliches Access Token

source: and
de: und

source: day
de: Tag

source: days
de: Tage

source: hour
de: Stunde

source: hours
de: Stunden

source: minutes
de: Minuten

source: second
de: Sekunde

source: seconds
de: Sekunden

source: this is a test email from Kadi4Mat (%(server_name)s) sent via the graphical sysadmin user interface.
de: dies ist eine Test-E-Mail von Kadi4Mat (%(server_name)s), die über die grafische Sysadmin-Benutzeroberfläche versendet wurde.

source: to confirm your email address, please paste the following link into your browser's address bar:
de: um Ihre E-Mail-Adresse zu bestätigen, fügen Sie bitte den folgenden Link in die Adressleiste Ihres Browsers ein:

source: to reset your password, please paste the following link into your browser's address bar:
de: um Ihr Passwort zurückzusetzen, fügen Sie bitte den folgenden Link in die Adresszeile Ihres Browsers ein:

source: week
de: Woche

source: weeks
de: Wochen
