Repository: pypi-data/pypi-mirror-384
Catalog: packages/kadi/kadi-1.8.0-py3-none-any.whl/kadi/translations/*/LC_MESSAGES/messages.po
Languages: de

source: Note that group roles are always shown to users being able to manage permissions, even if the group would normally not be visible. This way, existing group roles can always be changed and/or removed. Such group roles only contain very limited information about the group itself (its ID, title, identifier and visibility).
de: Beachten Sie, dass Gruppenrollen für Benutzer, die Zugriffsrechte verwalten können, immer angezeigt werden, auch wenn die Gruppe normalerweise nicht sichtbar wäre. Auf diese Weise können bestehende Gruppenrollen jederzeit geändert und/oder entfernt werden. Solche Gruppenrollen enthalten nur sehr begrenzte Informationen über die Gruppe selbst (ihre ID, ihren Titel, ihren Identifier und ihre Sichtbarkeit).

source: Note that it may take some time for a user to be completely deleted.
de: Beachten Sie, dass es etwas dauern kann, bis ein Benutzer vollständig gelöscht ist.

source: Note that keys in the generic extra metadata of records will be URL-encoded in order to produce valid references when not using term IRIs.
de: Beachten Sie, dass die Schlüssel in den generischen Extra-Metadaten von Records URL-kodiert werden, um gültige Referenzen zu erzeugen, wenn keine Term-IRIs verwendet werden.

source: Note that only the extra metadata of the template data is exported and that units for numeric values are added as an additional "unit" keyword to each relevant property.
de: Beachten Sie, dass nur die Extra-Metadaten der Template-Daten exportiert werden und dass Einheiten für numerische Werte als zusätzliches Schlüsselwort "unit" zu jeder relevanten Property hinzugefügt werden.

source: Note that preview data may be truncated.
de: Beachten Sie, dass Vorschaudaten möglicherweise gekürzt sind.

source: Note that resources will be deleted automatically after %(duration)s and that manually emptying the trash may take some time.
de: Beachten Sie, dass Ressourcen nach %(duration)s automatisch gelöscht werden und dass das manuelle Leeren des Papierkorbs etwas dauern kann.

source: Note that this link is only valid for a duration of %(duration)s.
de: Beachten Sie, dass dieser Link nur für eine Dauer von %(duration)s gültig ist.

source: Note that to completely disconnect a previously connected service, access must also be revoked on the service's website.
de: Beachten Sie, dass zum vollständigen Trennen eines zuvor verbundenen Dienstes auch der Zugang auf der Website des Dienstes widerrufen werden muss.

source: Note that unfinished uploads will be deleted automatically after %(duration)s.
de: Beachten Sie, dass nicht abgeschlossene Uploads nach %(duration)s automatisch gelöscht werden.

source: OR
de: ODER

source: On the record overview page, different views are available, each of which can be accessed through the respective tab in the navigation menu of a record. The individual tabs and their contents are briefly described below.
de: Auf der Übersichtsseite von Records stehen verschiedene Ansichten zur Verfügung, die jeweils über den entsprechenden Tab im Navigationsmenü eines Records aufgerufen werden können. Die einzelnen Tabs und ihre Inhalte werden im Folgenden kurz beschrieben.

source: On this page it is possible to see the basic information of a user, such as username and account type. Users are able to control some of the information shown on this page via the %(a_open)sSettings%(a_close)s.
de: Auf dieser Seite werden die grundlegenden Informationen eines Benutzers angezeigt, z. B. der Benutzername und der Kontotyp. Benutzer können einige der auf dieser Seite angezeigten Informationen über die %(a_open)sEinstellungen%(a_close)s steuern.

source: Once the metadata of a record has been created, the actual data of the record can be added in a separate view, which by default the application will redirect to automatically. This is just one part of the various views to manage records, the next section describes the purpose of the others, which can be selected after going back to the record overview page.
de: Sobald die Metadaten eines Records erstellt wurden, können die eigentlichen Daten des Records in einer separaten Ansicht hinzugefügt werden, zu der die Anwendung standardmäßig automatisch weiterleitet. Dies ist nur ein Teil der verschiedenen Ansichten zur Verwaltung von Records. Im nächsten Abschnitt wird der Zweck der anderen Ansichten beschrieben, die ausgewählt werden können, nachdem Sie zur Übersichtsseite von Records zurückgekehrt sind.

source: One or more record links already existed and were not created.
de: Ein oder mehrere Record-Links existierten bereits und wurden nicht erstellt.

source: One or more redirect URIs are invalid.
de: Ein oder mehrere Redirect-URIs sind ungültig.

source: One or more scopes are invalid.
de: Eines oder mehrere Scopes sind ungültig.

source: One or multiple redirect URIs (one per line) that can be used for the authorization callback. URIs must match exactly and must not contain fragments.
de: Ein oder mehrere Redirect-URIs (einer pro Zeile), die für den Autorisierungs-Callback verwendet werden können. URIs müssen exakt übereinstimmen und dürfen keine Fragmente enthalten.

source: Only consider explicit permissions
de: Nur explizite Zugriffsrechte berücksichtigen

source: Only consider groups with membership
de: Nur Gruppen mit Mitgliedschaft berücksichtigen

source: Only visible to you.
de: Nur für Sie sichtbar.

source: Optional license of a record.
de: Optionale Lizenz eines Records.

source: Optional type of a record, e.g. dataset, experimental device, etc.
de: Optionaler Typ eines Records, z. B. Datensatz, Versuchsgerät, etc.

source: Optional type of this record, e.g. dataset, experimental device, etc.
de: Optionaler Typ dieses Records, z. B. Datensatz, Versuchsgerät, etc.

source: Options
de: Optionen

source: Outgoing record links
de: Ausgehende Record-Links

source: Overview
de: Übersicht

source: Parent collection
de: Eltern-Collection

source: Parent collections
de: Eltern-Collections

source: Password
de: Passwort

source: Password changed successfully.
de: Passwort erfolgreich geändert.

source: Password reset
de: Passwort zurücksetzen

source: Passwords do not match.
de: Passwörter stimmen nicht überein.

source: Pending
de: Ausstehend

source: Permissions
de: Zugriffsrechte

source: Persistent ID
de: Persistente ID

source: Personal access tokens
de: Persönliche Access Tokens

source: Please contact your home organization's help desk at %(a_open)s%(idp_support_contact)s%(a_close)s and request release for the missing attributes. To do this, click on the button below. This will open your mail program with the needed technical information to resolve this issue. You can add additional information and review the email before sending it. Alternatively, you can manually copy and paste the text from the following template:
de: Bitte wenden Sie sich an den Helpdesk Ihrer Heimatorganisation unter %(a_open)s%(idp_support_contact)s%(a_close)s und fordern Sie die Freigabe für die fehlenden Attribute an. Klicken Sie dazu auf die Schaltfläche unten. Daraufhin wird Ihr E-Mail-Programm mit den erforderlichen technischen Informationen zur Lösung dieses Problems geöffnet. Sie können zusätzliche Informationen hinzufügen und die E-Mail vor dem Versenden überprüfen. Alternativ können Sie auch den Text aus der folgenden Vorlage manuell kopieren und einfügen:

source: Please enter your username below.
de: Bitte geben Sie unten Ihren Benutzernamen ein.

source: Please select your institution
de: Bitte wählen Sie ihre Institution

source: Preferences
de: Präferenzen

source: Press x to cancel.
de: Drücken Sie x, um abzubrechen.

source: Previous file
de: Vorherige Datei

source: Previous record
de: Vorheriger Record

source: Previous revision
de: Vorherige Revision

source: Primary user
de: Primärer Benutzer

source: Privacy policy
de: Datenschutzerklärung

source: Private
de: Privat

source: Profile
de: Profil

source: Profile picture
de: Profilbild

source: Provided value
de: Gelieferter Wert

source: Public
de: Öffentlich

source: Public visibility automatically grants EVERY logged-in user read permissions for this collection.
de: Öffentliche Sichtbarkeit gewährt JEDEM angemeldeten Benutzer automatisch Leserechte für diese Collection.

source: Public visibility automatically grants EVERY logged-in user read permissions for this group.
de: Öffentliche Sichtbarkeit gewährt JEDEM angemeldeten Benutzer automatisch Leserechte für diese Gruppe.

source: Public visibility automatically grants EVERY logged-in user read permissions for this record.
de: Öffentliche Sichtbarkeit gewährt JEDEM angemeldeten Benutzer automatisch Leserechte für diesen Record.

source: Public visibility automatically grants EVERY logged-in user read permissions for this template.
de: Öffentliche Sichtbarkeit gewährt JEDEM angemeldeten Benutzer automatisch Leserechte für dieses Template.

source: Publish resource
de: Ressource publizieren

source: Publish via
de: Publizieren via

source: Publishing resource...
de: Ressource wird publiziert...

source: Publishing task started successfully.
de: Publizierungs-Task erfolgreich gestartet.

source: Quick search
de: Schnellsuche

source: Range
de: Wertebereich

source: Read only access.
de: Nur Lesezugriff.

source: Record created successfully.
de: Record erfolgreich erstellt.

source: Record link removed successfully.
de: Record-Link erfolgreich entfernt.

source: Record links created successfully.
de: Record-Links erfolgreich erstellt.

source: Record revisions
de: Recordrevisionen

source: Record successfully moved to the trash.
de: Record erfolgreich in den Papierkorb verschoben.

source: Records are the basic components of Kadi4Mat and can represent any kind of digital or digitalized object, e.g. arbitrary research data, samples, experimental devices or even individual processing steps.
de: Records sind die Grundkomponenten von Kadi4Mat und können jede Art von digitalem oder digitalisiertem Objekt repräsentieren, z. B. beliebige Forschungsdaten, Proben, Versuchsgeräte oder sogar individuelle Verarbeitungsschritte.

source: Records consist of metadata that can either stand alone or be linked to any number of corresponding data.
de: Records bestehen aus Metadaten, die entweder für sich alleine stehen oder mit einer beliebigen Anzahl von entsprechenden Daten verknüpft sein können.

source: Records shared with this group
de: Mit dieser Gruppe geteilte Records

source: Records shared with this user
de: Mit diesem Benutzer geteilte Records

source: Register
de: Registrieren

source: Register application
de: Applikation registrieren

source: Register local user
de: Lokalen Benutzer registrieren

source: Registered applications
de: Registrierte Applikationen

source: Registration completed successfully.
de: Registrierung erfolgreich abgeschlossen.

source: Remove current image
de: Aktuelles Bild entfernen

source: Remove current profile picture
de: Aktuelles Profilbild entfernen

source: Remove record link
de: Record-Link entfernen

source: Remove rule
de: Regel entfernen

source: Remove token
de: Token entfernen

source: Repeat new password
de: Neues Passwort wiederholen

source: Repeat password
de: Passwort wiederholen

source: Report problem to your home organization's help desk
de: Problem an den Helpdesk Ihrer Heimatorganisation melden

source: Request limit exceeded, please try again later.
de: Anfragelimit überschritten, bitte versuchen Sie es später noch einmal.

source: Require all users to accept the terms of use and/or privacy policy, if at least one of them is configured.
de: Verlangen Sie von allen Benutzern, dass sie die Nutzungsbedingungen und/oder die Datenschutzerklärung akzeptieren, wenn mindestens eine von diesen konfiguriert ist.

source: Required
de: Erforderlich

source: Resend
de: Erneut senden

source: Resource types and corresponding filters to be shown on the home page in the "Latest Updates" section.
de: Ressourcentypen und entsprechende Filter, die auf der Startseite im Abschnitt "Neueste Updates" angezeigt werden sollen.

source: Resources
de: Ressourcen

source: Restart tour
de: Tour neustarten

source: Restore
de: Wiederherstellen

source: Return to the homepage.
de: Zurück zur Homepage.

source: Revisions
de: Revisionen

source: Revoke access
de: Zugriff widerrufen

source: Revoked
de: Widerrufen

source: Role
de: Rolle

source: Rules
de: Regeln

source: Running
de: Laufend

source: Save changes
de: Änderungen speichern

source: Save changes and quit
de: Änderungen speichern und beenden

source: Save new password
de: Neues Passwort speichern

source: Save selection
de: Auswahl speichern

source: Saved searches
de: Gespeicherte Suchen

source: Scopes allow a token to access certain resources or actions. If no scopes are selected, only some basic API endpoints can be used.
de: Scopes ermöglichen es einem Token, auf bestimmte Ressourcen oder Aktionen zuzugreifen. Wenn keine Scopes ausgewählt sind, können nur einige grundlegende API-Endpunkte verwendet werden.

source: Scopes allow an application to access certain resources or actions. If no scopes are selected, only some basic API endpoints can be used.
de: Scopes ermöglichen einer Applikation den Zugriff auf bestimmte Ressourcen oder Aktionen. Wenn keine Scopes ausgewählt sind, können nur einige grundlegende API-Endpunkte verwendet werden.

source: Search for a license
de: Nach einer Lizenz suchen

source: Search for collections
de: Nach Collections suchen

source: Search for record templates
de: Nach Record-Templates suchen

source: Search for records
de: Nach Records suchen

source: Secondary user
de: Sekundärer Benutzer

source: Select MIME types
de: MIME-Typen auswählen

source: Select a record template
de: Wählen Sie ein Record-Template

source: Select collections
de: Collections auswählen

source: Select tags
de: Tags auswählen

source: Select types
de: Typen auswählen

source: Select users
de: Benutzer auswählen

source: Send a test email to yourself using the email and SMTP settings the application is configured with.
de: Senden Sie eine Test-E-Mail an sich selbst unter Verwendung der E-Mail- und SMTP-Einstellungen, mit denen die Anwendung konfiguriert ist.

source: Send test email
de: Test-E-Mail senden

source: Service connected successfully.
de: Dienst erfolgreich verbunden.

source: Service disconnected successfully.
de: Dienst erfolgreich getrennt.

source: Settings
de: Einstellungen

source: Shift
de: Umschalt

source: Show active users only
de: Nur aktive Benutzer anzeigen

source: Show broadcast message publicly
de: Broadcast-Nachricht öffentlich anzeigen

source: Show email address on profile
de: E-Mail-Adresse im Profil anzeigen

source: Show link overview
de: Link-Übersicht anzeigen

source: Show the broadcast message to unauthenticated users as well.
de: Die Broadcast-Nachricht auch nicht authentifizierten Benutzern anzeigen.

source: Shown at the top of all pages to all authenticated users.
de: Wird oben auf allen Seiten für alle authentifizierten Benutzer angezeigt.

source: Shown on all pages in the footer next to the existing navigation items.
de: Wird auf allen Seiten in der Fußzeile neben den bestehenden Navigationselementen angezeigt.

source: Shown on the index page next to the index image.
de: Wird auf der Startseite neben dem Indexbild angezeigt.

source: Shown on the index page next to the index text.
de: Wird auf der Startseite neben dem Indextext angezeigt.

source: Similar to other resources, templates have their own navigation menu, offering different tabs for viewing and managing templates.
de: Ähnlich wie bei anderen Ressourcen gibt es für Templates ein eigenes Navigationsmenü mit verschiedenen Tabs zur Anzeige und Verwaltung von Templates.

source: Similar to records, collections have their own navigation menu, offering different tabs for viewing and managing collections. As most of the contents are similar to those of records, only the main differences are listed in the following sections.
de: Ähnlich wie bei Records haben Collections ihr eigenes Navigationsmenü, das verschiedene Tabs zur Anzeige und Verwaltung von Collections bietet. Da die meisten Inhalte denen von Records ähnlich sind, werden in den folgenden Abschnitten nur die wichtigsten Unterschiede aufgeführt.

source: Size of active files
de: Größe der aktiven Dateien

source: Size of database
de: Größe der Datenbank

source: Some parts of the API may also be tested out directly via the web browser by navigating to %(a_api_open)s%(api_link)s%(a_close)s, while an OpenAPI specification of the API can be retrieved via %(a_apispec_open)s%(apispec_link)s%(a_close)s. Note that both links require being logged in.
de: Einige Teile der API können auch direkt über den Webbrowser getestet werden, durch Navigation zu %(a_api_open)s%(api_link)s%(a_close)s, während eine OpenAPI-Spezifikation der API über %(a_apispec_open)s%(apispec_link)s%(a_close)s abgerufen werden kann. Beachten Sie, dass beide Links erfordern, eingeloggt zu sein.

source: Sort by
de: Sortieren nach

source: Source code and issue tracking
de: Quellcode und Issue-Tracking

source: Specifying an optional license can determine the conditions for the correct reuse of data and metadata when the record is published or simply shared with other users. A license can also be uploaded as a file, in which case one of the "Other" licenses can be chosen.
de: Durch die Angabe einer optionalen Lizenz können die Bedingungen für die korrekte Wiederverwendung von Daten und Metadaten festgelegt werden, wenn der Record publiziert oder einfach nur mit anderen Benutzern geteilt wird. Eine Lizenz kann auch als Datei hochgeladen werden. In diesem Fall kann eine der "Other"-Lizenzen gewählt werden.

source: Start interactive tour
de: Interaktive Tour starten

source: Statistics
de: Statistiken

source: Storage type
de: Speichertyp

source: String must not be empty.
de: String darf nicht leer sein.

source: Submit request
de: Anfrage absenden

source: Success
de: Erfolgreich

source: Supports wildcards (e.g. *@*.example.edu).
de: Unterstützt Wildcards (z. B. *@*.example.edu).

source: System information
de: Systeminformationen

source: System role
de: Systemrolle

source: System roles
de: Systemrollen

source: Tags cannot be longer than %(num)d character.
de: Tags können nicht länger als %(num)d Zeichen sein.

source: Tags must not be empty.
de: Tags dürfen nicht leer sein.

source: Task failed.
de: Task fehlgeschlagen.

source: Task no longer exists.
de: Task nicht mehr vorhanden.

source: Task revoked.
de: Task widerrufen.

source: Task running...
de: Task läuft...

source: Task succeeded.
de: Task erfolgreich.

source: Template created successfully.
de: Template erfolgreich erstellt.

source: Template data
de: Template-Daten

source: Template successfully moved to the trash.
de: Template erfolgreich in den Papierkorb verschoben.

source: Templates enable the creation of blueprints for different resources. There are multiple types of templates, which define the actual content that a template can contain. The following types of templates currently exist:
de: Templates ermöglichen die Erstellung von Vorlagen für verschiedene Ressourcen. Es gibt mehrere Arten von Templates, die den eigentlichen Inhalt definieren, den ein Template enthalten kann. Derzeit gibt es die folgenden Arten von Templates:

source: Templates shared with this group
de: Mit dieser Gruppe geteilte Templates

source: Templates shared with this user
de: Mit diesem Benutzer geteilte Templates

source: Terms of use
de: Nutzungsbedingungen

source: The ORCID iD is publicly displayed in your profile and may be used when exporting or publishing resources.
de: Die ORCID iD wird öffentlich in Ihrem Profil angezeigt und kann beim Exportieren oder Veröffentlichen von Ressourcen verwendet werden.

source: The URL of the application (displayed to users).
de: Die URL der Applikation (wird den Benutzern angezeigt).

source: The actual content of this template, depending on its type.
de: Der eigentliche Inhalt dieses Templates, abhängig von seinem Typ.

source: The application %(client)s, which was created by %(user)s, is requesting access to your Kadi4Mat account. Please verify the authenticity of the application before authorizing it to act on your behalf via the HTTP API of Kadi4Mat.
de: Die Applikation %(client)s, die von %(user)s erstellt wurde, beantragt den Zugriff auf Ihr Kadi4Mat-Konto. Bitte überprüfen Sie die Authentizität der Applikation, bevor Sie diese dazu autorisieren, in Ihrem Namen über die HTTP-API von Kadi4Mat zu agieren.

source: The default expiration date is %(num)d weeks.
de: Das standardmäßige Ablaufdatum beträgt %(num)d Wochen.

source: The display name may be changed later on.
de: Der Anzeigename kann zu einem späteren Zeitpunkt geändert werden.

source: The exported SHACL aims to be compatible with the structure supported by the %(a_open)sAIMS%(a_close)s application profile editor. Note that only the extra metadata of the template data is exported and that list values are handled using their indices as identifiers.
de: Das exportierte SHACL strebt Kompatibilität mit der vom %(a_open)sAIMS%(a_close)s-Anwendungsprofil-Editor unterstützten Struktur an. Beachten Sie, dass nur die Extra-Metadaten der Template-Daten exportiert werden und dass für Listenwerte deren Indizes als Bezeichner verwendet werden.

source: The first two items at the top right of the navigation bar right also provide quick access to create new resources and search for existing ones. The two dropdown menus on the far right can be used to quickly navigate to various informational pages and to access the current user's profile page, including their created and deleted resources (see also %(users_a_open)sUsers%(a_close)s). Furthermore, the latter makes it possible to access the %(settings_a_open)sSettings%(a_close)s and to log out.
de: Die ersten beiden Elemente oben rechts in der Navigationsleiste bieten außerdem einen schnellen Zugriff auf die Erstellung neuer und die Suche nach vorhandenen Ressourcen. Die beiden Dropdown-Menüs ganz rechts dienen der schnellen Navigation zu verschiedenen Informationsseiten und dem Zugriff auf die Profilseite des aktuellen Benutzers, einschließlich seiner erstellten und gelöschten Ressourcen (siehe auch %(users_a_open)sBenutzer%(a_close)s). Letzteres ermöglicht außerdem den Zugriff auf die %(settings_a_open)sEinstellungen%(a_close)s und den Logout.

source: The following permissions/scopes are requested by the application:
de: Die folgenden Zugriffsrechte/Scopes werden von der Applikation beantragt:

source: The following user information in form of SAML attributes is required by this service:
de: Die folgenden Benutzerinformationen in Form von SAML-Attributen werden von diesem Dienst benötigt:
