Repository: pypi-data/pypi-mirror-384
Catalog: packages/kadi/kadi-1.8.0-py3-none-any.whl/kadi/translations/*/LC_MESSAGES/messages.po
Languages: de

source: The goal of Kadi4Mat is to combine the ability to manage and exchange data, the %(em_open)srepository%(em_close)s component, with the possibility to analyze, visualize and transform said data, the %(em_open)selectronic lab notebook (ELN)%(em_close)s component. The focus on the repository component is on %(em_open)swarm data%(em_close)s, i.e. unpublished data that is yet to be analyzed further, while in the ELN component it is on the automated and documented execution of heterogeneous workflows via an application programming interface (API). In this way, a customizable framework is created that facilitates good research data management practices and collaboration between researchers.
de: Das Ziel von Kadi4Mat ist es, die Fähigkeit Daten zu verwalten und auszutauschen, die %(em_open)sRepositorium%(em_close)s-Komponente, mit der Möglichkeit zu kombinieren, diese Daten zu analysieren, zu visualisieren und zu transformieren, die %(em_open)selektronische Laborbuch (ELN)%(em_close)s-Komponente. Bei der Repositorium-Komponente liegt der Fokus auf %(em_open)swarmen%(em_close)s, d.h. unveröffentlichten, noch weiter zu analysierenden Daten, während bei der ELN-Komponente die automatisierte und dokumentierte Ausführung heterogener Workflows über eine Programmierschnittstelle (API) im Vordergrund steht. Auf diese Weise wird ein anpassungsfähiges Framework geschaffen, das gute Praktiken für die Verwaltung von Forschungsdaten und die Zusammenarbeit zwischen Forschern erleichtert.

source: The interactive tour will introduce the most important features of Kadi4Mat and is recommended in order to get started. More details and additional information can be found on the help page at any time.
de: Die interaktive Tour stellt die wichtigsten Funktionen von Kadi4Mat vor und wird für den Einstieg empfohlen. Weitere Details und zusätzliche Informationen können jederzeit auf der Hilfeseite gefunden werden.

source: The management of existing groups is similar to other resources as well. Besides the usual contents, there are additional tabs that allow viewing resources that have been shared with a group.
de: Die Verwaltung bestehender Gruppen ist ähnlich wie bei anderen Ressourcen. Neben den üblichen Inhalten gibt es zusätzliche Tabs, welche die Anzeige von Ressourcen ermöglichen, die mit einer Gruppe geteilt wurden.

source: The metadata of the template itself.
de: Die Metadaten des Templates selbst.

source: The name of the application (displayed to users).
de: Der Name der Applikation (wird den Benutzern angezeigt).

source: The name of the link.
de: Der Name des Links.

source: The provider failed with an unexpected error.
de: Der Anbieter scheiterte mit einem unerwarteten Fehler.

source: The provider is configured incorrectly.
de: Der Provider ist falsch konfiguriert.

source: The requested URL could not be found.
de: Die angeforderte URL konnte nicht gefunden werden.

source: The service that redirected you here made an invalid authorization request.
de: Der Dienst, der Sie hierher umgeleitet hat, hat eine ungültige Autorisierungsanfrage gestellt.

source: The settings allow managing everything not directly related to the actual creation and management of resources. The navigation menu of the settings again provides access to different subpages.
de: In den Einstellungen kann alles verwaltet werden, was nicht direkt mit der eigentlichen Erstellung und Verwaltung von Ressourcen zu tun hat. Das Navigationsmenü der Einstellungen bietet wiederum Zugang zu verschiedenen Unterseiten.

source: The structure of the exported RO-Crate follows the %(a_open)sELN file format specification%(a_close)s that is currently under development. Note that the preview is limited to the %(em_open)sro-crate-metadata.json%(em_close)s file of the RO-Crate.
de: Die Struktur des exportierten RO-Crates folgt der %(a_open)sELN-Datenformat-Spezifikation%(a_close)s, die sich derzeit in der Entwicklung befindet. Beachten Sie, dass die Vorschau auf die %(em_open)sro-crate-metadata.json%(em_close)s-Datei des RO-Crates beschränkt ist.

source: The username needs to be unique and cannot be changed later on. Valid are alphanumeric characters with single hyphens or underscores in between.
de: Der Benutzername muss eindeutig sein und kann später nicht mehr geändert werden. Erlaubt sind alphanumerische Zeichen mit einzelnen Bindestrichen oder Unterstrichen dazwischen.

source: There are various possible ways to log in to Kadi4Mat. Each Kadi4Mat instance may have one or more authentication providers registered, which are briefly described below.
de: Es gibt verschiedene Möglichkeiten, sich in Kadi4Mat anzumelden. Jede Kadi4Mat-Instanz kann einen oder mehrere Authentifizierungs-Provider registriert haben, die im Folgenden kurz beschrieben werden.

source: They can also be grouped into collections or linked to other records, as described later.
de: Sie können auch in Collections gruppiert oder mit anderen Records verlinkt werden, wie später beschrieben.

source: This account is currently inactive.
de: Dieses Konto ist derzeit inaktiv.

source: This checksum can be used to verify the integrity of this file and is an MD5 hash of its content.
de: Diese Prüfsumme kann verwendet werden, um die Integrität dieser Datei zu überprüfen, und ist ein MD5-Hash des Dateiinhalts.

source: This checksum can be used to verify the integrity of this file and is created in multiple steps. First, MD5 hashes are calculated of all individual chunk contents used when uploading this file (with a chunk size of %(size)s). These hashes are concatenated (in chunk index order) and an MD5 hash of the result is calculated. Finally, a dash and the amount of chunks are appended.
de: Diese Prüfsumme kann verwendet werden, um die Integrität dieser Datei zu überprüfen und wird in mehreren Schritten erstellt. Zuerst werden MD5-Hashes von allen einzelnen Chunk-Inhalten berechnet, die zum Hochladen dieser Datei verwendet wurden (mit einer Chunk-Größe von %(size)s). Diese Hashes werden (in Reihenfolge der Chunk-Indizes) verkettet und ein MD5-Hash des Ergebnisses berechnet. Abschließend werden ein Bindestrich und die Anzahl der Chunks angehängt.

source: This menu can be used to create and manage personal access tokens (PATs). Creating a PAT makes it possible to directly interact with the HTTP API that Kadi4Mat provides. Detailed information about the API and PATs can be found in Kadi4Mat's %(a_docs_open)sdocumentation%(a_close)s.
de: Dieses Menü kann dazu verwendet werden, persönliche Access Tokens (PATs) zu erstellen und zu verwalten. Die Erstellung eines PATs ermöglicht die direkte Interaktion mit der HTTP-API, die Kadi4Mat zur Verfügung stellt. Detaillierte Informationen über die API und PATs können in der %(a_docs_open)sDokumentation%(a_close)s von Kadi4Mat gefunden werden.

source: This menu can be used to register and manage registered or authorized applications. An application can be used to integrate another service with the HTTP API that Kadi4Mat provides. For authorization, OAuth2 tokens are used, which an application can request by implementing the corresponding OAuth2 authorization flow. Detailed information about the API and OAuth2 tokens can be found in Kadi4Mat's %(a_open)sdocumentation%(a_close)s.
de: Dieses Menü kann dazu verwendet werden, Applikationen zu registrieren und registrierte oder autorisierte Applikationen zu verwalten. Eine Applikation kann verwendet werden, um einen anderen Dienst mit der HTTP-API zu integrieren, die Kadi4Mat zur Verfügung stellt. Für die Autorisierung werden OAuth2-Tokens verwendet, die eine Applikation durch Implementierung des entsprechenden OAuth2-Autorisierungs-Flows anfordern kann. Detaillierte Informationen zur API und zu OAuth2-Tokens können in der %(a_open)sDokumentation%(a_close)s von Kadi4Mat gefunden werden.

source: This method of authentication allows logging in using existing accounts managed by a specific LDAP (Lightweight Directory Access Protocol) installation. LDAP is a directory service commonly used for authenticating users and maintaining different kinds of information. Such a service can be deployed on different levels, e.g. for individual working groups or entire institutions.
de: Diese Authentifizierungsmethode ermöglicht die Anmeldung mit bestehenden Konten, die von einer bestimmten LDAP-Installation (Lightweight Directory Access Protocol) verwaltet werden. LDAP ist ein Verzeichnisdienst, der häufig für die Authentifizierung von Benutzern und die Verwaltung verschiedener Arten von Informationen verwendet wird. Ein solcher Dienst kann auf unterschiedlichen Ebenen eingesetzt werden, z. B. für einzelne Arbeitsgruppen oder gesamte Institutionen.

source: This method of authentication allows logging in using existing accounts of a user's home institution via the Shibboleth authentication protocol. Each institution needs to be configured separately in Kadi4Mat by a system administrator. Note that some institution's Identity Providers may not release all required user attributes to Kadi4Mat by default. In this case, the administrator of the Shibboleth Identity Provider may need to be contacted.
de: Diese Authentifizierungsmethode ermöglicht es, sich über das Shibboleth-Authentifizierungsprotokoll mit bestehenden Konten der Heimatinstitution eines Benutzers anzumelden. Jede Einrichtung muss separat in Kadi4Mat von einem Systemadministrator konfiguriert werden. Es ist zu beachten, dass die Identity Provider einiger Institutionen nicht alle erforderlichen Benutzerattribute standardmäßig an Kadi4Mat weitergeben. In diesem Fall muss der Administrator des Shibboleth Identity Providers kontaktiert werden.

source: This method of authentication allows logging in using existing accounts of one or more web-based, third-party services via the OpenID Connect authentication protocol. Each service has to be configured separately in Kadi4Mat by a system administrator. When authenticating with one of these services for the first time, users have to consent to Kadi4Mat accessing their user data.
de: Diese Authentifizierungsmethode ermöglicht es, sich mit bestehenden Konten von einem oder mehreren webbasierten Diensten von Drittanbietern über das OpenID Connect-Authentifizierungsprotokoll anzumelden. Jeder Dienst muss separat in Kadi4Mat von einem Systemadministrator konfiguriert werden. Bei der erstmaligen Authentifizierung mit einem dieser Dienste müssen die Benutzer dem Zugriff von Kadi4Mat auf ihre Benutzerdaten zustimmen.

source: This method of authentication uses separate accounts local to a specific Kadi4Mat instance. The credentials of each user consist of a unique username and a password. Depending on the configuration of an instance, registration of new accounts may be possible by individual users or only by system administrators.
de: Diese Authentifizierungsmethode verwendet separate Konten, die einer bestimmten Kadi4Mat-Instanz lokal zugeordnet sind. Die Anmeldedaten eines jeden Benutzers bestehen aus einem eindeutigen Benutzernamen und einem Passwort. Abhängig von der Konfiguration einer Instanz kann die Registrierung neuer Konten durch einzelne Benutzer oder nur durch Systemadministratoren möglich sein.

source: This page is only visible to the current user. Here, deleted resources can be found, namely deleted records, collections, templates or groups. Resources can either be restored or deleted permanently. The latter will also happen automatically after %(duration)s. Until then, the identifier of the deleted resources cannot be reused for newly created resources. Note that currently only the creator of a resource can restore or permanently delete it.
de: Diese Seite ist nur für den aktuellen Benutzer sichtbar. Hier können gelöschte Ressourcen gefunden werden, namentlich gelöschte Records, Collections, Templates oder Gruppen. Ressourcen können entweder wiederhergestellt oder dauerhaft gelöscht werden. Letzteres geschieht ebenfalls automatisch nach %(duration)s. Bis dahin kann der Identifier der gelöschten Ressourcen nicht für neu erstellte Ressourcen wiederverwendet werden. Beachten Sie, dass nur der Ersteller einer Ressource diese wiederherstellen oder dauerhaft löschen kann.

source: This page shows all accessible resources that a specific user created. When looking at other users, resources that were (explicitly) shared with a user, either directly or via groups, are shown as well, including common groups.
de: Auf dieser Seite werden alle zugreifbaren Ressourcen angezeigt, die ein bestimmter Benutzer erstellt hat. Bei der Betrachtung anderer Benutzer werden auch Ressourcen angezeigt, die (explizit) mit einem Benutzer geteilt wurden, entweder direkt oder über Gruppen, einschließlich gemeinsamer Gruppen.

source: This provider requires a service that is not yet connected to your account.
de: Dieser Provider erfordert einen Dienst, der noch nicht mit Ihrem Konto verbunden ist.

source: This record template will be applied automatically when selecting %(em_open)sDefault template%(em_close)s when linking new records to this collection via %(em_open)sLink record%(em_close)s.
de: Dieses Record-Template wird automatisch verwendet, wenn Sie %(em_open)sStandard-Template%(em_close)s auswählen beim Verlinken neuer Records zu dieser Collection über %(em_open)sRecord verlinken%(em_close)s.

source: This tab provides a history of changes to a record's metadata, file metadata and links to other records. By clicking on %(em_open)sView revision%(em_close)s of a revision item, a separate view will open, providing a more detailed overview of the respective revision and corresponding changes.
de: Dieser Tab bietet einen Überblick über die Änderungen an den Metadaten eines Records, den Metadaten von Dateien und den Links zu anderen Records. Durch Klicken auf %(em_open)sRevision anzeigen%(em_close)s eines Revisionselements öffnet sich eine separate Ansicht, die einen detaillierten Überblick über die jeweilige Revision und die entsprechenden Änderungen gibt.

source: This tab provides an overview of a collection, mainly related to its metadata. Additionally, the records that are part of a collection are directly listed in this overview.
de: Dieser Tab bietet einen Überblick über eine Collection, hauptsächlich in Bezug auf ihre Metadaten. Außerdem werden die Records, die Teil einer Collection sind, direkt in dieser Übersicht aufgeführt.

source: This tab provides an overview of a group, mainly related to its metadata. Additionally, the members of a group are shown in this overview. Managing the members of a group is comparable to managing the access permissions of other resources, as group membership is linked to the access permissions of a group. Specifically, as long as a user has any role in a group, they are a member of this group as well, while of course also having the respective permissions their role provides within the group.
de: Dieser Tab bietet einen Überblick über eine Gruppe, hauptsächlich in Bezug auf ihre Metadaten. Außerdem werden die Mitglieder einer Gruppe in dieser Übersicht angezeigt. Die Verwaltung der Mitglieder einer Gruppe ist vergleichbar mit der Verwaltung der Zugriffsrechte anderer Ressourcen, da die Gruppenzugehörigkeit mit den Zugriffsrechten einer Gruppe verknüpft ist. Solange ein Benutzer eine beliebige Rolle in einer Gruppe innehat, ist dieser auch Mitglied dieser Gruppe, wobei natürlich auch die entsprechenden Rechte gelten, die seine Rolle innerhalb der Gruppe vorsieht.

source: This tab provides an overview of a record, mainly related to its metadata. Here, it is possible to edit or copy a record, if the corresponding permissions are fulfilled, where editing a record also allows deleting it. Note that this will move the record to the trash first, see also %(a_open)sUsers%(a_close)s. Furthermore, records can be exported in various formats, published or favorited. Note that the publishing functionality is only available if at least one publication provider has been registered with the application.
de: Dieser Tab bietet einen Überblick über einen Record, hauptsächlich in Bezug auf seine Metadaten. Hier ist es möglich, einen Record zu bearbeiten oder zu kopieren, wenn die entsprechenden Zugriffsrechte vorhanden sind, wobei die Bearbeitung eines Records auch das Löschen desselben ermöglicht. Beachten Sie, dass dadurch der Record zuerst in den Papierkorb verschoben wird, siehe auch %(a_open)sBenutzer%(a_close)s. Außerdem können Records in verschiedenen Formaten exportiert, publiziert oder favorisiert werden. Beachten Sie, dass die Funktionalität zum Publizieren nur verfügbar ist, wenn mindestens ein Publikations-Provider in der Anwendung registriert ist.

source: This tab provides an overview of the access permissions granted to individual users or groups of multiple users for a specific record. New permissions can be granted if the corresponding permissions to do so are fulfilled, which currently works by using predefined roles. Details about the specific permissions and actions each role provides can be found by clicking on the %(em_open)sRoles%(em_close)s popover.
de: Dieser Tab bietet einen Überblick über die Zugriffsrechte, die einzelnen Benutzern oder Gruppen von mehreren Benutzern für einen bestimmten Record gewährt wurden. Neue Zugriffsrechte können erteilt werden, wenn die entsprechenden Zugriffsrechte dafür erfüllt sind, was derzeit über vordefinierte Rollen funktioniert. Details zu den spezifischen Berechtigungen und Aktionen, die jede Rolle bietet, finden Sie durch Klicken auf das %(em_open)sRollen%(em_close)s-Popover.

source: This tab provides an overview of the files associated with a record. Given the corresponding permissions, new files can be added, which is usually done by uploading locally stored files. However, certain types of files may also be created directly via the web interface. Existing files can either be downloaded in bulk or individually using the quick navigation menu of each file. Depending on permissions, this navigation also shows additional actions to quickly manage files.
de: Dieser Tab bietet einen Überblick über die mit einem Record verknüpften Dateien. Mit den entsprechenden Zugriffsrechten können neue Dateien hinzugefügt werden, was in der Regel durch Hochladen lokal gespeicherter Dateien geschieht. Bestimmte Dateitypen können jedoch auch direkt über die Weboberfläche erstellt werden. Bestehende Dateien können entweder auf einmal oder einzeln über die Schnellnavigation der jeweiligen Datei heruntergeladen werden. Je nach Zugriffsrecht zeigt diese Navigation auch zusätzliche Aktionen zur schnellen Verwaltung von Dateien an.

source: This tab provides an overview of the resources a record is linked with, which includes other records as well as collections. Collections represent logical groupings of multiple records, while links between records can specify their relationship and also contain additional metadata. Furthermore, record links can be visualized in an interactive graph. Clicking on a record link leads to a separate view, which provides a more detailed overview of the link and the associated records.
de: Dieser Tab bietet einen Überblick über die Ressourcen, mit denen ein Record verlinkt ist, was andere Records und Collections umfasst. Collections stellen logische Gruppierungen mehrerer Records dar, während Links zwischen Records deren Beziehung angeben können und auch zusätzliche Metadaten enthalten. Außerdem können Record-Links in einem interaktiven Graphen visualisiert werden. Ein Klick auf einen Record-Link führt zu einer separaten Ansicht, die einen detaillierteren Überblick über den Link und die zugehörigen Records bietet.

source: This view allows easier management of access permissions of records within this collection. The specified permissions will be applied to all records listed below, which are all linked records whose permissions can be changed by the current user.
de: Diese Ansicht ermöglicht die einfachere Verwaltung von Zugriffsrechten der Records innerhalb dieser Collection. Die ausgewählten Zugriffsrechte werden auf alle unten aufgeführten Records angewendet, wobei es sich um sämtliche verlinkten Records handelt, deren Zugriffsrechte vom aktuellen Benutzer geändert werden können.

source: This view allows the automated assignment of roles within this group using rules with different conditions. Currently, only username conditions can be specified. The selected role is applied to all users of the selected account type whose username matches the specified one. Wildcards are supported in the username by using asterisks (*), each corresponding to a sequence of zero or more arbitrary characters.
de: Diese Ansicht ermöglicht die automatische Zuweisung von Rollen innerhalb dieser Gruppe anhand von Regeln mit verschiedenen Bedingungen. Derzeit können nur Bedingungen für Benutzernamen angegeben werden. Die ausgewählte Rolle wird auf alle Benutzer des ausgewählten Kontotyps angewendet, deren Benutzername mit dem angegebenen übereinstimmt. Wildcards werden im Benutzernamen durch die Verwendung von Sternchen (*) unterstützt, die jeweils einer Folge von null oder mehr beliebigen Zeichen entsprechen.

source: Title
de: Titel

source: Toggle filters
de: Filter ein-/ausblenden

source: Toggle term IRI
de: Term-IRI ein-/ausblenden

source: Token invalid or expired.
de: Token ungültig oder abgelaufen.

source: Trash
de: Papierkorb

source: Type
de: Typ

source: Unexpected error.
de: Unerwarteter Fehler.

source: Unique identifier of a record.
de: Eindeutiger Identifier eines Records.

source: Unique identifier of this collection.
de: Eindeutiger Identifier dieser Collection.

source: Unique identifier of this group.
de: Eindeutiger Identifier dieser Gruppe.

source: Unique identifier of this record.
de: Eindeutiger Identifier dieses Records.

source: Unique identifier of this template.
de: Eindeutiger Identifier dieses Templates.

source: Unknown
de: Unbekannt

source: Unreachable
de: Nicht erreichbar

source: Update available
de: Update verfügbar

source: Update data
de: Daten aktualisieren

source: Upload as file
de: Als Datei hochladen

source: Upload files
de: Dateien hochladen

source: Usage statistics
de: Nutzungsstatistiken

source: User created successfully.
de: Benutzer erfolgreich erstellt.

source: User management
de: Benutzerverwaltung

source: User merge triggered successfully.
de: Benutzerzusammenführung erfolgreich gestartet.

source: User roles
de: Benutzerrollen

source: Username
de: Benutzername

source: Username is already in use.
de: Benutzername wird bereits verwendet.

source: Users
de: Benutzer

source: Value is required.
de: Wert ist erforderlich.

source: View all
de: Alle anzeigen

source: View revisions
de: Revisionen anzeigen

source: View this collection.
de: Diese Collection lesen.

source: View this group.
de: Diese Gruppe lesen.

source: View this record and its files.
de: Diesen Record und seine Dateien lesen.

source: View this template.
de: Dieses Template lesen.

source: Visibility
de: Sichtbarkeit

source: Visit website
de: Website besuchen

source: Visualize links
de: Links visualisieren

source: Visualize record links
de: Record-Links visualisieren

source: Waiting for available resources...
de: Warten auf verfügbare Ressourcen...

source: Welcome to %(strong_open)sKadi4Mat%(strong_close)s, the generic and open source %(strong_open)svirtual research environment%(strong_close)s.
de: Willkommen bei %(strong_open)sKadi4Mat%(strong_close)s, der generischen und quelloffenen %(strong_open)svirtuellen Forschungsumgebung%(strong_close)s.

source: Welcome to Kadi4Mat.
de: Willkommen bei Kadi4Mat.
