import re
from rupython import __Общие_функции__

БезФлагов = 0
Знаки7бит = A = re.ASCII
Отладка = re.DEBUG
ИгнорРегистр = I = re.IGNORECASE
УчЛокаль = L = re.LOCALE
Многостроч = M = re.MULTILINE
ТочкаДляВсего = S = re.DOTALL
Многобайт = U = re.UNICODE
Развёрнутое = X = re.VERBOSE

class Шаблон:
    def __init__(экземпляр, объект):
        экземпляр.объект = объект
        экземпляр.флаги = объект.flags
        экземпляр.число_групп = объект.groups
        экземпляр.номераНазвГр = объект.groupindex
        экземпляр.шаблон = объект.pattern

    def Поиск(экземпляр, *ПА, **ИА):
        ИА = __Общие_функции__.Заменить_ключи_в_словаре(ИА, \
            { 'строка': 'string', 'нач_поз': 'pos', 'кон_поз': 'endpos' })
        return экземпляр.объект.search(*ПА, **ИА)

    def СовпадНач(экземпляр, *ПА, **ИА):
        ИА = __Общие_функции__.Заменить_ключи_в_словаре(ИА, \
            { 'строка': 'string', 'нач_поз': 'pos', 'кон_поз': 'endpos' })
        return экземпляр.объект.match(*ПА, **ИА)

    def ПолнСоотв(экземпляр, *ПА, **ИА):
        ИА = __Общие_функции__.Заменить_ключи_в_словаре(ИА, \
            { 'строка': 'string', 'нач_поз': 'pos', 'кон_поз': 'endpos' })
        return экземпляр.объект.fullmatch(*ПА, **ИА)

    def Разбить(экземпляр, *ПА, **ИА):
        ИА = __Общие_функции__.Заменить_ключи_в_словаре(ИА, \
            { 'строка': 'string', 'макс_делений': 'maxsplit' })
        return экземпляр.объект.split(*ПА, **ИА)

    def НайтиВсё(экземпляр, *ПА, **ИА):
        ИА = __Общие_функции__.Заменить_ключи_в_словаре(ИА, \
            { 'строка': 'string', 'нач_поз': 'pos', 'кон_поз': 'endpos' })
        return экземпляр.объект.findall(*ПА, **ИА)

    def ИскатьПеречисл(экземпляр, *ПА, **ИА):
        ИА = __Общие_функции__.Заменить_ключи_в_словаре(ИА, \
            { 'строка': 'string', 'нач_поз': 'pos', 'кон_поз': 'endpos' })
        return экземпляр.объект.finditer(*ПА, **ИА)

    def Заменить(экземпляр, *ПА, **ИА):
        ИА = __Общие_функции__.Заменить_ключи_в_словаре(ИА, \
            { 'замена': 'repl', 'строка': 'string', 'количество': 'count' })
        return экземпляр.объект.sub(*ПА, **ИА)

    def ЗаменитьСч(экземпляр, *ПА, **ИА):
        ИА = __Общие_функции__.Заменить_ключи_в_словаре(ИА, \
            { 'замена': 'repl', 'строка': 'string', 'количество': 'count' })
        return экземпляр.объект.subn(*ПА, **ИА)


class Соответствие:
    def __init__(экземпляр, объект):
        экземпляр.объект = объект
        экземпляр.нач_поз = объект.pos
        экземпляр.кон_поз = объект.endpos
        экземпляр.послИндекс = объект.lastindex
        экземпляр.послГруппа = объект.lastgroup
        экземпляр.регВыр = объект.re
        экземпляр.строка = объект.string

    def Развернуть(экземпляр, шаблон): return экземпляр.объект.expand(шаблон)
    def Группа(экземпляр, *группы): return экземпляр.объект.group(*группы)
    def __getitem__(экземпляр, индекс): return объект[индекс]

    def Группы(экземпляр, *ПА, **ИА):
        ИА = __Общие_функции__.Заменить_ключи_в_словаре(ИА, { 'по_умолчанию': 'default' })
        return экземпляр.объект.groups(*ПА, **ИА)

    def ИменовГруппы(экземпляр, *ПА, **ИА):
        ИА = __Общие_функции__.Заменить_ключи_в_словаре(ИА, { 'по_умолчанию': 'default' })
        return экземпляр.объект.groupdict(*ПА, **ИА)

    def Начало(экземпляр, *группа): return экземпляр.объект.start(*группа)
    def Конец(экземпляр, *группа): return экземпляр.объект.end(*группа)

Флаги = re.RegexFlag

def Создать(шаблон, флаги = 0): рез = re.compile(шаблон, flags = флаги); return Шаблон(re.compile(рез)) if type(рез) == re.Pattern else рез
def Поиск(шаблон, строка, флаги = 0): return re.search(шаблон, строка, flags = флаги)
def СовпадНач(шаблон, строка, флаги = 0): return re.match(шаблон, строка, flags = флаги)
def ПолнСоотв(шаблон, строка, флаги = 0): return re.fullmatch(шаблон, строка, flags = флаги)
def Разбить(шаблон, строка, макс_делений = 0, флаги = 0): return re.split(шаблон, строка, maxsplit = макс_делений, flags = флаги)
def НайтиВсё(шаблон, строка, флаги = 0): return re.findall(шаблон, строка, flags = флаги)
def ИскатьПеречисл(шаблон, строка, флаги = 0): return re.finditer(шаблон, строка, flags = флаги)
def Заменить(шаблон, замена, количество = 0, флаги = 0): return re.sub(шаблон, замена, строка, count = количество, flags = флаги)
def ЗаменитьСч(шаблон, замена, количество = 0, флаги = 0): return re.sub(шаблон, замена, строка, count = количество, flags = флаги)
def ЭкранШабл(шаблон): return re.escape(шаблон)
def ОчиститьКэш(): return re.purge()
