Repository: pypi-data/pypi-mirror-384
Catalog: packages/semantic-link-labs/semantic_link_labs-0.12.4.tar.gz/semantic_link_labs-0.12.4/src/sempy_labs/_bpa_translation/_model/_translations_*.po
Languages: am_et, ca_es, cs_cz, es_es, fi_fi, fr_fr, he_il, hi_in, it_it, pl_pl, ro_ro, te_in, th_th, tr_tr, uk_ua

source: Percentages should be formatted with thousands separators and 1 decimal
am_et: በመቶ አሃዝ በሺህ የሚቆጠሩ ሴፓራቶሮች እና 1 ዴሲማል መሰል መሆን አለበት
ca_es: Els percentatges s'han de formatar amb separadors de milers i 1 decimal
cs_cz: Procenta by měla být formátována s oddělovači tisíců a 1 desetinnou čárkou
es_es: Los porcentajes deben tener un formato con separadores de miles y 1 decimal
fi_fi: Prosenttiosuudet on muotoiltava tuhaterottimilla ja 1 desimaalilla
fr_fr: Les pourcentages doivent être formatés avec des milliers de séparateurs et 1 décimale
he_il: יש לעצב אחוזים עם מפרידי אלפים ונקודה עשרונית אחת
hi_in: प्रतिशत को हजारों विभाजक और 1 दशमलव के साथ स्वरूपित किया जाना चाहिए
it_it: Le percentuali devono essere formattate con separatori delle migliaia e 1 decimale
pl_pl: Wartości procentowe powinny być sformatowane z separatorami tysięcy i 1 miejscem dziesiętnym
ro_ro: Procentele trebuie formatate cu separatoare de mii și 1 zecimală
te_in: శాతాలను వేల సెపరేటర్లు మరియు 1 దశాంశాలతో ఫార్మాట్ చేయాలి.
th_th: เปอร์เซ็นต์ควรจัดรูปแบบด้วยตัวคั่นหลักพันและทศนิยม 1 ตัว
tr_tr: Yüzdeler binlik ayırıcı ve 1 ondalık sayı ile biçimlendirilmelidir
uk_ua: Відсотки повинні бути відформатовані з роздільниками тисяч і 1 десятковим дробом

source: Whole numbers should be formatted with thousands separators and no decimals
am_et: ሙሉ ቁጥሮች በሺህ የሚቆጠሩ ሴፓራቶሮች ና ምንም ዴሲማል የሌላቸው መሆን አለባቸው
ca_es: Els nombres enters s'han de formatar amb separadors de milers i sense decimals
cs_cz: Celá čísla by měla být formátována s oddělovači tisíců a bez desetinných míst
es_es: Los números enteros deben tener formato con separadores de miles y sin decimales
fi_fi: Kokonaisluvut on muotoiltava tuhaterottimilla ilman desimaaleja
fr_fr: Les nombres entiers doivent être formatés avec des milliers de séparateurs et sans décimales
he_il: יש לעצב מספרים שלמים עם מפרידי אלפים וללא מספרים עשרוניים
hi_in: पूर्ण संख्याओं को हजारों विभाजकों के साथ स्वरूपित किया जाना चाहिए और दशमलव नहीं होना चाहिए
it_it: I numeri interi devono essere formattati con separatori delle migliaia e senza decimali
pl_pl: Liczby całkowite powinny być sformatowane z separatorami tysięcy i bez ułamków dziesiętnych
ro_ro: Numerele întregi ar trebui să fie formatate cu separatoare de mii și fără zecimale
te_in: మొత్తం సంఖ్యలను వేల సెపరేటర్లతో ఫార్మాట్ చేయాలి మరియు దశాంశాలు లేవు.
th_th: จํานวนเต็มควรจัดรูปแบบด้วยตัวคั่นหลักพันและไม่มีทศนิยม
tr_tr: Tam sayılar binlik ayırıcı ile biçimlendirilmeli ve ondalık basamak kullanılmamalıdır
uk_ua: Цілі числа повинні бути відформатовані з роздільниками тисяч і без десяткових дробів

source: Hide foreign keys
am_et: የውጭ ቁልፎችን መደበቅ
ca_es: Amaga les claus estrangeres
cs_cz: Skrýt cizí klíče
es_es: Ocultar claves foráneas
fi_fi: Piilota viiteavaimet
fr_fr: Masquer les clés étrangères
he_il: הסתרת מפתחות זרים
hi_in: विदेशी कुंजी छुपाएं
it_it: Nascondi le chiavi esterne
pl_pl: Ukrywanie kluczy obcych
ro_ro: Ascundeți cheile străine
te_in: విదేశీ కీలను దాచండి
th_th: ซ่อนคีย์ต่างประเทศ
tr_tr: Yabancı anahtarları gizle
uk_ua: Приховування зовнішніх ключів

source: Mark primary keys
am_et: የማርቆስ ዋና ቁልፍ
ca_es: Marca les claus primàries
cs_cz: Označení primárních klíčů
es_es: Marcar claves principales
fi_fi: Perusavainten merkitseminen
fr_fr: Marquer les clés primaires
he_il: סימון מפתחות ראשיים
hi_in: प्राथमिक कुंजियों को चिह्नित करें
it_it: Contrassegnare le chiavi primarie
pl_pl: Oznaczanie kluczy podstawowych
ro_ro: Marcarea cheilor primare
te_in: ప్రాథమిక కీలను మార్క్ చేయండి
th_th: ทําเครื่องหมายคีย์หลัก
tr_tr: Birincil anahtarları işaretleme
uk_ua: Позначення первинних ключів

source: Month (as a string) must be sorted
am_et: ወር (እንደ አውታር) መለየት አለበት
ca_es: El mes (com a cadena) s'ha d'ordenar
cs_cz: Month (jako řetězec) musí být seřazen
es_es: El mes (como una cadena) debe ordenarse
fi_fi: Kuukausi (merkkijonona) on lajiteltava
fr_fr: Le mois (sous forme de chaîne) doit être trié
he_il: יש למיין חודש (כמחרוזת)
hi_in: माह (स्ट्रिंग के रूप में) सॉर्ट किया जाना चाहिए
it_it: Il mese (come stringa) deve essere ordinato
pl_pl: Miesiąc (jako ciąg) musi być posortowany
ro_ro: Luna (ca șir) trebuie sortată
te_in: నెలను (తీగగా) క్రమబద్ధీకరించాలి.
th_th: ต้องเรียงลําดับเดือน (เป็นสตริง)
tr_tr: Ay (dize olarak) sıralanmalıdır
uk_ua: Місяць (як рядок) повинен бути відсортований

source: Relationship columns should be of integer data type
am_et: የግንኙነት ዓምዶች integer data type መሆን አለባቸው
ca_es: Les columnes de relació han de ser de tipus de dades enteres
cs_cz: Sloupce relací by měly být celočíselného datového typu
es_es: Las columnas de relación deben ser de tipo de datos enteros
fi_fi: Suhdesarakkeiden tietotyypin on oltava kokonaisluku
fr_fr: Les colonnes de relation doivent être de type entier
he_il: עמודות קשרי גומלין צריכות להיות מסוג נתונים שלמים
hi_in: संबंध स्तंभ पूर्णांक डेटा प्रकार के होने चाहिए
it_it: Le colonne delle relazioni devono essere di tipo integer
pl_pl: Kolumny relacji powinny być typu danych całkowitych
ro_ro: Coloanele de relație trebuie să fie de tip de date întreg
te_in: రిలేషన్ షిప్ కాలమ్ లు పూర్తి సంఖ్యల డేటా రకానికి చెందినవిగా ఉండాలి.
th_th: คอลัมน์ความสัมพันธ์ควรเป็นชนิดข้อมูลจํานวนเต็ม
tr_tr: İlişki sütunları tamsayı veri türünde olmalıdır
uk_ua: Стовпці зв'язків повинні мати цілочисельний тип даних

source: Provide format string for "Month" columns
am_et: ለ"ወር" ዓምዶች ፎርማት አውታረ መረብ አቅርበው
ca_es: Proporcioneu una cadena de format per a les columnes "Mes"
cs_cz: Zadejte formátovací řetězec pro sloupce "Měsíc".
es_es: Proporcionar cadena de formato para las columnas "Mes"
fi_fi: Anna Kuukausi-sarakkeiden muotoilumerkkijono
fr_fr: Fournir une chaîne de format pour les colonnes « Mois »
he_il: ספק מחרוזת תבנית עבור עמודות "חודש"
hi_in: "महीना" स्तंभों के लिए स्वरूप स्ट्रिंग प्रदान करें
it_it: Specificare la stringa di formato per le colonne "Mese"
pl_pl: Podaj ciąg formatu dla kolumn "Miesiąc"
ro_ro: Furnizați șirul de format pentru coloanele "Lună"
te_in: "నెల" కాలమ్ ల కొరకు ఫార్మాట్ స్ట్రింగ్ అందించండి
th_th: ระบุสตริงรูปแบบสําหรับคอลัมน์ "เดือน"
tr_tr: "Ay" sütunları için biçim dizesi sağlayın
uk_ua: Укажіть рядок формату для стовпчиків «Місяць»

source: Format flag columns as Yes/No value strings
am_et: ፎርማት የባንዲራ ዓምዶች እንደ አዎ/አይደለም ዋጋ አውታረ መረብ
ca_es: Formata les columnes de l'indicador com a cadenes de valor Sí/No
cs_cz: Formátování sloupců příznaků jako řetězců hodnot Ano/Ne
es_es: Dar formato a las columnas de marca como cadenas de valores Sí/No
fi_fi: Lippusarakkeiden muotoileminen Kyllä/Ei-arvomerkkijonoiksi
fr_fr: Mettre en forme les colonnes d’indicateur sous forme de chaînes de valeurs Oui/Non
he_il: עיצוב עמודות דגל כמחרוזות ערך כן/לא
hi_in: ध्वज स्तंभों को हाँ/नहीं मान स्ट्रिंग के रूप में स्वरूपित करें
it_it: Formattare le colonne dei flag come stringhe di valore Sì/No
pl_pl: Formatowanie kolumn flagi jako ciągów wartości Tak/Nie
ro_ro: Formatarea coloanelor de steag ca șiruri de valori Da/Nu
te_in: ఫ్లాగ్ కాలమ్ లను అవును/కాదు వాల్యూ స్ట్రింగ్ లుగా ఫార్మాట్ చేయండి
th_th: จัดรูปแบบคอลัมน์ธงเป็นสตริงค่าใช่/ไม่ใช่
tr_tr: Bayrak sütunlarını Evet/Hayır değer dizeleri olarak biçimlendirme
uk_ua: Форматувати стовпці прапорців як рядки значень «Так/Ні»

source: Objects should not start or end with a space
am_et: እቃዎች በቦታ መጀመር ወይም ማብቃት የለባቸውም
ca_es: Els objectes no han de començar ni acabar amb un espai
cs_cz: Objekty by neměly začínat ani končit mezerou
es_es: Los objetos no deben comenzar ni terminar con un espacio
fi_fi: Objektit eivät saa alkaa tai päättyä välilyönnillä
fr_fr: Les objets ne doivent pas commencer ou se terminer par un espace
he_il: אובייקטים אינם אמורים להתחיל או להסתיים ברווח
hi_in: ऑब्जेक्ट को किसी स्थान से प्रारंभ या समाप्त नहीं होना चाहिए
it_it: Gli oggetti non devono iniziare o terminare con uno spazio
pl_pl: Obiekty nie powinny zaczynać się ani kończyć spacją
ro_ro: Obiectele nu trebuie să înceapă sau să se termine cu un spațiu
te_in: ఆబ్జెక్ట్ లు స్పేస్ తో ప్రారంభం కాకూడదు లేదా ముగియరాదు.
th_th: วัตถุไม่ควรขึ้นต้นหรือลงท้ายด้วยช่องว่าง
tr_tr: Nesneler bir boşlukla başlamamalı veya bitmemelidir
uk_ua: Об'єкти не повинні починатися або закінчуватися пробілом

source: First letter of objects must be capitalized
am_et: የእቃዎች የመጀመሪያ ፊደል መጠቀም አለበት
ca_es: La primera lletra dels objectes s'ha d'escriure en majúscula
cs_cz: První písmeno objektů musí být velké
es_es: La primera letra de los objetos debe escribirse en mayúscula
fi_fi: Objektien ensimmäinen kirjain on kirjoitettava isolla alkukirjaimella
fr_fr: La première lettre des objets doit être en majuscule
he_il: האות הראשונה של אובייקטים חייבת להיות רישית
hi_in: वस्तुओं के पहले अक्षर को कैपिटल किया जाना चाहिए
it_it: La prima lettera degli oggetti deve essere maiuscola
pl_pl: Pierwsza litera przedmiotów musi być wielka litera
ro_ro: Prima literă a obiectelor trebuie să fie scrisă cu majuscule
te_in: వస్తువుల యొక్క మొదటి అక్షరాన్ని క్యాపిటల్ చేయాలి
th_th: ตัวอักษรตัวแรกของวัตถุต้องเป็นตัวพิมพ์ใหญ่
tr_tr: Nesnelerin ilk harfi büyük yazılmalıdır
uk_ua: Перша буква предметів повинна бути написана з великої літери

source: Object names must not contain special characters
am_et: የግዕዝ ስሞች ልዩ ፊደሎችን መያዝ የለባቸውም
ca_es: Els noms d'objecte no han de contenir caràcters especials
cs_cz: Názvy objektů nesmí obsahovat speciální znaky
es_es: Los nombres de objeto no deben contener caracteres especiales
fi_fi: Objektien nimet eivät saa sisältää erikoismerkkejä
fr_fr: Les noms d’objet ne doivent pas contenir de caractères spéciaux
he_il: שמות אובייקטים אינם יכולים להכיל תווים מיוחדים
hi_in: ऑब्जेक्ट नामों में विशेष वर्ण नहीं होने चाहिए
it_it: I nomi degli oggetti non devono contenere caratteri speciali
pl_pl: Nazwy obiektów nie mogą zawierać znaków specjalnych
ro_ro: Numele obiectelor nu trebuie să conțină caractere speciale
te_in: ఆబ్జెక్ట్ పేర్లలో ప్రత్యేక అక్షరాలు ఉండరాదు.
th_th: ชื่อวัตถุต้องไม่มีอักขระพิเศษ
tr_tr: Nesne adları özel karakterler içermemelidir
uk_ua: Назви об'єктів не повинні містити спеціальних символів
