Repository: pypi-data/pypi-mirror-384
Catalog: packages/semantic-link-labs/semantic_link_labs-0.12.4.tar.gz/semantic_link_labs-0.12.4/src/sempy_labs/_bpa_translation/_model/_translations_*.po
Languages: am_et, ca_es, cs_cz, es_es, fi_fi, fr_fr, he_il, hi_in, it_it, pl_pl, ro_ro, te_in, th_th, tr_tr, uk_ua

source: Do not use floating point data types
am_et: ተንሳፋፊ ነጥብ የመረጃ አይነቶች አይጠቀሙ
ca_es: No utilitzeu tipus de dades de coma flotant
cs_cz: Nepoužívejte datové typy s plovoucí desetinnou čárkou
es_es: No utilice tipos de datos de punto flotante
fi_fi: Älä käytä liukulukutietotyyppejä
fr_fr: Ne pas utiliser de types de données à virgule flottante
he_il: אל תשתמש בסוגי נתונים של נקודה צפה
hi_in: फ़्लोटिंग पॉइंट डेटा प्रकारों का उपयोग न करें
it_it: Non utilizzare tipi di dati a virgola mobile
pl_pl: Nie należy używać typów danych zmiennoprzecinkowych
ro_ro: Nu utilizați tipuri de date în virgulă mobilă
te_in: ఫ్లోటింగ్ పాయింట్ డేటా రకాలను ఉపయోగించవద్దు.
th_th: อย่าใช้ชนิดข้อมูลทศนิยม
tr_tr: Kayan nokta veri türlerini kullanmayın
uk_ua: Не використовуйте типи даних з плаваючою комою

source: Avoid using calculated columns
am_et: የተሰሉ ዓምዶችን ከመጠቀም ተቆጠቡ
ca_es: Evitar l'ús de columnes calculades
cs_cz: Vyhněte se použití počítaných sloupců
es_es: Evite el uso de columnas calculadas
fi_fi: Laskettujen sarakkeiden käytön välttäminen
fr_fr: Évitez d’utiliser des colonnes calculées
he_il: הימנעות משימוש בעמודות מחושבות
hi_in: परिकलित स्तंभों का उपयोग करने से बचें
it_it: Evitare l'uso di colonne calcolate
pl_pl: Unikanie używania kolumn obliczeniowych
ro_ro: Evitați să folosiți coloane calculate
te_in: లెక్కించిన కాలమ్ లను ఉపయోగించడం మానుకోండి
th_th: หลีกเลี่ยงการใช้คอลัมน์จากการคํานวณ
tr_tr: Hesaplanmış sütunları kullanmaktan kaçının
uk_ua: Уникайте використання обчислюваних стовпців

source: Check if bi-directional and many-to-many relationships are valid
am_et: ባለትዳሮች እና ብዙ-ብዙ ግንኙነቶች ተቀባይነት ያላቸው መሆናቸውን ያረጋግጡ
ca_es: Comprovar si les relacions bidireccionals i de diversos a diversos són vàlides
cs_cz: Kontrola, zda jsou obousměrné relace a relace N:N platné
es_es: Compruebe si las relaciones bidireccionales y de varios a varios son válidas
fi_fi: Tarkista, ovatko kaksisuuntaiset ja monta-moneen-yhteydet kelvollisia
fr_fr: Vérifiez si les relations bidirectionnelles et plusieurs-à-plusieurs sont valides
he_il: בדוק אם קשרי גומלין דו-כיווניים וקשרי גומלין של רבים לרבים חוקיים
hi_in: जांचें कि क्या द्वि-दिशात्मक और कई-से-कई संबंध मान्य हैं
it_it: Verificare se le relazioni bidirezionali e molti-a-molti sono valide
pl_pl: Sprawdzanie, czy relacje dwukierunkowe i wiele-do-wielu są prawidłowe
ro_ro: Verificați dacă relațiile bidirecționale și multe-la-mai multe sunt valide
te_in: ద్వి-దిశ మరియు అనేక-టు-అనేక సంబంధాలు చెల్లుబాటు అవుతాయో లేదో తనిఖీ చేయండి
th_th: ตรวจสอบว่าความสัมพันธ์แบบสองทิศทางและแบบกลุ่มต่อกลุ่มถูกต้องหรือไม่
tr_tr: Çift yönlü ve çoka çok ilişkilerin geçerli olup olmadığını denetleyin
uk_ua: Перевірте, чи допустимі двонаправлені відносини та відношення «багато-до-багатьох»

source: Check if dynamic row level security (RLS) is necessary
am_et: ቀጣይ ረድፍ ደረጃ ደህንነት (RLS) አስፈላጊ መሆኑን ያረጋግጡ
ca_es: Comproveu si és necessària la seguretat dinàmica a nivell de fila (RLS)
cs_cz: Kontrola, jestli je nutné dynamické zabezpečení na úrovni řádků (RLS)
es_es: Compruebe si es necesaria la seguridad dinámica de nivel de fila (RLS)
fi_fi: Tarkista, tarvitaanko dynaamista rivitason suojausta (RLS)
fr_fr: Vérifiez si la sécurité dynamique au niveau des lignes (RLS) est nécessaire
he_il: בדוק אם יש צורך באבטחה דינמית ברמת שורה (RLS)
hi_in: जांचें कि डायनेमिक पंक्ति स्तर सुरक्षा (RLS) आवश्यक है या नहीं
it_it: Verificare se è necessaria la sicurezza dinamica a livello di riga (RLS)
pl_pl: Sprawdzanie, czy są wymagane dynamiczne zabezpieczenia na poziomie wiersza
ro_ro: Verificați dacă este necesară securitatea dinamică la nivel de rând (RLS)
te_in: డైనమిక్ రో లెవల్ సెక్యూరిటీ (RLS) అవసరమా అని చెక్ చేయండి
th_th: ตรวจสอบว่าจําเป็นต้องมีการรักษาความปลอดภัยระดับแถวแบบไดนามิก (RLS) หรือไม่
tr_tr: Dinamik satır düzeyi güvenliğin (RLS) gerekli olup olmadığını denetleyin
uk_ua: Перевірте, чи потрібен динамічний захист на рівні рядка (RLS)

source: Avoid using many-to-many relationships on tables used for dynamic row level security
am_et: ለቀጣይ ረድፍ ደረጃ ደህንነት በሚጠቀሙ ጠረጴዛዎች ላይ ብዙ-ብዙ ግንኙነቶችን ከመጠቀም ይቆጠቡ
ca_es: Eviteu utilitzar relacions de diversos a diversos a les taules utilitzades per a la seguretat dinàmica a nivell de fila
cs_cz: Vyhněte se používání relací M:N v tabulkách používaných pro dynamické zabezpečení na úrovni řádků
es_es: Evite el uso de relaciones de varios a varios en las tablas utilizadas para la seguridad dinámica de nivel de fila
fi_fi: Vältä monta-moneen-yhteyksien käyttämistä taulukoissa, joita käytetään dynaamiseen rivitason suojaukseen
fr_fr: Évitez d’utiliser des relations plusieurs-à-plusieurs sur les tables utilisées pour la sécurité au niveau des lignes dynamiques
he_il: הימנע משימוש בקשרי גומלין של רבים לרבים בטבלאות המשמשות לאבטחה דינאמית ברמת השורה
hi_in: डायनेमिक पंक्ति स्तर सुरक्षा के लिए उपयोग की जाने वाली तालिकाओं पर कई-से-अनेक संबंधों का उपयोग करने से बचें
it_it: Evitare l'utilizzo di relazioni molti-a-molti nelle tabelle utilizzate per la sicurezza dinamica a livello di riga
pl_pl: Unikanie używania relacji wiele-do-wielu w tabelach używanych do dynamicznych zabezpieczeń na poziomie wiersza
ro_ro: Evitați utilizarea relațiilor mai-mulți-la-mai mulți în tabelele utilizate pentru securitatea dinamică la nivel de rând
te_in: డైనమిక్ వరుస స్థాయి భద్రత కొరకు ఉపయోగించే టేబుల్ లపై అనేక-టు-అనేక సంబంధాలను ఉపయోగించడం మానుకోండి.
th_th: หลีกเลี่ยงการใช้ความสัมพันธ์แบบกลุ่มต่อกลุ่มบนตารางที่ใช้สําหรับการรักษาความปลอดภัยระดับแถวแบบไดนามิก
tr_tr: Dinamik satır düzeyi güvenlik için kullanılan tablolarda çoka çok ilişkiler kullanmaktan kaçının
uk_ua: Уникайте використання зв'язків «багато-до-багатьох» у таблицях, які використовуються для динамічної безпеки на рівні рядків

source: Many-to-many relationships should be single-direction
am_et: ብዙ-ወደ-ብዙ ግንኙነት ነጠላ-አቅጣጫ መሆን አለበት
ca_es: Les relacions de diversos a diversos han de ser unidireccionals
cs_cz: Relace N:N by měly být jednosměrné
es_es: Las relaciones de varios a varios deben ser unidireccionales
fi_fi: Monta-moneen-suhteiden tulisi olla yksisuuntaisia
fr_fr: Les relations plusieurs-à-plusieurs doivent être unidirectionnelles
he_il: קשרי גומלין של רבים לרבים צריכים להיות חד-כיווניים
hi_in: कई-से-कई रिश्ते एकल-दिशा वाले होने चाहिए
it_it: Le relazioni molti-a-molti devono essere unidirezionali
pl_pl: Relacje wiele-do-wielu powinny być jednokierunkowe
ro_ro: Relațiile mulți-la-mai mulți ar trebui să fie cu o singură direcție
te_in: అనేక బంధాలు సింగిల్ డైరెక్షన్ గా ఉండాలి.
th_th: ความสัมพันธ์แบบกลุ่มต่อกลุ่มควรเป็นแบบทิศทางเดียว
tr_tr: Çoka çok ilişkiler tek yönlü olmalıdır
uk_ua: Відносини «багато до багатьох» повинні бути односторонніми

source: Set IsAvailableInMdx to false on non-attribute columns
am_et: IsAvailableInMdx በማያጠያይቅ ዓምዶች ላይ ወደ ሐሰት ይምረጥ
ca_es: Definiu IsAvailableInMdx com a false a les columnes que no són d'atributs
cs_cz: Nastavte IsAvailableInMdx na false u sloupců bez atributů
es_es: Establezca IsAvailableInMdx en false en columnas que no sean atributos
fi_fi: Määritä IsAvailableInMdx-arvoksi false muissa kuin määritesarakkeissa
fr_fr: Définir IsAvailableInMdx à false sur les colonnes sans attributs
he_il: הגדר את IsAvailableInMdx ל- false בעמודות שאינן תכונות
hi_in: IsAvailableInMdx को गैर-विशेषता स्तंभों पर false पर सेट करें
it_it: Impostare IsAvailableInMdx su false nelle colonne non attributo
pl_pl: Ustaw wartość IsAvailableInMdx na false w kolumnach innych niż atrybuty
ro_ro: Setați IsAvailableInMdx la false pe coloanele non-atribute
te_in: నాన్-ఆట్రిబ్యూట్ కాలమ్ లపై తప్పుగా లభ్యం అయ్యే Is లభ్యతInMdx సెట్ చేయండి
th_th: ตั้งค่า IsAvailableInMdx เป็น false ในคอลัมน์ที่ไม่ใช่แอตทริบิวต์
tr_tr: Öznitelik olmayan sütunlarda IsAvailableInMdx değerini false olarak ayarlayın
uk_ua: Встановіть для параметра IsAvailableInMdx значення false для стовпців, які не є атрибутами

source: Set 'Data Coverage Definition' property on the DirectQuery partition of a hybrid table
am_et: የውሂብ ጠረጴዛ በDirectQuery ክፍፍሉ ላይ 'የዳታ ሽፋን ፍቺ' ንብረት ያስቀምጡ
ca_es: Definiu la propietat "Definició de cobertura de dades" a la partició DirectQuery d'una taula híbrida
cs_cz: Nastavení vlastnosti "Definice pokrytí dat" v oddílu DirectQuery hybridní tabulky
es_es: Establecer la propiedad "Definición de cobertura de datos" en la partición DirectQuery de una tabla híbrida
fi_fi: Tietojen kattavuuden määritysominaisuuden määrittäminen hybriditaulukon DirectQuery-osiossa
fr_fr: Définir la propriété « Définition de la couverture des données » sur la partition DirectQuery d’une table hybride
he_il: הגדר את המאפיין 'הגדרת כיסוי נתונים' במחיצת DirectQuery של טבלה היברידית
hi_in: हाइब्रिड तालिका के DirectQuery विभाजन पर 'डेटा कवरेज परिभाषा' गुण सेट करें
it_it: Impostare la proprietà 'Data Coverage Definition' nella partizione DirectQuery di una tabella ibrida
pl_pl: Ustawianie właściwości "Definicja pokrycia danych" na partycji DirectQuery tabeli hybrydowej
ro_ro: Setarea proprietății "Data Coverage Definition" pe partiția DirectQuery a unui tabel hibrid
te_in: హైబ్రిడ్ టేబుల్ యొక్క డైరెక్ట్ క్వెరీ విభజనపై 'డేటా కవరేజ్ డెఫినిషన్' ప్రాపర్టీని సెట్ చేయండి
th_th: ตั้งค่าคุณสมบัติ 'คําจํากัดความความครอบคลุมของข้อมูล' บนพาร์ติชัน DirectQuery ของตารางไฮบริด
tr_tr: Karma tablonun DirectQuery bölümünde 'Veri Kapsamı Tanımı' özelliğini ayarlayın
uk_ua: Встановіть властивість 'Data Coverage Definition' на розділі DirectQuery гібридної таблиці

source: Dual mode is only relevant for dimension tables if DirectQuery is used for the corresponding fact table
am_et: ድርብ ዘዴ ለስፋት ሠንጠረዦች ብቻ ጠቃሚ ነው DirectQuery ለተመጣጣኝ እውነታ ሠንጠረዥ ጥቅም ላይ የዋለ ከሆነ
ca_es: El mode dual només és rellevant per a les taules de dimensions si s'utilitza DirectQuery per a la taula de fets corresponent
cs_cz: Duální režim je relevantní pro tabulky dimenzí pouze v případě, že se pro odpovídající tabulku faktů používá DirectQuery
es_es: El modo dual solo es relevante para las tablas de dimensiones si se usa DirectQuery para la tabla de hechos correspondiente
fi_fi: Kaksoistila koskee dimensiotaulukoita vain, jos vastaavassa faktataulukossa käytetään DirectQueryä
fr_fr: Le mode dual n’est pertinent pour les tables de dimension que si DirectQuery est utilisé pour la table de faits correspondante
he_il: מצב כפול רלוונטי רק עבור טבלאות ממד אם נעשה שימוש ב- DirectQuery עבור טבלת העובדות המתאימה
hi_in: डुअल मोड केवल आयाम तालिकाओं के लिए प्रासंगिक है यदि DirectQuery का उपयोग संबंधित तथ्य तालिका के लिए किया जाता है
it_it: La modalità doppia è rilevante per le tabelle delle dimensioni solo se DirectQuery viene utilizzato per la tabella dei fatti corrispondente
pl_pl: Tryb podwójny ma zastosowanie w przypadku tabel wymiarów tylko wtedy, gdy tryb DirectQuery jest używany dla odpowiedniej tabeli faktów
ro_ro: Modul dual este relevant numai pentru tabelele de parametri dacă se utilizează DirectQuery pentru tabelul de fapte corespunzător
te_in: సంబంధిత ఫ్యాక్ట్ టేబుల్ కొరకు డైరెక్ట్ క్వెరీని ఉపయోగించినట్లయితే డైమెన్షన్ టేబుల్ లకు మాత్రమే డ్యూయల్ మోడ్ సముచితంగా ఉంటుంది.
th_th: โหมดคู่จะเกี่ยวข้องกับตารางมิติเท่านั้นถ้าใช้ DirectQuery สําหรับตารางข้อเท็จจริงที่สอดคล้องกัน
tr_tr: İkili mod, yalnızca ilgili olgu tablosu için DirectQuery kullanılıyorsa boyut tabloları için geçerlidir
uk_ua: Подвійний режим актуальний для розмірних таблиць лише в тому випадку, якщо для відповідної таблиці фактів використовується DirectQuery

source: Set dimensions tables to dual mode instead of import when using DirectQuery on fact tables
am_et: DirectQuery በእውነታ ሠንጠረዦች ላይ ስትጠቀም ከውጭ ከማስገባት ይልቅ ስፋት ጠረጴዛዎችን ወደ ድርብ ዘዴ አስቀምጥ
ca_es: Definir les taules de dimensions en mode dual en lloc d'importar quan s'utilitza el DirectQuery en taules de fets
cs_cz: Nastavení tabulek dimenzí do duálního režimu namísto importu při použití DirectQuery v tabulkách faktů
es_es: Establecer las tablas de dimensiones en modo dual en lugar de importar al usar DirectQuery en tablas de hechos
fi_fi: Dimensiotaulukoiden määrittäminen kaksoistilaan tuonnin sijaan, kun faktataulukoissa käytetään DirectQueryä
fr_fr: Définir les tables de dimensions en mode double au lieu de les importer lors de l’utilisation de DirectQuery sur des tables de faits
he_il: הגדרת טבלאות ממדים למצב כפול במקום ייבוא בעת שימוש ב- DirectQuery בטבלאות עובדות
hi_in: तथ्य तालिकाओं पर DirectQuery का उपयोग करते समय आयाम तालिकाओं को आयात करने के बजाय दोहरे मोड में सेट करें
it_it: Impostare le tabelle delle dimensioni in modalità doppia anziché in modalità di importazione quando si usa DirectQuery nelle tabelle dei fatti
pl_pl: Ustawianie tabel wymiarów w trybie podwójnym zamiast importowania podczas korzystania z trybu DirectQuery w tabelach faktów
ro_ro: Setarea tabelelor de parametri în modul dual în loc de import atunci când utilizați DirectQuery în tabele de fapte
te_in: ఫ్యాక్ట్ టేబుల్స్ పై డైరెక్ట్ క్వెరీని ఉపయోగిస్తున్నప్పుడు ఇంపోర్ట్ కు బదులుగా డైమెన్షన్స్ టేబుల్ లను డ్యూయల్ మోడ్ కు సెట్ చేయండి
th_th: ตั้งค่าตารางมิติเป็นโหมดคู่แทนการนําเข้าเมื่อใช้ DirectQuery บนตารางข้อเท็จจริง
tr_tr: Olgu tablolarında DirectQuery kullanırken içe aktarma yerine boyut tablolarını ikili moda ayarlayın
uk_ua: Установлення подвійного режиму в таблицях розмірів замість імпорту під час використання DirectQuery для таблиць фактів

source: Minimize Power Query transformations
am_et: የኃይል ጥያቄ ለውጥ መቀነስ
ca_es: Minimitzar les transformacions del Power Query
cs_cz: Minimalizace transformací Power Query
es_es: Minimizar las transformaciones de Power Query
fi_fi: Power Query -muunnosten minimointi
fr_fr: Réduire les transformations Power Query
he_il: מזעור המרות של Power Query
hi_in: Power Query रूपांतरणों को छोटा करना
it_it: Ridurre al minimo le trasformazioni di Power Query
pl_pl: Minimalizowanie przekształceń dodatku Power Query
ro_ro: Minimizarea transformărilor Power Query
te_in: కనిష్ట పవర్ Query పరివర్తనలు
th_th: ลดการแปลง Power Query ให้น้อยที่สุด
tr_tr: Power Query dönüşümlerini en aza indirme
uk_ua: Мінімізація перетворень Power Query

source: Consider a star-schema instead of a snowflake architecture
am_et: የበረዶ ቅንጣቶችን ንድፍ ከመሥራት ይልቅ ኮከብ-ሴማ እንደ ምሳሌ እንውሰድ
ca_es: Considereu un esquema d'estrelles en lloc d'una arquitectura de floc de neu
cs_cz: Zvažte hvězdicové schéma místo architektury sněhové vločky
es_es: Considere un esquema de estrella en lugar de una arquitectura de copo de nieve
fi_fi: Harkitse tähtikaaviota lumihiutalearkkitehtuurin sijaan
fr_fr: Considérez un schéma en étoile au lieu d’une architecture en flocon de neige
he_il: שקול סכימת כוכבים במקום ארכיטקטורת פתיתי שלג
hi_in: स्नोफ्लेक आर्किटेक्चर के बजाय स्टार-स्कीमा पर विचार करें
it_it: Si consideri uno schema a stella invece di un'architettura a fiocco di neve
pl_pl: Rozważ schemat gwiazdy zamiast architektury płatka śniegu
ro_ro: Luați în considerare o schemă în stea în loc de o arhitectură cu fulgi de zăpadă
te_in: స్నోఫ్లేక్ ఆర్కిటెక్చర్ కు బదులుగా నక్షత్ర-స్కీమాను పరిగణించండి
th_th: พิจารณา star-schema แทนสถาปัตยกรรมเกล็ดหิมะ
tr_tr: Kar tanesi mimarisi yerine bir yıldız şeması düşünün
uk_ua: Розглянемо схему зірки замість архітектури сніжинки

source: Avoid using views when using Direct Lake mode
am_et: Direct Lake mode በሚጠቀሙበት ጊዜ እይታዎች መጠቀም ያስወግዱ
ca_es: Evitar l'ús de visualitzacions quan s'utilitza el mode Llac directe
cs_cz: Vyhněte se používání zobrazení při použití režimu Přímé jezero
es_es: Evite el uso de vistas cuando se utilice el modo Direct Lake
fi_fi: Näkymien käyttämisen välttäminen Direct Lake -tilaa käytettäessä
fr_fr: Évitez d’utiliser des vues lors de l’utilisation du mode Direct Lake
he_il: הימנע משימוש בתצוגות בעת שימוש במצב Direct Lake
hi_in: डायरेक्ट लेक मोड का उपयोग करते समय दृश्यों का उपयोग करने से बचें
it_it: Evitare di utilizzare le visualizzazioni quando si utilizza la modalità Direct Lake
pl_pl: Unikaj używania widoków podczas korzystania z trybu Direct Lake
ro_ro: Evitați utilizarea vizualizărilor atunci când utilizați modul Direct Lake
te_in: డైరెక్ట్ లేక్ మోడ్ ఉపయోగిస్తున్నప్పుడు వ్యూలను ఉపయోగించవద్దు
th_th: หลีกเลี่ยงการใช้มุมมองเมื่อใช้โหมด Direct Lake
tr_tr: Direct Lake modunu kullanırken görünümleri kullanmaktan kaçının
uk_ua: Уникайте використання переглядів під час використання режиму Direct Lake

source: Avoid adding 0 to a measure
am_et: ወደ መለኪያ 0 ከመጨመር ተቆጠብ
ca_es: Evitar afegir 0 a una mesura
cs_cz: Vyhněte se přidání 0 do míry
es_es: Evite agregar 0 a una medida
fi_fi: Vältä 0:n lisäämistä mittariin
fr_fr: Évitez d’ajouter 0 à une mesure
he_il: הימנע מהוספת 0 למידה
hi_in: माप में 0 जोड़ने से बचें
it_it: Evitare di aggiungere 0 a una misura
pl_pl: Unikanie dodawania wartości 0 do miary
ro_ro: Evitați adăugarea de 0 la o măsură
te_in: కొలతకు 0 జోడించడం మానుకోండి
th_th: หลีกเลี่ยงการเพิ่ม 0 ลงในการวัด
tr_tr: Bir hesaplamaya 0 eklemekten kaçının
uk_ua: Уникайте додавання 0 до показника

source: Reduce usage of calculated tables
am_et: የስሌት ሠንጠረዦችን አጠቃቀም መቀነስ
ca_es: Reduir l'ús de taules calculades
cs_cz: Omezte využití počítaných tabulek
es_es: Reducir el uso de tablas calculadas
fi_fi: Laskettujen taulukoiden käytön vähentäminen
fr_fr: Réduire l’utilisation des tables calculées
he_il: צמצום השימוש בטבלאות מחושבות
hi_in: परिकलित तालिकाओं का उपयोग कम करें
it_it: Ridurre l'utilizzo delle tabelle calcolate
pl_pl: Zmniejszenie użycia tabel obliczeniowych
ro_ro: Reducerea utilizării tabelelor calculate
te_in: లెక్కించిన పట్టికల వాడకాన్ని తగ్గించండి.
th_th: ลดการใช้ตารางจากการคํานวณ
tr_tr: Hesaplanan tabloların kullanımını azaltın
uk_ua: Зменшіть використання обчислюваних таблиць

source: Reduce usage of calculated columns that use the RELATED function
am_et: ተዛማጅ ተግባርን የሚጠቀሙ የስሌት ዓምዶች አጠቃቀም መቀነስ
ca_es: Reduir l'ús de columnes calculades que utilitzen la funció RELATED
cs_cz: Omezit používání počítaných sloupců, které používají funkci RELATED
es_es: Reducir el uso de columnas calculadas que utilizan la función RELATED
fi_fi: RELATED-funktiota käyttävien laskettujen sarakkeiden käytön vähentäminen
fr_fr: Réduire l’utilisation des colonnes calculées qui utilisent la fonction RELATED
he_il: צמצום השימוש בעמודות מחושבות המשתמשות בפונקציה RELATED
hi_in: RELATED फ़ंक्शन का उपयोग करने वाले परिकलित स्तंभों का उपयोग कम करें
it_it: Ridurre l'utilizzo delle colonne calcolate che utilizzano la funzione RELATED
pl_pl: Zmniejsz użycie kolumn obliczeniowych, które używają funkcji RELATED
ro_ro: Reducerea utilizării coloanelor calculate care utilizează funcția RELATED
te_in: సంబంధిత విధిని ఉపయోగించే లెక్కించబడిన కాలమ్ ల వాడకాన్ని తగ్గించండి.
th_th: ลดการใช้คอลัมน์จากการคํานวณที่ใช้ฟังก์ชัน RELATED
tr_tr: RELATED işlevini kullanan hesaplanmış sütunların kullanımını azaltma
uk_ua: Зменште використання обчислюваних стовпців, у яких використовується функція RELATED

source: Avoid excessive bi-directional or many-to-many relationships
am_et: ከልክ ያለፈ ባለት-አቅጣጫ ወይም ብዙ-ወደ-ብዙ ግንኙነት አስወግድ
ca_es: Eviteu les relacions bidireccionals o de diversos a molts
cs_cz: Vyhněte se nadměrným obousměrným vztahům nebo relacím N:N
es_es: Evite las relaciones bidireccionales excesivas o de varios a varios
fi_fi: Vältä liiallisia kaksisuuntaisia tai monta-moneen-suhteita
fr_fr: Évitez les relations bidirectionnelles ou plusieurs-à-plusieurs excessives
he_il: הימנע מקשרי גומלין דו-כיווניים מוגזמים או מקשרי גומלין של רבים לרבים
hi_in: अत्यधिक द्वि-दिशात्मक या कई-से-कई संबंधों से बचें
it_it: Evitare un'eccessiva relazione bidirezionale o molti-a-molti
pl_pl: Unikanie nadmiernej liczby relacji dwukierunkowych lub wiele-do-wielu
ro_ro: Evitați relațiile bidirecționale excesive sau mulți-la-mai mulți
te_in: మితిమీరిన ద్వి-దిశ లేదా అనేక-టు-అనేక సంబంధాలను నివారించండి
th_th: หลีกเลี่ยงความสัมพันธ์แบบสองทิศทางหรือแบบกลุ่มต่อกลุ่มมากเกินไป
tr_tr: Aşırı çift yönlü veya çoktan çoğa ilişkilerden kaçının
uk_ua: Уникайте надмірних двонаправлених відносин або відносин «багато-до-багатьох»

source: Remove auto-date table
am_et: የመኪና-ቀን ጠረጴዛ አስወግድ
ca_es: Suprimeix la taula de data automàtica
cs_cz: Odebrat tabulku automatického data
es_es: Eliminar la tabla de fecha automática
fi_fi: Poista automaattinen päivämäärätaulukko
fr_fr: Supprimer la table de date automatique
he_il: הסרת טבלת תאריכים אוטומטיים
hi_in: ऑटो-डेट टेबल हटाएं
it_it: Rimuovi la tabella della data automatica
pl_pl: Usuń tabelę z automatyczną datą
ro_ro: Eliminați tabelul cu dată automată
te_in: ఆటో-డేట్ టేబుల్ తొలగించు
th_th: ลบตารางวันที่อัตโนมัติ
tr_tr: Otomatik tarih tablosunu kaldır
uk_ua: Видалити таблицю автоматичної дати

source: Date/calendar tables should be marked as a date table
am_et: የቀን/ቀን መቁጠሪያ ሠንጠረዦች የቀን ሠንጠረዥ ሆነው መታወቅ ይኖርባቸዋል
ca_es: Les taules de dates/calendari s'han de marcar com a taules de dates
cs_cz: Tabulky kalendářních dat a kalendářů by měly být označeny jako tabulka kalendářních dat
es_es: Las tablas de fecha/calendario deben marcarse como una tabla de fechas
fi_fi: Päivämäärä-/kalenteritaulukot on merkittävä päivämäärätaulukoksi
fr_fr: Les tables de dates/calendriers doivent être marquées comme une table de dates
he_il: טבלאות תאריך/לוח שנה צריכות להיות מסומנות כטבלת תאריכים
hi_in: दिनांक/कैलेंडर तालिकाओं को दिनांक तालिका के रूप में चिह्नित किया जाना चाहिए
it_it: Le tabelle data/calendario devono essere contrassegnate come tabella data
pl_pl: Tabele dat/kalendarzy powinny być oznaczone jako tabela dat
ro_ro: Tabelele de date/calendar trebuie marcate ca tabel de date
te_in: తేదీ/క్యాలెండర్ పట్టికలను తేదీ పట్టికగా మార్క్ చేయాలి.
th_th: ตารางวันที่/ปฏิทินควรถูกทําเครื่องหมายเป็นตารางวันที่
tr_tr: Tarih/takvim tabloları, tarih tablosu olarak işaretlenmelidir
uk_ua: Таблиці дати/календаря слід позначати як таблицю дат

source: Large tables should be partitioned
am_et: ትላልቅ ጠረጴዛዎች መከፋፈል አለባቸው
ca_es: Les taules grans s'han de dividir
cs_cz: Velké tabulky by měly být rozdělené na oddíly
es_es: Las tablas grandes deben estar particionadas
fi_fi: Suuret taulukot tulee jakaa osiin
fr_fr: Les tables volumineuses doivent être partitionnées
he_il: שולחנות גדולים צריכים להיות מחולקים למחיצות
hi_in: बड़ी तालिकाओं का विभाजन किया जाना चाहिए
it_it: Le tabelle di grandi dimensioni devono essere partizionate
pl_pl: Duże tabele powinny być podzielone na partycje
ro_ro: Tabelele mari ar trebui să fie partiționate
te_in: పెద్ద టేబుళ్లను విభజించాలి
th_th: โต๊ะขนาดใหญ่ควรแบ่งพาร์ติชัน
tr_tr: Büyük tablolar bölümlenmelidir
uk_ua: Великі столи повинні бути розділені

source: Limit row level security (RLS) logic
am_et: ረድፍ ደረጃ ደህንነት (RLS) ሎጂክ ገደብ
ca_es: Lògica de seguretat de nivell de fila límit (RLS)
cs_cz: Logika omezení zabezpečení na úrovni řádků (RLS)
es_es: Limitar la lógica de seguridad de nivel de fila (RLS)
fi_fi: Rajoita rivitason suojauslogiikkaa (RLS)
fr_fr: Logique de sécurité au niveau des lignes (RLS) limitée
he_il: לוגיקת הגבלת אבטחה ברמת שורה (RLS)
hi_in: पंक्ति स्तर सुरक्षा (RLS) तर्क सीमित करें
it_it: Logica di sicurezza a livello di riga limite (RLS)
pl_pl: Logika ograniczania zabezpieczeń na poziomie wiersza (RLS)
ro_ro: Logica de limitare a securității la nivel de rând (RLS)
te_in: వరుస స్థాయి భద్రత (RLS) లాజిక్ ని పరిమితం చేయండి
th_th: ตรรกะการรักษาความปลอดภัยระดับแถว (RLS) จํากัด
tr_tr: Satır düzeyi güvenlik (RLS) mantığını sınırla
uk_ua: Логіка захисту на рівні граничного рядка (RLS)

source: Model should have a date table
am_et: ሞዴል ቀን ጠረጴዛ ሊኖረው ይገባል
ca_es: El model ha de tenir una taula de dates
cs_cz: Model by měl mít tabulku kalendářních dat
es_es: El modelo debe tener una tabla de fechas
fi_fi: Mallissa on oltava päivämäärätaulukko
fr_fr: Le modèle doit avoir une table de dates
he_il: לדגם צריכה להיות טבלת תאריכים
hi_in: मॉडल में डेट टेबल होना चाहिए
it_it: Il modello deve avere una tabella data
pl_pl: Model powinien mieć tabelę dat
ro_ro: Modelul ar trebui să aibă un tabel de date
te_in: మోడల్ కు తేదీ పట్టిక ఉండాలి
th_th: โมเดลควรมีตารางวันที่
tr_tr: Modelin bir tarih tablosu olmalıdır
uk_ua: Модель повинна мати таблицю дат
