Repository: pypi-data/pypi-mirror-384
Catalog: packages/semantic-link-labs/semantic_link_labs-0.12.4.tar.gz/semantic_link_labs-0.12.4/src/sempy_labs/_bpa_translation/_model/_translations_*.po
Languages: am_et, ca_es, cs_cz, es_es, fi_fi, fr_fr, he_il, hi_in, it_it, pl_pl, ro_ro, te_in, th_th, tr_tr, uk_ua

source: Calculation items must have an expression
am_et: የስሌት እቃዎች መግለጫ ሊኖራቸው ይገባል
ca_es: Els elements de càlcul han de tenir una expressió
cs_cz: Položky výpočtu musí mít výraz
es_es: Los elementos de cálculo deben tener una expresión
fi_fi: Laskentanimikkeillä on oltava lauseke
fr_fr: Les éléments de calcul doivent avoir une expression
he_il: פריטי חישוב חייבים לכלול ביטוי
hi_in: परिकलन आइटम्स में एक व्यंजक होना आवश्यक है
it_it: Gli elementi di calcolo devono avere un'espressione
pl_pl: Elementy obliczeń muszą mieć wyrażenie
ro_ro: Elementele de calcul trebuie să aibă o expresie
te_in: లెక్కింపు ఐటమ్ లకు తప్పనిసరిగా వ్యక్తీకరణ ఉండాలి
th_th: รายการการคํานวณต้องมีนิพจน์
tr_tr: Hesaplama öğelerinin bir ifadesi olmalıdır
uk_ua: Обчислення предметів обов'язково повинен мати вираз

source: Relationship columns should be of the same data type
am_et: የግንኙነት ዓምዶች ተመሳሳይ የመረጃ አይነት መሆን አለባቸው
ca_es: Les columnes de relació han de ser del mateix tipus de dades
cs_cz: Sloupce relací by měly být stejného datového typu
es_es: Las columnas de relación deben ser del mismo tipo de datos
fi_fi: Suhdesarakkeiden on oltava samaa tietotyyppiä
fr_fr: Les colonnes de relation doivent être du même type de données
he_il: עמודות קשרי גומלין צריכות להיות מאותו סוג נתונים
hi_in: संबंध स्तंभ समान डेटा प्रकार के होने चाहिए
it_it: Le colonne delle relazioni devono essere dello stesso tipo di dati
pl_pl: Kolumny relacji powinny być tego samego typu danych
ro_ro: Coloanele de relații trebuie să aibă același tip de date
te_in: రిలేషన్ షిప్ కాలమ్ లు ఒకే డేటా టైప్ లో ఉండాలి.
th_th: คอลัมน์ความสัมพันธ์ควรเป็นชนิดข้อมูลเดียวกัน
tr_tr: İlişki sütunları aynı veri türünde olmalıdır
uk_ua: Стовпці зв'язків мають бути одного типу даних

source: Data columns must have a source column
am_et: የዳታ አምዶች ምንጭ ዓምድ ሊኖራቸው ይገባል
ca_es: Les columnes de dades han de tenir una columna d'origen
cs_cz: Datové sloupce musí mít zdrojový sloupec
es_es: Las columnas de datos deben tener una columna de origen
fi_fi: Tietosarakkeissa on oltava lähdesarake
fr_fr: Les colonnes de données doivent avoir une colonne source
he_il: עמודות נתונים חייבות לכלול עמודת מקור
hi_in: डेटा स्तंभों में स्रोत स्तंभ होना आवश्यक है
it_it: Le colonne di dati devono avere una colonna di origine
pl_pl: Kolumny danych muszą mieć kolumnę źródłową
ro_ro: Coloanele de date trebuie să aibă o coloană sursă
te_in: డేటా కాలమ్ లకు సోర్స్ కాలమ్ ఉండాలి
th_th: คอลัมน์ข้อมูลต้องมีคอลัมน์ต้นทาง
tr_tr: Veri sütunlarının bir kaynak sütunu olmalıdır
uk_ua: Стовпці даних повинні мати стовпець джерела

source: Set IsAvailableInMdx to true on necessary columns
am_et: IsAvailableInMdx ን በአስፈላጊ ዓምዶች ላይ ወደ እውነት አስቀምጥ
ca_es: Defineix IsAvailableInMdx com a true a les columnes necessàries
cs_cz: Nastavte IsAvailableInMdx na true u potřebných sloupců
es_es: Establezca IsAvailableInMdx en true en las columnas necesarias
fi_fi: Määritä IsAvailableInMdx-arvoksi tosi tarvittavissa sarakkeissa
fr_fr: Définissez IsAvailableInMdx sur true sur les colonnes nécessaires
he_il: הגדר את IsAvailableInMdx ל- true בעמודות הדרושות
hi_in: IsAvailableInMdx को आवश्यक स्तंभों पर सही पर सेट करें
it_it: Impostare IsAvailableInMdx su true nelle colonne necessarie
pl_pl: Ustaw wartość IsAvailableInMdx na true w wymaganych kolumnach
ro_ro: Setați IsAvailableInMdx la true pe coloanele necesare
te_in: అవసరమైన కాలమ్ లపై లభ్యం అయ్యే Is లభ్యతInMdxను నిజం చేయడానికి సెట్ చేయండి
th_th: ตั้งค่า IsAvailableInMdx เป็น true ในคอลัมน์ที่จําเป็น
tr_tr: Gerekli sütunlarda IsAvailableInMdx öğesini true olarak ayarlayın
uk_ua: Встановіть для параметра IsAvailableInMdx значення true для потрібних стовпців

source: Avoid the USERELATIONSHIP function and RLS against the same table
am_et: የ USERELATIONSHIP ተግባር እና RLS በተመሳሳይ ጠረጴዛ ላይ ያስወግዱ
ca_es: Evita la funció USERELATIONSHIP i RLS a la mateixa taula
cs_cz: Vyhněte se funkci USERELATIONSHIP a zabezpečení na úrovni řádků ve stejné tabulce
es_es: Evite la función USERELATIONSHIP y RLS en la misma tabla
fi_fi: Vältä USERELATIONSHIP-funktiota ja rivitason suojausta samassa taulukossa
fr_fr: Évitez la fonction USERELATIONSHIP et la RLS sur la même table
he_il: הימנע מהפונקציה USERELATIONSHIP ומ- RLS כנגד אותה טבלה
hi_in: USERELATIONSHIP फ़ंक्शन और RLS को समान तालिका के विरुद्ध टालें
it_it: Evitare la funzione USERELATIONSHIP e la sicurezza a livello di riga nella stessa tabella
pl_pl: Unikaj funkcji USERELATIONSHIP i zabezpieczeń na poziomie wiersza w tej samej tabeli
ro_ro: Evitați funcția USERELATIONSHIP și RLS în același tabel
te_in: ఒకే టేబుల్ కు వ్యతిరేకంగా యూజర్ రిలేషన్ షిప్ ఫంక్షన్ మరియు RLSను పరిహరించండి.
th_th: หลีกเลี่ยงฟังก์ชัน USERELATIONSHIP และ RLS กับตารางเดียวกัน
tr_tr: USERELATIONSHIP işlevini ve RLS'yi aynı tabloya karşı kullanmaktan kaçının
uk_ua: Уникайте функції USERELATIONSHIP та RLS на одній і тій самій таблиці

source: Avoid using the IFERROR function
am_et: የ IFERROR ተግባርን ከመጠቀም ይቆጠቡ
ca_es: Eviteu utilitzar la funció IFERROR
cs_cz: Vyhněte se použití funkce IFERROR
es_es: Evite el uso de la función IFERROR
fi_fi: Vältä JOSERROR-funktion käyttöä
fr_fr: Évitez d’utiliser la fonction IFERROR
he_il: הימנע משימוש בפונקציה IFERROR
hi_in: IFERROR फ़ंक्शन का उपयोग करने से बचें
it_it: Evitare di utilizzare la funzione SE.ERRORE
pl_pl: Unikaj korzystania z funkcji JEŻELI.BŁĄD
ro_ro: Evitați utilizarea funcției IFERROR
te_in: IFERROR ఫంక్షన్ ని ఉపయోగించడం పరిహరించండి.
th_th: หลีกเลี่ยงการใช้ฟังก์ชัน IFERROR
tr_tr: EĞERHATA işlevini kullanmaktan kaçının
uk_ua: Уникайте використання функції IFERROR

source: Use the TREATAS function instead of INTERSECT for virtual relationships
am_et: የመተግበሪን ግንኙነት ኢንተርሴክት ይልቅ የ TREATAS ተግባር ይጠቀሙ
ca_es: Utilitzeu la funció TREATAS en lloc d'INTERSECT per a les relacions virtuals
cs_cz: Pro virtuální vztahy použijte funkci TREATAS místo funkce INTERSECT
es_es: Utilice la función TREATAS en lugar de INTERSECT para las relaciones virtuales
fi_fi: Käytä näennäissuhteissa TREATAS-funktiota INTERSECT-funktion sijaan
fr_fr: Utiliser la fonction TREATAS au lieu de INTERSECT pour les relations virtuelles
he_il: השתמש בפונקציה TREATAS במקום בפונקציה INTERSECT עבור קשרי גומלין וירטואליים
hi_in: वर्चुअल संबंधों के लिए INTERSECT के बजाय TREATAS फ़ंक्शन का उपयोग करें
it_it: Utilizzare la funzione TREATAS anziché INTERSECT per le relazioni virtuali
pl_pl: Używanie funkcji TREATAS zamiast funkcji PRZECINAJ dla relacji wirtualnych
ro_ro: Utilizați funcția TREATAS în loc de INTERSECT pentru relațiile virtuale
te_in: వర్చువల్ రిలేషన్ షిప్ ల కొరకు ఇంటర్ సెక్ట్ కు బదులుగా ట్రీట్ ఆస్ ఫంక్షన్ ని ఉపయోగించండి.
th_th: ใช้ฟังก์ชัน TREATAS แทน INTERSECT สําหรับความสัมพันธ์แบบเสมือน
tr_tr: Sanal ilişkiler için INTERSECT yerine TREATAS işlevini kullanın
uk_ua: Використовуйте функцію TREATAS замість INTERSECT для віртуальних відносин

source: The EVALUATEANDLOG function should not be used in production models
am_et: የEVALUATEANDLOG ተግባር በምርት ሞዴሎች ውስጥ ጥቅም ላይ መዋል የለበትም
ca_es: La funció EVALUATEANDLOG no s'ha d'utilitzar en models de producció
cs_cz: Funkce EVALUATEANDLOG by neměla být používána v produkčních modelech
es_es: La función EVALUATEANDLOG no se debe utilizar en modelos de producción
fi_fi: EVALUATEANDLOG-funktiota ei tule käyttää tuotantomalleissa
fr_fr: La fonction EVALUATEANDLOG ne doit pas être utilisée dans les modèles de production
he_il: אין להשתמש בפונקציה EVALUATEANDLOG במודלי ייצור
hi_in: EVALUATEANDLOG फ़ंक्शन का उपयोग उत्पादन मॉडल में नहीं किया जाना चाहिए
it_it: La funzione EVALUATEANDLOG non deve essere utilizzata nei modelli di produzione
pl_pl: Funkcja EVALUATEANDLOG nie powinna być używana w modelach produkcyjnych
ro_ro: Funcția EVALUATEANDLOG nu trebuie utilizată în modelele de producție
te_in: ప్రొడక్షన్ మోడల్స్ లో మదింపు మరియు లాగ్ ఫంక్షన్ ఉపయోగించరాదు.
th_th: ไม่ควรใช้ฟังก์ชัน EVALUATEANDLOG ในแบบจําลองการผลิต
tr_tr: EVALUATEANDLOG işlevi üretim modellerinde kullanılmamalıdır
uk_ua: Функцію EVALUATEANDLOG не слід використовувати у виробничих моделях

source: Measures should not be direct references of other measures
am_et: እርምጃዎች ሌሎች እርምጃዎች ቀጥተኛ ማጣቀሻ መሆን የለባቸውም
ca_es: Les mesures no han de ser referències directes d'altres mesures
cs_cz: Opatření by neměla být přímými odkazy na jiná opatření
es_es: Las medidas no deben ser referencias directas de otras medidas
fi_fi: Toimenpiteet eivät saisi olla suoria viittauksia muihin toimenpiteisiin
fr_fr: Les mesures ne devraient pas être des références directes à d’autres mesures
he_il: אמצעים לא צריכים להיות הפניות ישירות של אמצעים אחרים
hi_in: उपाय अन्य उपायों के प्रत्यक्ष संदर्भ नहीं होने चाहिए
it_it: Le misure non dovrebbero essere riferimenti diretti ad altre misure
pl_pl: Środki nie powinny być bezpośrednimi odniesieniami do innych środków
ro_ro: Măsurile nu ar trebui să fie trimiteri directe la alte măsuri
te_in: చర్యలు ఇతర చర్యలకు ప్రత్యక్ష సూచనలు కాకూడదు.
th_th: มาตรการไม่ควรเป็นการอ้างอิงโดยตรงของมาตรการอื่น ๆ
tr_tr: Önlemler, diğer önlemlerin doğrudan referansları olmamalıdır
uk_ua: Заходи не повинні бути прямими посиланнями на інші заходи

source: No two measures should have the same definition
am_et: ሁለት መለኪያዎች አንድ አይነት ፍቺ ሊኖራቸው አይገባም
ca_es: No hi ha dues mesures que tinguin la mateixa definició
cs_cz: Žádné dvě míry by neměly mít stejnou definici
es_es: No hay dos medidas que tengan la misma definición
fi_fi: Kahdella toimenpiteellä ei pitäisi olla samaa määritelmää
fr_fr: Il n’y a pas deux mesures qui devraient avoir la même définition
he_il: אין שני אמצעים שצריכים להיות בעלי הגדרה זהה
hi_in: किसी भी दो उपायों की परिभाषा समान नहीं होनी चाहिए
it_it: Non dovrebbero esserci due misure che hanno la stessa definizione
pl_pl: Żadne dwa środki nie powinny mieć tej samej definicji
ro_ro: Nu există două măsuri care să aibă aceeași definiție
te_in: ఏ రెండు చర్యలకు ఒకే నిర్వచనం ఉండకూడదు.
th_th: ไม่มีมาตรการสองข้อควรมีคําจํากัดความเหมือนกัน
tr_tr: İki ölçü aynı tanıma sahip olmamalıdır
uk_ua: Жодні дві міри не повинні мати однакове визначення

source: Avoid addition or subtraction of constant values to results of divisions
am_et: የማያቋርጥ የሥነ ምግባር እሴቶችን በመከፋፈል ውጤት ላይ ከመጨመር ወይም ከማስቀረት ተቆጠቡ
ca_es: Evitar la suma o la resta de valors constants als resultats de les divisions
cs_cz: Vyhněte se sčítání nebo odečítání konstantních hodnot k výsledkům dělení
es_es: Evite la suma o sustracción de valores constantes a los resultados de las divisiones
fi_fi: Vältä vakioarvojen lisäämistä tai vähentämistä jakolaskujen tuloksiin
fr_fr: Éviter l’addition ou la soustraction de valeurs constantes aux résultats des divisions
he_il: הימנע מחיבור או חיסור של ערכים קבועים לתוצאות של חלוקות
hi_in: विभाजन के परिणामों के लिए निरंतर मूल्यों के जोड़ या घटाव से बचें
it_it: Evitare l'addizione o la sottrazione di valori costanti ai risultati delle divisioni
pl_pl: Unikaj dodawania lub odejmowania wartości stałych do wyników dzielenia
ro_ro: Evitați adunarea sau scăderea valorilor constante la rezultatele diviziunilor
te_in: విభజనల ఫలితాలకు స్థిర విలువలను జోడించడం లేదా తీసివేయడం పరిహరించండి
th_th: หลีกเลี่ยงการบวกหรือลบค่าคงที่เพื่อผลลัพธ์ของการหาร
tr_tr: Bölme sonuçlarına sabit değerlerin eklenmesinden veya çıkarılmasından kaçının
uk_ua: Уникайте додавання або віднімання постійних значень до результатів ділення

source: Avoid using '1-(x/y)' syntax
am_et: '1-(x/y)' ሲንታክስ ከመጠቀም ተቆጠቡ
ca_es: Eviteu utilitzar la sintaxi "1-(x/y)"
cs_cz: Vyhněte se použití syntaxe '1-(x/y)'
es_es: Evite usar la sintaxis '1-(x/y)'
fi_fi: Vältä syntaksin '1-(x/y)' käyttöä
fr_fr: Évitez d’utiliser la syntaxe '1-(x/y)'
he_il: הימנע משימוש בתחביר '1-(x/y)'
hi_in: '1-(x/y)' सिंटैक्स का उपयोग करने से बचें
it_it: Evitare di utilizzare la sintassi '1-(x/y)'
pl_pl: Unikaj używania składni "1-(x/y)"
ro_ro: Evitați utilizarea sintaxei "1-(x/y)"
te_in: '1-(x/y)' వాక్యనిర్మాణాన్ని ఉపయోగించవద్దు.
th_th: หลีกเลี่ยงการใช้ไวยากรณ์ '1-(x/y)'
tr_tr: '1-(x/y)' sözdizimini kullanmaktan kaçının
uk_ua: Уникайте використання синтаксису '1-(x/y)'

source: Filter measure values by columns, not tables
am_et: ማጣሪያ እሴት የሚለካው በዓምዶች እንጂ በጠረጴዛዎች አይደለም
ca_es: Filtrar els valors de mesura per columnes, no per taules
cs_cz: Filtrování hodnot měr podle sloupců, ne podle tabulek
es_es: Filtrar valores de medida por columnas, no por tablas
fi_fi: Suodata mitta-arvot sarakkeiden, ei taulukoiden mukaan
fr_fr: Filtrez les valeurs de mesure par colonnes, et non par tables
he_il: סינון ערכי מדידה לפי עמודות, לא לפי טבלאות
hi_in: मानों को स्तंभों के आधार पर फ़िल्टर करें, तालिकाओं के अनुसार नहीं
it_it: Filtrare i valori delle misure in base alle colonne, non alle tabelle
pl_pl: Filtrowanie wartości miar według kolumn, a nie tabel
ro_ro: Filtrarea valorilor măsurătorilor în funcție de coloane, nu de tabele
te_in: ఫిల్టర్ విలువలను కాలమ్ ల ద్వారా లెక్కించండి, పట్టికలు కాదు
th_th: กรองค่าการวัดผลตามคอลัมน์ ไม่ใช่ตาราง
tr_tr: Ölçü değerlerini tablolara göre değil sütunlara göre filtreleme
uk_ua: Фільтрування значень показників за стовпцями, а не за таблицями

source: Filter column values with proper syntax
am_et: ትክክለኛ syntax ጋር የማጣሪያ ዓምድ እሴት
ca_es: Filtrar els valors de les columnes amb la sintaxi adequada
cs_cz: Filtrujte hodnoty sloupců se správnou syntaxí
es_es: Filtrar los valores de columna con la sintaxis adecuada
fi_fi: Sarakearvojen suodattaminen erisnimen syntaksilla
fr_fr: Filtrer les valeurs de colonne avec la syntaxe appropriée
he_il: סינון ערכי עמודות עם תחביר תקין
hi_in: उचित सिंटैक्स के साथ स्तंभ मानों को फ़िल्टर करें
it_it: Filtrare i valori delle colonne con la sintassi corretta
pl_pl: Filtrowanie wartości kolumn z odpowiednią składnią
ro_ro: Filtrarea valorilor coloanelor cu sintaxa corespunzătoare
te_in: సరైన వాక్యనిర్మాణంతో కాలమ్ విలువలను ఫిల్టర్ చేయండి
th_th: กรองค่าคอลัมน์ด้วยไวยากรณ์ที่เหมาะสม
tr_tr: Sütun değerlerini uygun sözdizimiyle filtreleme
uk_ua: Фільтрування значень стовпців із правильним синтаксисом

source: Use the DIVIDE function for division
am_et: ለመከፋፈል የ ክፍፍል አሰራር ይጠቀሙ
ca_es: Utilitzar la funció DIVIDIR per a la divisió
cs_cz: Použití funkce DĚLIT pro dělení
es_es: Utilice la función DIVIDIR para la división
fi_fi: DIVIDE-funktion käyttäminen jakamiseen
fr_fr: Utiliser la fonction DIVIDE pour la division
he_il: שימוש בפונקציה DIVIDE לחלוקה
hi_in: विभाजन के लिए DIVIDE फ़ंक्शन का उपयोग करें
it_it: Utilizzare la funzione DIVIDI per la divisione
pl_pl: Użyj funkcji PODZIEL do dzielenia
ro_ro: Utilizați funcția DIVIDE pentru divizare
te_in: విభజన కొరకు డివైడ్ విధిని ఉపయోగించండి
th_th: ใช้ฟังก์ชัน DIVIDE สําหรับการหาร
tr_tr: Bölme için DIVIDE işlevini kullanın
uk_ua: Використання функції DIVIDE для ділення

source: Column references should be fully qualified
am_et: የዓምድ ማጣቀሻዎች ሙሉ ብቃት ሊኖራቸው ይገባል
ca_es: Les referències de columna han d'estar completament qualificades
cs_cz: Odkazy na sloupce by měly být plně kvalifikované
es_es: Las referencias de columna deben estar completamente calificadas
fi_fi: Sarakeviittausten tulee olla täydellisiä
fr_fr: Les références de colonne doivent être entièrement qualifiées
he_il: הפניות לעמודות צריכות להיות מוסמכות במלואן
hi_in: स्तंभ संदर्भ पूरी तरह योग्य होने चाहिए
it_it: I riferimenti alle colonne devono essere pienamente qualificati
pl_pl: Odwołania do kolumn powinny być w pełni kwalifikowane
ro_ro: Referințele de coloană trebuie să fie pe deplin calificate
te_in: కాలమ్ రిఫరెన్స్ లు పూర్తిగా అర్హత కలిగి ఉండాలి
th_th: การอ้างอิงคอลัมน์ควรมีคุณสมบัติครบถ้วน
tr_tr: Sütun başvuruları tam olarak nitelendirilmelidir
uk_ua: Посилання на колонки мають бути повністю кваліфікованими

source: Measure references should be unqualified
am_et: የመለኪያ ማጣቀሻዎች ብቃት የሌላቸው መሆን አለባቸው
ca_es: Les referències de les mesures no han de ser qualificades
cs_cz: Odkazy na opatření by měly být bez výhrad
es_es: Las referencias de medida no deben estar calificadas
fi_fi: Toimenpideviitteiden tulee olla varauksettomia
fr_fr: Les références de mesure ne doivent pas être qualifiées
he_il: הפניות מדידה צריכות להיות בלתי מסויגות;
hi_in: माप संदर्भ अयोग्य होने चाहिए
it_it: I riferimenti alle misure devono essere non qualificati
pl_pl: Odwołania do miar powinny być niekwalifikowane
ro_ro: Referințele la măsuri ar trebui să fie fără rezerve
te_in: కొలత రిఫరెన్స్ లు అనర్హంగా ఉండాలి
th_th: การอ้างอิงการวัดควรไม่มีคุณสมบัติ
tr_tr: Ölçü başvuruları nitelendirilmemiş olmalıdır
uk_ua: Посилання на міри повинні бути некваліфікованими

source: Inactive relationships that are never activated
am_et: ፈጽሞ የማይንቀሳቀሱ የቀዘቀዙ ግንኙነቶች
ca_es: Relacions inactives que mai s'activen
cs_cz: Neaktivní vztahy, které se nikdy neaktivují
es_es: Relaciones inactivas que nunca se activan
fi_fi: Ei-aktiiviset suhteet, joita ei koskaan aktivoida
fr_fr: Relations inactives qui ne sont jamais activées
he_il: קשרי גומלין לא פעילים שלעולם אינם מופעלים
hi_in: निष्क्रिय संबंध जो कभी सक्रिय नहीं होते हैं
it_it: Relazioni inattive che non vengono mai attivate
pl_pl: Nieaktywne relacje, które nigdy nie są aktywowane
ro_ro: Relații inactive care nu sunt niciodată activate
te_in: ఎప్పటికీ యాక్టివేట్ చేయబడని నిష్క్రియాత్మక సంబంధాలు
th_th: ความสัมพันธ์ที่ไม่ได้ใช้งานซึ่งไม่เคยเปิดใช้งาน
tr_tr: Hiçbir zaman etkinleştirilmeyen etkin olmayan ilişkiler
uk_ua: Неактивні відносини, які ніколи не активуються

source: Remove unnecessary columns
am_et: አላስፈላጊ ዓምዶችን አስወግድ
ca_es: Suprimir columnes innecessàries
cs_cz: Odstranění nepotřebných sloupců
es_es: Eliminación de columnas innecesarias
fi_fi: Poista tarpeettomat sarakkeet
fr_fr: Supprimer les colonnes inutiles
he_il: הסרת עמודות מיותרות
hi_in: अनावश्यक कॉलम निकालें
it_it: Rimuovi le colonne non necessarie
pl_pl: Usuwanie niepotrzebnych kolumn
ro_ro: Eliminați coloanele inutile
te_in: అనవసరమైన కాలమ్ లను తొలగించండి
th_th: ลบคอลัมน์ที่ไม่จําเป็น
tr_tr: Gereksiz sütunları kaldırın
uk_ua: Видаляємо зайві стовпці

source: Remove unnecessary measures
am_et: አላስፈላጊ እርምጃዎችን አስወግድ
ca_es: Eliminar mesures innecessàries
cs_cz: Odstraňte nepotřebná opatření
es_es: Eliminar medidas innecesarias
fi_fi: Poista tarpeettomat toimenpiteet
fr_fr: Supprimer les mesures inutiles
he_il: הסרת אמצעים מיותרים
hi_in: अनावश्यक उपायों को हटा दें
it_it: Rimuovi le misure non necessarie
pl_pl: Usuń niepotrzebne środki
ro_ro: Eliminați măsurile inutile
te_in: అనవసర చర్యలను తొలగించండి
th_th: ลบมาตรการที่ไม่จําเป็น
tr_tr: Gereksiz önlemleri kaldırın
uk_ua: Приберіть зайві заходи

source: Ensure tables have relationships
am_et: ጠረጴዛዎች ግንኙነት እንዳላቸው አረጋግጥ
ca_es: Assegureu-vos que les taules tinguin relacions
cs_cz: Zajistěte, aby tabulky měly vztahy
es_es: Asegúrese de que las tablas tengan relaciones
fi_fi: Varmista, että taulukoissa on suhteita
fr_fr: S’assurer que les tables ont des relations
he_il: ודא שלטבלאות יש קשרי גומלין
hi_in: सुनिश्चित करें कि तालिकाओं में संबंध हैं
it_it: Assicurarsi che le tabelle abbiano relazioni
pl_pl: Upewnij się, że tabele mają relacje
ro_ro: Asigurați-vă că tabelele au relații
te_in: పట్టికలకు సంబంధాలు ఉండేలా చూసుకోండి.
th_th: ตรวจสอบให้แน่ใจว่าตารางมีความสัมพันธ์
tr_tr: Tabloların ilişkileri olduğundan emin olun
uk_ua: Переконайтеся, що таблиці мають зв'язки

source: Calculation groups with no calculation items
am_et: የስሌት ዕቃዎች የሌሉባቸው የስሌት ቡድኖች
ca_es: Grups de càlcul sense elements de càlcul
cs_cz: Skupiny výpočtů bez položek výpočtu
es_es: Grupos de cálculo sin elementos de cálculo
fi_fi: Laskentaryhmät, joissa ei ole laskentanimikkeitä
fr_fr: Groupes de calcul sans éléments de calcul
he_il: קבוצות חישוב ללא פריטי חישוב
hi_in: बिना परिकलन आइटम्स वाले परिकलन समूह
it_it: Gruppi di calcolo senza elementi di calcolo
pl_pl: Grupy obliczeń bez elementów obliczeniowych
ro_ro: Grupuri de calcul fără elemente de calcul
te_in: లెక్కింపు అంశాలు లేని గణన సమూహాలు
th_th: กลุ่มการคํานวณที่ไม่มีรายการการคํานวณ
tr_tr: Hesaplama öğesi olmayan hesaplama grupları
uk_ua: Групи обчислення без елементів розрахунку

source: Visible objects with no description
am_et: ምንም መግለጫ የሌላቸው የሚታዩ ነገሮች
ca_es: Objectes visibles sense descripció
cs_cz: Viditelné objekty bez popisu
es_es: Objetos visibles sin descripción
fi_fi: Näkyvät objektit, joilla ei ole kuvausta
fr_fr: Objets visibles sans description
he_il: אובייקטים גלויים ללא תיאור
hi_in: बिना विवरण के दृश्यमान वस्तुएं
it_it: Oggetti visibili senza descrizione
pl_pl: Widoczne obiekty bez opisu
ro_ro: Obiecte vizibile fără descriere
te_in: వివరణ లేని వస్తువులు
th_th: วัตถุที่มองเห็นได้โดยไม่มีคําอธิบาย
tr_tr: Açıklaması olmayan görünür nesneler
uk_ua: Видимі об'єкти без опису

source: Provide format string for 'Date' columns
am_et: ለ 'ቀን' ዓምዶች ፎርማት አውታረ መረብ ን ያቅርበው
ca_es: Proporciona una cadena de format per a les columnes "Data"
cs_cz: Zadejte formátovací řetězec pro sloupce "Date"
es_es: Proporcionar cadena de formato para las columnas 'Date'
fi_fi: Anna muotoilumerkkijono Päivämäärä-sarakkeille
fr_fr: Fournir une chaîne de format pour les colonnes 'Date'
he_il: ספק מחרוזת תבנית עבור עמודות 'תאריך'
hi_in: 'दिनांक' स्तंभों के लिए स्वरूप स्ट्रिंग प्रदान करें
it_it: Specificare la stringa di formato per le colonne 'Data'
pl_pl: Podaj ciąg formatu dla kolumn "Data"
ro_ro: Furnizați șirul de format pentru coloanele "Dată"
te_in: 'తేదీ' కాలమ్ ల కొరకు ఫార్మాట్ స్ట్రింగ్ అందించండి
th_th: ระบุสตริงรูปแบบสําหรับคอลัมน์ 'วันที่'
tr_tr: 'Date' sütunları için biçim dizesi sağlayın
uk_ua: Укажіть рядок формату для стовпців 'Date'

source: Do not summarize numeric columns
am_et: የቁጥር ዓምዶችን አታጠቃልል
ca_es: No resumir columnes numèriques
cs_cz: Nevytvářet souhrn číselných sloupců
es_es: No resumir columnas numéricas
fi_fi: Älä tee yhteenvetoa numeerisista sarakkeista
fr_fr: Ne pas synthétiser les colonnes numériques
he_il: אל תסכם עמודות מספריות
hi_in: सांख्यिक स्तंभों को सारांशित न करें
it_it: Non riepilogare le colonne numeriche
pl_pl: Nie sumuj kolumn liczbowych
ro_ro: Nu rezumați coloanele numerice
te_in: సంఖ్యా కాలమ్ లను సంక్షిప్తీకరించవద్దు.
th_th: ไม่สรุปคอลัมน์ตัวเลข
tr_tr: Sayısal sütunları özetleme
uk_ua: Не підсумовуйте числові стовпці

source: Provide format string for measures
am_et: ለመለኪያ ፎርማት አውታረ መረብ አቅርበው
ca_es: Proporciona una cadena de format per a les mesures
cs_cz: Poskytnutí formátovacího řetězce pro míry
es_es: Proporcionar cadena de formato para las medidas
fi_fi: Muotoile merkkijono mittareille
fr_fr: Fournir une chaîne de format pour les mesures
he_il: ספק מחרוזת תבנית עבור מידות
hi_in: उपायों के लिए प्रारूप स्ट्रिंग प्रदान करें
it_it: Specificare la stringa di formato per le misure
pl_pl: Podaj ciąg formatu dla miar
ro_ro: Furnizați șirul de format pentru măsuri
te_in: చర్యల కొరకు ఫార్మాట్ స్ట్రింగ్ అందించండి
th_th: จัดเตรียมสตริงรูปแบบสําหรับการวัดผล
tr_tr: Ölçüler için biçim dizesi sağlama
uk_ua: Надайте рядок формату для тактів

source: Add data category for columns
am_et: ለዓምዶች የመረጃ ምድብ ጨምር
ca_es: Afegeix una categoria de dades per a les columnes
cs_cz: Přidání datové kategorie pro sloupce
es_es: Agregar categoría de datos para columnas
fi_fi: Tietoluokan lisääminen sarakkeisiin
fr_fr: Ajouter une catégorie de données pour les colonnes
he_il: הוספת קטגוריית נתונים עבור עמודות
hi_in: स्तंभों के लिए डेटा श्रेणी जोड़ना
it_it: Aggiungere una categoria di dati per le colonne
pl_pl: Dodawanie kategorii danych dla kolumn
ro_ro: Adăugați o categorie de date pentru coloane
te_in: కాలమ్ ల కొరకు డేటా కేటగిరీని జోడించు
th_th: เพิ่มประเภทข้อมูลสําหรับคอลัมน์
tr_tr: Sütunlar için veri kategorisi ekleme
uk_ua: Додавання категорії даних для стовпців
