Repository: pypi-data/pypi-mirror-384
Catalog: packages/brs-xss/brs_xss-2.0.1.tar.gz/brs_xss-2.0.1/brsxss/i18n/locales/*/LC_MESSAGES/brsxss.po
Languages: ru

# welcome
source: Welcome to BRS-XSS v{version}
ru: Добро пожаловать в BRS-XSS v{version}

# description
source: XSS scanner with advanced detection capabilities
ru: XSS сканер с продвинутыми возможностями обнаружения

# author
source: Developed by EasyProTech LLC
ru: Разработано EasyProTech LLC

# exit
source: BRS-XSS execution completed
ru: Выполнение BRS-XSS завершено

# scan_started
source: Started scanning target: {target}
ru: Начато сканирование цели: {target}

# scan_completed
source: Scanning completed in {duration} seconds
ru: Сканирование завершено за {duration} секунд

# target_invalid
source: Invalid scan target: {target}
ru: Некорректная цель сканирования: {target}

# no_parameters
source: No parameters found for testing
ru: Параметры для тестирования не найдены

# parameters_found
source: Found parameters for testing: {count}
ru: Найдено параметров для тестирования: {count}

# testing_parameter
source: Testing parameter: {param}
ru: Тестирование параметра: {param}

# reflections_found
source: Found reflections: {count}
ru: Найдено отражений: {count}

# no_reflections
source: No reflections found
ru: Отражения не найдены

source: Generating payloads...
ru: Генерация полезных нагрузок...

# payloads_generated
source: Created payloads: {count}
ru: Создано полезных нагрузок: {count}

# testing_payload
source: Testing payload: {payload}
ru: Тестирование полезной нагрузки: {payload}

source: VULNERABILITY FOUND
ru: НАЙДЕНА УЯЗВИМОСТЬ

# payload_success
source: Successful payload: {payload}
ru: Успешная полезная нагрузка: {payload}

# efficiency
source: Efficiency: {efficiency}%
ru: Эффективность: {efficiency}%

# confidence
source: Confidence: {confidence}
ru: Уверенность: {confidence}

# waf_detecting
source: Detecting WAF type...
ru: Определение типа WAF...

# waf_detected
source: WAF detected: {waf_name}
ru: Обнаружен WAF: {waf_name}

# waf_not_detected
source: No WAF detected
ru: WAF не обнаружен

# waf_bypassing
source: Attempting WAF bypass...
ru: Попытка обхода WAF...

# error_connection
source: Connection error: {error}
ru: Ошибка соединения: {error}

# error_timeout
source: Request timeout
ru: Таймаут запроса

# error_invalid_url
source: Invalid URL format
ru: Некорректный формат URL

# error_no_response
source: No response received
ru: Ответ не получен

# cli_help
source: Show help message
ru: Показать справочное сообщение

# cli_version
source: Show version information
ru: Показать информацию о версии

# cli_verbose
source: Enable verbose output
ru: Включить подробный вывод

# cli_output
source: Output file path
ru: Путь к выходному файлу

# report_generating
source: Generating report...
ru: Генерация отчета...

# report_saved
source: Report saved to: {path}
ru: Отчет сохранен в: {path}

# report_format
source: Report format: {format}
ru: Формат отчета: {format}
