Repository: pypi-data/pypi-mirror-384
Catalog: packages/collective.techevent/collective_techevent-1.0.0b1-py3-none-any.whl/collective/techevent/locales/*/LC_MESSAGES/collective.techevent.po
Languages: pt_br

source: A Keynote in the Event.
pt_br: Apresentação principal do evento.

source: A Presenter in the Event.
pt_br: Palestrante do evento.

source: A Room in the venue.
pt_br: Uma sala no local do evento.

source: A Slot in the Event.
pt_br: Um espaço na grade do evento.

source: A Talk in the Event.
pt_br: Uma apresentação no evento.

source: A Training in the Event.
pt_br: Um tutorial no evento.

source: A Venue in the Event.
pt_br: Um local de realização do evento.

source: A meeting in the Event.
pt_br: Uma reunião / encontro no evento.

source: A schedule break in the Event.
pt_br: Uma pausa na grade do evento

source: Abstract
pt_br: Sumário

source: Activity
pt_br: Atividade

source: Activity duration
pt_br: Duração da atividade

source: Additional Information
pt_br: Informação adicional

source: All benefits for sponsoring this event.
pt_br: Todoos os benefícios para patrocinadores do evento.

source: All tracks available at this event.
pt_br: Todas as trilhas disponíveis nesse evento.

source: An edition of an event.
pt_br: Uma edição do evento.

source: Audience
pt_br: Público-alvo

source: Benefit
pt_br: Benefício

source: Benefit description
pt_br: Descrição

source: Benefit title
pt_br: Benefício

source: Benefits
pt_br: Benefícios

source: Benefits of this level.
pt_br: Benefícios dessa cota.

source: Break
pt_br: Pausa

source: Categories
pt_br: Categorias

source: Category
pt_br: Categoria

source: Category of this slot
pt_br: Categoria desse espaço

source: Code
pt_br: Código

source: Code of this audience
pt_br: Código desse público-alvo

source: Code of this duration
pt_br: Código dessa duração

source: Code of this level
pt_br: Código desse nível

source: Code of this track
pt_br: Código dessa trilha

source: Color
pt_br: Cor

source: Color used for this item
pt_br: Cor utilizada por esse item

source: Conference Photo
pt_br: Foto dos participantes

source: Create example content to showcase this add-on
pt_br: Cria conteúdo de exemplo para esse complemento.

source: Description
pt_br: Sumário

source: Details
pt_br: Detalhamento

source: Duration
pt_br: Duração

source: Duration of the keynote
pt_br: Duração da Palestra Principal

source: Duration of the talk
pt_br: Duração da apresentação

source: Duration of the training
pt_br: Duração do tutorial

source: Edit
pt_br: Editar

source: Email address
pt_br: Endereço de e-mail

source: End time
pt_br: Término

source: End time must be after start time.
pt_br: O horário de término deve ser posterior ao horário de início.

source: Event Schedule information.
pt_br: Grade de atividades do evento.

source: Event Settings
pt_br: Configurações do evento

source: Event Sponsor.
pt_br: Patrocinador do evento.

source: Event Sponsoring information.
pt_br: Informações para patrocínio no evento/

source: Event days
pt_br: Dias do evento

source: How long, in minutes, this activity will use.
pt_br: Quão longa, em minutos, essa atividade será.

source: ID of this benefit
pt_br: ID desse benefício

source: Instructor
pt_br: Intrutor

source: Investment
pt_br: Investimento

source: Investment for this level
pt_br: Investimento para essa cota

source: Keynote
pt_br: Palestra Principal

source: Keynote Speaker
pt_br: Palestrante Principal

source: Keynote: Slot duration
pt_br: Palestra Principal: Duração do slot

source: Level
pt_br: Nível

source: Levels for a session.
pt_br: Níveis para uma sessão

source: Lightning Talks
pt_br: Palestras relâmpago

source: Lightning Talks slot in the Event.
pt_br: Espaço para palestras relâmpago no evento.

source: Lunch
pt_br: Almoço

source: Meeting
pt_br: Reunião

source: Open space slot in the Event.
pt_br: Espaço para open space durante o evento.

source: Package of sponsorship for the event.
pt_br: Cota de patrocínio no evento

source: Package to configure a new Tech Event for Plone site
pt_br: Complemento para configurar o suporte a eventos de tecnologia para o Plone

source: Plone Foundation Member
pt_br: Membro da Plone Foundation

source: Possible slot duration for a keynote
pt_br: Possíveis durações para um keynote

source: Possible slot duration for a talk
pt_br: Possíveis durações para uma apresentação

source: Possible slot duration for a training
pt_br: Possíveis durações para um treinamento

source: Presenter
pt_br: Palestrante

source: Presenteral e-mail address
pt_br: E-mail do palestrante

source: Presenters
pt_br: Palestrantes

source: Registration
pt_br: Credenciamento

source: Requirements
pt_br: Pré-requisitos

source: Requirements of this training
pt_br: Pré-requisitos desse tutorial

source: Room
pt_br: Sala

source: Room the activity will take place
pt_br: Sala que a atividade ocorrerá

source: Schedule
pt_br: Grade

source: Seats
pt_br: Vagas

source: Session Audience
pt_br: Público alvo das sessões

source: Session Levels
pt_br: Nível das sessões

source: Should we support multiple events
pt_br: Devemos suportar múltiplos eventos?

source: Speaker
pt_br: Palestrante

source: Sponsor
pt_br: Patrocinador

source: Sponsors Database
pt_br: Patrocínios

source: Sponsorship Level
pt_br: Cota de Patrocínio

source: Start time
pt_br: Início

source: Talk
pt_br: Apresentação

source: Talk: Slot duration
pt_br: Apresentação: Duração do slot

source: Target Level
pt_br: Nível

source: Target audience
pt_br: Público alvo

source: Target group for this audience.
pt_br: Público alvo

source: Tech Event
pt_br: Evento Técnico

source: Tech Event for Plone: Demo content
pt_br: Evento Técnico: Conteúdo de exemplo

source: Tech Event for Plone: Install
pt_br: Evento Técnico: Suporte a eventos de tecnologia para Plone

source: Tech Event for Plone: Uninstall
pt_br: Evento Técnico: Remover

source: TechEvent Settings
pt_br: Evento Técnico: Configurações

source: Title
pt_br: Título

source: Title of this audience
pt_br: Título do público-alvo

source: Title of this duration
pt_br: Título da duração

source: Title of this level
pt_br: Título do nível

source: Title of this track
pt_br: Título da trilha

source: Total number of seats
pt_br: Número de vagas

source: Track
pt_br: Trilha

source: Track this sessionctivity will be listed
pt_br: Trilha que essa sessão será listada

source: Tracks
pt_br: Trilhas

source: Training
pt_br: Tutorial

source: Training: Slot duration
pt_br: Tutorial: Duração do slot

source: Uninstall Tech Event for Plone setup.
pt_br: Remove o suporte a Eventos Técnicos.

source: Venue
pt_br: Local

source: View
pt_br: Visão

source: When selected, we will add a content type TechEvent.
pt_br: Quando selectionado, permitirá a criação de conteúdos do tipo Evento Técnico

source: help_description
pt_br: Utilizado em listagens e resultados de busca

source: label_biography
pt_br: Biografia

source: label_description
pt_br: Sumário

source: label_language
pt_br: Idioma

source: label_name
pt_br: Nome

source: label_text
pt_br: Texto

source: label_title
pt_br: Título
