Repository: pypi-data/pypi-mirror-384
Catalog: packages/kadi/kadi-1.8.0-py3-none-any.whl/kadi/plugins/zenodo/translations/*/LC_MESSAGES/messages.po
Languages: de

source: All data will be uploaded as a single ZIP archive corresponding to the exported %(a_open)sRO-Crate data%(a_close)s of this resource, with user information excluded by default. Further customizations can be made using the %(em_open)sCustomize export data%(em_close)s settings below. Note that the uploaded data will not be published directly.
de: Alle Daten werden als ein einziges ZIP-Archiv hochgeladen, das den exportierten %(a_open)sRO-Crate-Daten%(a_close)s dieser Ressource entspricht, wobei Benutzerinformationen standardmäßig ausgeschlossen sind. Weitere Anpassungen können über die untenstehenden Einstellungen %(em_open)sExportdaten anpassen%(em_close)s vorgenommen werden. Beachten Sie, dass die hochgeladenen Daten nicht direkt veröffentlicht werden.

source: Customize export data
de: Exportdaten anpassen

source: Customize import metadata
de: Import-Metadaten anpassen

source: Error uploading resource.
de: Fehler beim Hochladen der Ressource.

source: For advanced use cases, this metadata can be extended or substituted by using the generic metadata editor in the %(em_open)sCustomize import metadata%(em_close)s settings below. The entered metadata will be converted to a corresponding JSON structure and must align with the metadata supported by %(a_open)sInvenioRDM%(a_close)s, which Zenodo is based on. While not usually part of this metadata, a Zenodo community to submit the publication to can also be specified by entering a metadatum with %(em_open)scommunity%(em_close)s as key and the identifier of the community as string value.
de: Für fortgeschrittene Anwendungsfälle können diese Metadaten mithilfe des generischen Metadaten-Editors in den untenstehenden Einstellungen %(em_open)sImport-Metadaten anpassen%(em_close)s erweitert oder ersetzt werden. Die eingegebenen Metadaten werden in eine entsprechende JSON-Struktur konvertiert und müssen mit den Metadaten übereinstimmen, die von %(a_open)sInvenioRDM%(a_close)s unterstützt werden, worauf Zenodo basiert. Eine Zenodo-Community, an welche die Veröffentlichung übermittelt werden soll, ist zwar normalerweise nicht Teil dieser Metadaten, kann aber ebenfalls durch ein Metadatum mit %(em_open)scommunity%(em_close)s als Schlüssel und dem Bezeichner der Community als Stringwert spezifiziert werden.

source: In addition to the data, the following Zenodo metadata will be populated automatically based on the basic metadata of this resource:
de: Zusätzlich zu den Daten werden die folgenden Zenodo-Metadaten automatisch auf der Grundlage der Basis-Metadaten dieser Ressource ausgefüllt:

source: Please verify your email address first.
de: Bitte bestätigen Sie zuerst Ihre E-Mail-Adresse.

source: Resource uploaded successfully.
de: Ressource erfolgreich hochgeladen.

source: The current date.
de: Das aktuelle Datum.

source: The current user's display name and ORCID iD, if available.
de: Der Anzeigename des aktuellen Benutzers und ORCID iD, falls vorhanden.

source: The description of this resource, which will be converted to HTML.
de: Die Beschreibung dieser Ressource, die in HTML konvertiert wird.

source: The following error occured while uploading the resource to Zenodo:
de: Beim Hochladen der Ressource auf Zenodo ist folgender Fehler aufgetreten:

source: The license of this resource, if available and supported by Zenodo, %(em_open)sCC BY 4.0%(em_close)s otherwise.
de: Die Lizenz dieser Ressource, falls vorhanden und von Zenodo unterstützt, ansonsten %(em_open)sCC BY 4.0%(em_close)s.

source: The tags of this resource.
de: Die Tags dieser Ressource.

source: The title of this resource.
de: Der Titel dieser Ressource.

source: To review and publish your upload via Zenodo, head to the following URL:
de: Um Ihren Upload über Zenodo zu überprüfen und zu veröffentlichen, gehen Sie auf die folgende URL:

source: Unknown error.
de: Unbekannter Fehler.

source: Upload canceled.
de: Upload abgebrochen.

source: Zenodo is a general-purpose open-access repository developed and operated by CERN. It allows researchers to deposit and publish data sets, research software, reports, and any other research related digital objects. Connecting your account to Zenodo makes it possible to directly upload resources to Zenodo.
de: Zenodo ist ein allgemeines Open-Access-Repository, das vom CERN entwickelt und betrieben wird. Es ermöglicht Forschern, Datensätze, Forschungssoftware, Berichte und andere forschungsbezogene digitale Objekte zu hinterlegen und zu veröffentlichen. Wenn Sie Ihr Konto mit Zenodo verbinden, können Sie Ressourcen direkt auf Zenodo hochladen.
