Repository: pypi-data/pypi-mirror-384
Catalog: packages/semantic-link-labs/semantic_link_labs-0.12.4-py3-none-any.whl/sempy_labs/_bpa_translation/_model/_translations_*.po
Languages: ar_ae, bg_bg, da_dk, de_de, el_gr, fa_ir, ga_ie, hu_hu, id_id, is_is, ja_jp, mt_mt, nl_nl, pt_br, ru_ru, sk_sk, sl_sl, sv_se, ta_in, zu_za

source: Provide format string for "Month" columns
ar_ae: توفير سلسلة تنسيق لأعمدة "الشهر"
bg_bg: Предоставяне на форматиран низ за графите "Месец"
da_dk: Angiv formatstreng for kolonnerne "Måned"
de_de: Geben Sie eine Formatzeichenfolge für "Monat"-Spalten an
el_gr: Παροχή συμβολοσειράς μορφής για στήλες "Μήνας"
fa_ir: رشته فرمت را برای ستون های "Month" ارائه دهید
ga_ie: Cuir teaghrán formáide ar fáil do cholúin "Mí"
hu_hu: Adja meg a "Hónap" oszlopok formázási karakterláncát
id_id: Menyediakan string format untuk kolom "Bulan"
is_is: Gefa upp sniðstreng fyrir dálka "Mánuður"
ja_jp: "Month" 列の書式指定文字列を指定する
mt_mt: Ipprovdi sekwenza ta 'format għal kolonni "Xahar"
nl_nl: Geef een notatiereeks op voor kolommen met een maand
pt_br: Forneça a cadeia de caracteres de formato para colunas "Mês"
ru_ru: Укажите строку формата для столбцов "Месяц"
sk_sk: Poskytnutie reťazca formátu pre stĺpce Mesiac
sl_sl: Navedite niz oblike zapisa za stolpce »Mesec«
sv_se: Ange formatsträng för kolumnerna "Månad"
ta_in: "மாதம்" நெடுவரிசைகளுக்கான வடிவமைப்பு சரத்தை வழங்கவும்
zu_za: Nikeza umucu wefomethi yamakholomu "Inyanga"

source: Format flag columns as Yes/No value strings
ar_ae: تنسيق أعمدة العلم كسلاسل قيم نعم / لا
bg_bg: Форматиране на колони с флагове като низове със стойност "Да/Не"
da_dk: Formatere flagkolonner som Ja/Nej-værdistrenge
de_de: Formatieren von Flagspalten als Ja/Nein-Wertzeichenfolgen
el_gr: Μορφοποίηση στηλών σημαίας ως συμβολοσειρές τιμών Ναι/Όχι
fa_ir: قالب بندی ستون های پرچم به عنوان رشته های مقدار بله/خیر
ga_ie: Formáidigh colúin bratach mar Tá / Níl teaghráin luach
hu_hu: Jelölőoszlopok formázása Igen/Nem érték-karakterláncként
id_id: Memformat kolom bendera sebagai string nilai Ya/Tidak
is_is: Sníða flaggdálka sem Já/Nei gildisstrengi
ja_jp: フラグ列を Yes/No 値文字列として書式設定します
mt_mt: Kolonni tal-bandiera tal-format bħala kordi tal-valur Iva/Le
nl_nl: Vlagkolommen opmaken als Ja/Nee-waardereeksen
pt_br: Formatar colunas de sinalizador como cadeias de caracteres de valor Sim/Não
ru_ru: Форматирование столбцов флагов в виде строк значений «Да/Нет»
sk_sk: Formátovanie stĺpcov príznakov ako reťazcov hodnôt Áno/Nie
sl_sl: Oblikovanje stolpcev z zastavico kot nizov vrednosti Da/Ne
sv_se: Formatera flaggkolumner som Ja/Nej-värdesträngar
ta_in: கொடி நெடுவரிசைகளை ஆம்/இல்லை மதிப்பு சரங்களாக வடிவமைக்கவும்
zu_za: Hlela amakholomu efulegi njengezintambo zenani likaYebo / Cha

source: Objects should not start or end with a space
ar_ae: يجب ألا تبدأ الكائنات أو تنتهي بمسافة
bg_bg: Обектите не трябва да започват или завършват с интервал
da_dk: Objekter må ikke starte eller slutte med et mellemrum
de_de: Objekte sollten nicht mit einem Leerzeichen beginnen oder enden
el_gr: Τα αντικείμενα δεν πρέπει να ξεκινούν ή να τελειώνουν με κενό διάστημα
fa_ir: آبجکت ها نباید با فاصله شروع یا پایان شوند
ga_ie: Níor chóir go dtosódh nó go gcríochnódh réada le spás
hu_hu: Az objektumok nem kezdődhetnek vagy végződhetnek szóközzel
id_id: Objek tidak boleh dimulai atau diakhiri dengan spasi
is_is: Hlutir ættu ekki að byrja eða enda á bili
ja_jp: オブジェクトの先頭または末尾をスペースにすることはできません
mt_mt: L-oġġetti m'għandhomx jibdew jew jispiċċaw bi spazju
nl_nl: Objecten mogen niet beginnen of eindigen met een spatie
pt_br: Os objetos não devem começar ou terminar com um espaço
ru_ru: Объекты не должны начинаться или заканчиваться пробелом
sk_sk: Objekty by nemali začínať ani končiť medzerou
sl_sl: Predmeti se ne smejo začeti ali končati s presledkom
sv_se: Objekt ska inte börja eller sluta med ett blanksteg
ta_in: பொருள்கள் இடைவெளியுடன் தொடங்கவோ அல்லது முடிவடையவோ கூடாது
zu_za: Izinto akufanele ziqale noma ziphele ngesikhala

source: First letter of objects must be capitalized
ar_ae: يجب كتابة الحرف الأول من الكائنات بأحرف كبيرة
bg_bg: Първата буква на обектите трябва да бъде изписана с главна буква
da_dk: Første bogstav i objekter skal skrives med stort
de_de: Der erste Buchstabe von Objekten muss groß geschrieben werden
el_gr: Το πρώτο γράμμα των αντικειμένων πρέπει να είναι κεφαλαίο
fa_ir: حرف اول اشیاء باید با حروف بزرگ نوشته شود
ga_ie: Ní mór an chéad litir rudaí a chaipitliú
hu_hu: Az objektumok első betűjét nagybetűvel kell írni
id_id: Huruf pertama objek harus dikapitalisasi
is_is: Fyrsti stafur hluta verður að vera með hástöfum
ja_jp: オブジェクトの最初の文字は大文字にする必要があります
mt_mt: L-ewwel ittra ta' oġġetti għandha tiġi kapitalizzata
nl_nl: De eerste letter van objecten moet met een hoofdletter worden geschreven
pt_br: A primeira letra dos objetos deve ser maiúscula
ru_ru: Первая буква дополнения должна быть заглавной
sk_sk: Prvé písmeno objektov musí byť veľké
sl_sl: Prva črka predmetov mora biti napisana z veliko začetnico
sv_se: Den första bokstaven i ett objekt måste skrivas med stor bokstav
ta_in: பொருள்களின் முதல் எழுத்து பெரியதாக இருக்க வேண்டும்
zu_za: Incwadi yokuqala yezinto kumele i-capitalized

source: Object names must not contain special characters
ar_ae: يجب ألا تحتوي أسماء الكائنات على أحرف خاصة
bg_bg: Имената на обектите не трябва да съдържат специални знаци
da_dk: Objektnavne må ikke indeholde specialtegn
de_de: Objektnamen dürfen keine Sonderzeichen enthalten
el_gr: Τα ονόματα αντικειμένων δεν πρέπει να περιέχουν ειδικούς χαρακτήρες
fa_ir: نام اشیاء نباید حاوی کاراکترهای خاصی باشد
ga_ie: Ní ceadmhach carachtair speisialta a bheith in ainmneacha réada
hu_hu: Az objektumnevek nem tartalmazhatnak speciális karaktereket
id_id: Nama objek tidak boleh mengandung karakter khusus
is_is: Hlutaheiti mega ekki innihalda sérstafi
ja_jp: オブジェクト名に特殊文字を含めることはできません
mt_mt: L-ismijiet tal-oġġetti ma għandux ikun fihom karattri speċjali
nl_nl: Objectnamen mogen geen speciale tekens bevatten
pt_br: Os nomes dos objetos não devem conter caracteres especiais
ru_ru: Имена объектов не должны содержать специальных символов
sk_sk: Názvy objektov nesmú obsahovať špeciálne znaky
sl_sl: Imena predmetov ne smejo vsebovati posebnih znakov
sv_se: Objektnamn får inte innehålla specialtecken
ta_in: பொருள் பெயர்களில் சிறப்பு கேரக்டர்கள் இருக்கக்கூடாது
zu_za: Amagama ento akumele ibe nezinhlamvu ezikhethekile
