Repository: pypi-data/pypi-mirror-384
Catalog: packages/semantic-link-labs/semantic_link_labs-0.12.4-py3-none-any.whl/sempy_labs/_bpa_translation/_model/_translations_*.po
Languages: ar_ae, bg_bg, da_dk, de_de, el_gr, fa_ir, ga_ie, hu_hu, id_id, is_is, ja_jp, mt_mt, nl_nl, pt_br, ru_ru, sk_sk, sl_sl, sv_se, ta_in, zu_za

source: Do not use floating point data types
ar_ae: لا تستخدم أنواع بيانات الفاصلة العائمة
bg_bg: Не използвайте типове данни с плаваща запетая
da_dk: Brug ikke flydende kommadatatyper
de_de: Verwenden Sie keine Gleitkomma-Datentypen
el_gr: Μην χρησιμοποιείτε τύπους δεδομένων κινητής υποδιαστολής
fa_ir: از انواع داده ممیز شناور استفاده نکنید
ga_ie: Ná húsáid cineálacha sonraí snámhphointe
hu_hu: Ne használjon lebegőpontos adattípusokat
id_id: Jangan gunakan tipe data floating point
is_is: Ekki nota fljótandi gagnagerðir
ja_jp: 浮動小数点データ型は使用しないでください
mt_mt: Tużax tipi ta' dejta b'punt li jżomm f'wiċċ l-ilma
nl_nl: Gebruik geen gegevenstypen met drijvendekomma
pt_br: Não use tipos de dados de ponto flutuante
ru_ru: Не используйте типы данных с плавающей запятой
sk_sk: Nepoužívajte typy údajov s pohyblivou rádovou čiarkou
sl_sl: Ne uporabljajte podatkovnih tipov s plavajočo vejico
sv_se: Använd inte flyttalsdatatyper
ta_in: ஃப்ளோட்டிங் பாயிண்ட் டேட்டா வகைகளைப் பயன்படுத்த வேண்டாம்
zu_za: Ungasebenzisi izinhlobo zedatha yephuzu elintantayo

source: Avoid using calculated columns
ar_ae: تجنب استخدام الأعمدة المحسوبة
bg_bg: Избягвайте използването на изчисляеми колони
da_dk: Undgå at bruge beregnede kolonner
de_de: Vermeiden Sie die Verwendung berechneter Spalten
el_gr: Αποφύγετε τη χρήση υπολογιζόμενων στηλών
fa_ir: از استفاده از ستون های محاسبه شده خودداری کنید
ga_ie: Seachain colúin ríofa a úsáid
hu_hu: Kerülje a számított oszlopok használatát
id_id: Hindari menggunakan kolom terhitung
is_is: Forðastu að nota reiknaða dálka
ja_jp: 計算列の使用を避ける
mt_mt: Evita li tuża kolonni kkalkulati
nl_nl: Vermijd het gebruik van berekende kolommen
pt_br: Evite usar colunas calculadas
ru_ru: Избегайте использования вычисляемых столбцов
sk_sk: Vyhnite sa používaniu vypočítaných stĺpcov
sl_sl: Izogibajte se uporabi izračunanih stolpcev
sv_se: Undvik att använda beräknade kolumner
ta_in: கணக்கிடப்பட்ட நெடுவரிசைகளைப் பயன்படுத்துவதைத் தவிர்க்கவும்
zu_za: Gwema ukusebenzisa amakholomu abalwe

source: Check if bi-directional and many-to-many relationships are valid
ar_ae: تحقق مما إذا كانت العلاقات ثنائية الاتجاه والعلاقات بين متعدد إلى متعدد صالحة
bg_bg: Проверете дали двупосочните релации и релациите "много към много" са валидни
da_dk: Kontrollér, om tovejs- og mange-til-mange-relationer er gyldige
de_de: Überprüfen Sie, ob bidirektionale und m:n-Beziehungen gültig sind
el_gr: Ελέγξτε εάν οι αμφίδρομες σχέσεις και οι σχέσεις πολλά-προς-πολλά είναι έγκυρες
fa_ir: بررسی اینکه آیا روابط دو طرفه و چند به چند معتبر هستند یا خیر
ga_ie: Seiceáil an bhfuil caidrimh dhéthreoch agus go leor le go leor bailí
hu_hu: Ellenőrizze, hogy érvényesek-e a kétirányú és a több-a-többhöz kapcsolatok
id_id: Periksa apakah hubungan dua arah dan banyak-ke-banyak valid
is_is: Athugaðu hvort tvíátta og margátta tengsl séu gild
ja_jp: 双方向および多対多の関係が有効かどうかを確認する
mt_mt: Iċċekkja jekk ir-relazzjonijiet bi-direzzjonali u ħafna għal ħafna humiex validi
nl_nl: Controleer of bidirectionele en veel-op-veel-relaties geldig zijn
pt_br: Verifique se as relações bidirecionais e muitos-para-muitos são válidas
ru_ru: Проверка допустимости отношений «многонаправленный» и «многие ко многим»
sk_sk: Skontrolujte, či sú platné obojsmerné vzťahy a vzťahy many-to-many
sl_sl: Preverjanje, ali so dvosmerne relacije in relacije »več proti mnogim« veljavne
sv_se: Kontrollera om dubbelriktade relationer och många-till-många-relationer är giltiga
ta_in: இரு திசை மற்றும் பல முதல் பல உறவுகள் செல்லுபடியாகுமா என்று சரிபார்க்கவும்
zu_za: Hlola ukuthi ubudlelwane be-bi-directional kanye nobuningi obuningi buqinisekisiwe

source: Check if dynamic row level security (RLS) is necessary
ar_ae: تحقق مما إذا كان الأمان الديناميكي على مستوى الصف (RLS) ضروريا
bg_bg: Проверете дали е необходима динамична защита на ниво ред (RLS)
da_dk: Kontrollér, om sikkerhed på dynamisk rækkeniveau (RLS) er nødvendig
de_de: Prüfen, ob Dynamic Row Level Security (RLS) erforderlich ist
el_gr: Ελέγξτε εάν είναι απαραίτητη η δυναμική ασφάλεια σε επίπεδο γραμμών (RLS)
fa_ir: بررسی کنید که آیا امنیت سطح ردیف پویا (RLS) ضروری است یا خیر
ga_ie: Seiceáil an bhfuil slándáil dinimiciúil leibhéal as a chéile (RLS) riachtanach
hu_hu: Ellenőrizze, hogy szükség van-e dinamikus sorszintű biztonságra (RLS)
id_id: Periksa apakah keamanan tingkat baris dinamis (RLS) diperlukan
is_is: Athugaðu hvort breytilegt raðstigsöryggi (RLS) sé nauðsynlegt
ja_jp: 動的行レベル・セキュリティ (RLS) が必要かどうかを確認する
mt_mt: Iċċekkja jekk hijiex meħtieġa sigurtà dinamika tal-livell ta' ringiela (RLS)
nl_nl: Controleer of dynamische beveiliging op rijniveau (RLS) nodig is
pt_br: Verificar se a RLS (segurança dinâmica em nível de linha) é necessária
ru_ru: Проверьте, необходима ли динамическая безопасность на уровне строк (RLS)
sk_sk: Skontrolujte, či je potrebné dynamické zabezpečenie na úrovni riadkov (RLS)
sl_sl: Preverjanje, ali je potrebna dinamična varnost na ravni vrstice (RLS)
sv_se: Kontrollera om dynamisk säkerhet på radnivå (RLS) är nödvändig
ta_in: டைனமிக் வரிசை நிலை பாதுகாப்பு (RLS) தேவையா என சரிபார்க்கவும்
zu_za: Hlola ukuthi ukuphepha kwezinga le-row ashukumisayo (RLS) kuyadingeka yini

source: Avoid using many-to-many relationships on tables used for dynamic row level security
ar_ae: تجنب استخدام علاقات متعدد إلى متعدد على الجداول المستخدمة للأمان الديناميكي على مستوى الصف
bg_bg: Избягвайте използването на релации "много към много" в таблици, използвани за динамична защита на ниво ред
da_dk: Undgå at bruge mange til mange-relationer i tabeller, der bruges til dynamisk sikkerhed på rækkeniveau
de_de: Vermeiden Sie die Verwendung von m:n-Beziehungen für Tabellen, die für die Sicherheit auf dynamischer Zeilenebene verwendet werden
el_gr: Αποφύγετε τη χρήση σχέσεων πολλά-προς-πολλά σε πίνακες που χρησιμοποιούνται για δυναμική ασφάλεια σε επίπεδο γραμμών
fa_ir: از استفاده از روابط چند به چند در جداول مورد استفاده برای امنیت سطح ردیف پویا خودداری کنید.
ga_ie: Seachain úsáid a bhaint as go leor caidrimh ar tháblaí a úsáidtear le haghaidh slándála dinimiciúil leibhéal as a chéile
hu_hu: Kerülje a több-a-többhöz kapcsolatok használatát a dinamikus sorszintű biztonsághoz használt táblákon
id_id: Hindari menggunakan hubungan banyak-ke-banyak pada tabel yang digunakan untuk keamanan tingkat baris dinamis
is_is: Forðastu að nota marga-til-marga vensl í töflum sem notaðar eru fyrir kvikt öryggi á línustigi
ja_jp: 動的行レベルのセキュリティに使用されるテーブルで多対多の関係を使用しないようにします
mt_mt: Evita li tuża relazzjonijiet ħafna sa ħafna fuq tabelli użati għas-sigurtà tal-livell dinamiku tal-filliera
nl_nl: Vermijd het gebruik van veel-op-veel-relaties in tabellen die worden gebruikt voor dynamische beveiliging op rijniveau
pt_br: Evite usar relações muitos-para-muitos em tabelas usadas para segurança dinâmica em nível de linha
ru_ru: Избегайте использования связей "многие ко многим" в таблицах, используемых для динамической безопасности на уровне строк
sk_sk: Vyhnite sa používaniu vzťahov many-to-many v tabuľkách používaných na zabezpečenie dynamického zabezpečenia na úrovni riadkov
sl_sl: Izogibajte se uporabi relacij »več proti mnogim« v tabelah, ki se uporabljajo za dinamično varnost na ravni vrstice
sv_se: Undvik att använda många-till-många-relationer i tabeller som används för dynamisk säkerhet på radnivå
ta_in: டைனமிக் வரிசை நிலை பாதுகாப்பிற்காக பயன்படுத்தப்படும் அட்டவணைகளில் பல முதல் பல உறவுகளைப் பயன்படுத்துவதைத் தவிர்க்கவும்
zu_za: Gwema ukusebenzisa ubudlelwane obuningi kumatafula asetshenziselwa ukuphepha kwezinga le-row ashukumisayo

source: Many-to-many relationships should be single-direction
ar_ae: يجب أن تكون العلاقات متعددة إلى متعددة أحادية الاتجاه
bg_bg: Връзките "много към много" трябва да бъдат еднопосочни
da_dk: Mange til mange-relationer skal være enkeltrettede
de_de: m:n-Beziehungen sollten in eine Richtung gehen
el_gr: Οι σχέσεις πολλά-προς-πολλά πρέπει να είναι μονής κατεύθυνσης
fa_ir: روابط چند به چند باید یک جهته باشد
ga_ie: Ba chóir go mbeadh go leor caidrimh aon-treo
hu_hu: A több-a-többhöz kapcsolatoknak egyirányúnak kell lenniük
id_id: Hubungan banyak-ke-banyak harus satu arah
is_is: Margir-til-margir sambönd ættu að vera í eina átt
ja_jp: 多対多のリレーションシップは一方向である必要があります
mt_mt: Ħafna għal ħafna relazzjonijiet għandhom ikunu direzzjoni waħda
nl_nl: Veel-op-veel-relaties moeten in één richting zijn
pt_br: As relações muitos-para-muitos devem ser unidirecionais
ru_ru: Отношения "многие ко многим" должны быть односторонними
sk_sk: Vzťahy Many-to-many by mali byť jednosmerné
sl_sl: Odnosi med mnogimi bi morali biti enosmerni
sv_se: Många-till-många-relationer bör vara enkelriktade
ta_in: பல முதல் பல உறவுகள் ஒற்றை திசையில் இருக்க வேண்டும்
zu_za: Ubudlelwane obuningi kufanele kube isiqondiso esisodwa

source: Set IsAvailableInMdx to false on non-attribute columns
ar_ae: تعيين IsAvailableInMdx إلى false على أعمدة غير سمة
bg_bg: Задаване на IsAvailableInMdx на false за колони без атрибути
da_dk: Indstil IsAvailableInMdx til false på kolonner, der ikke er attributter
de_de: Festlegen von IsAvailableInMdx auf false für Spalten ohne Attribut
el_gr: Ορισμός της τιμής IsAvailableInMdx σε false σε στήλες που δεν είναι χαρακτηριστικά
fa_ir: IsAvailableInMdx را روی false در ستون های غیر ویژگی تنظیم کنید
ga_ie: Socraigh IsAvailableInMdx go bréagach ar cholúin neamh-tréith
hu_hu: Állítsa az IsAvailableInMdx értékét false értékre a nem attribútum oszlopokon
id_id: Atur IsAvailableInMdx ke false pada kolom non-atribut
is_is: Stilltu IsAvailableInMdx á false í dálkum sem ekki eru eigindir
ja_jp: 非属性列で IsAvailableInMdx を false に設定します
mt_mt: Issettja IsAvailableInMdx għal falz fuq kolonni mhux tal-attributi
nl_nl: Stel IsAvailableInMdx in op false op kolommen zonder attribuut
pt_br: Definir IsAvailableInMdx como false em colunas que não são de atributo
ru_ru: Задайте для IsAvailableInMdx значение false для столбцов, не являющихся атрибутами
sk_sk: Nastavte hodnotu IsAvailableInMdx na hodnotu false v stĺpcoch bez atribútov
sl_sl: Nastavitev IsAvailableInMdx na false v stolpcih, ki niso atributi
sv_se: Ange IsAvailableInMdx till false för kolumner som inte är attribut
ta_in: IsAvailableInMdx ஐ பண்புக்கூறு அல்லாத நெடுவரிசைகளில் தவறாக அமைக்கவும்
zu_za: Setha i-IsAvailableInMdx ku-false kumakholomu angewona ama-attribute

source: Set 'Data Coverage Definition' property on the DirectQuery partition of a hybrid table
ar_ae: تعيين خاصية "تعريف تغطية البيانات" على قسم DirectQuery لجدول مختلط
bg_bg: Задайте свойство "Дефиниция на покритието на данните" на дяла DirectQuery на хибридна таблица
da_dk: Angiv egenskaben "Data Coverage Definition" på DirectQuery-partitionen i en hybridtabel
de_de: Festlegen der Eigenschaft "Data Coverage Definition" für die DirectQuery-Partition einer Hybridtabelle
el_gr: Ορισμός ιδιότητας "Ορισμός κάλυψης δεδομένων" στο διαμέρισμα DirectQuery ενός υβριδικού πίνακα
fa_ir: ویژگی "Data Coverage Definition" را در پارتیشن DirectQuery یک جدول ترکیبی تنظیم کنید
ga_ie: Socraigh maoin 'Sainmhíniú ar Chumhdach Sonraí' ar dheighilt DirectQuery de thábla hibrideach
hu_hu: Állítsa be az "Adatlefedettség definíciója" tulajdonságot egy hibrid tábla DirectQuery-partícióján
id_id: Atur properti 'Definisi Cakupan Data' pada partisi DirectQuery tabel hibrid
is_is: Stilltu eiginleikann 'Skilgreining gagnaþekju' á DirectQuery skipting blandaðrar töflu
ja_jp: ハイブリッド テーブルの DirectQuery パーティションに 'Data Coverage Definition' プロパティを設定します
mt_mt: Issettja l-proprjetà tad-"Definizzjoni tal-Kopertura tad-Dejta" fuq il-partizzjoni tad-DirectQuery ta' tabella ibrida
nl_nl: Stel de eigenschap 'Data Coverage Definition' in op de DirectQuery-partitie van een hybride tabel
pt_br: Definir a propriedade 'Definição de Cobertura de Dados' na partição DirectQuery de uma tabela híbrida
ru_ru: Установка свойства "Data Coverage Definition" в разделе DirectQuery гибридной таблицы
sk_sk: Nastavenie vlastnosti Definícia pokrytia údajov v oblasti DirectQuery hybridnej tabuľky
sl_sl: Nastavitev lastnosti »Definicija pokritosti podatkov« na particiji DirectQuery hibridne tabele
sv_se: Ange egenskapen "Datatäckningsdefinition" på DirectQuery-partitionen i en hybridtabell
ta_in: ஒரு கலப்பின அட்டவணையின் DirectQuery பகிர்வில் 'தரவு கவரேஜ் வரையறை' குணத்தை அமைக்கவும்
zu_za: Setha impahla 'ye-Data Coverage Definition' ku-DirectQuery ukwahlukanisa itafula le-hybrid

source: Dual mode is only relevant for dimension tables if DirectQuery is used for the corresponding fact table
ar_ae: يكون الوضع المزدوج مناسبا فقط لجداول الأبعاد إذا تم استخدام DirectQuery لجدول الحقائق المقابل
bg_bg: Двойният режим е подходящ за таблици с измерения само ако DirectQuery се използва за съответната таблица с факти
da_dk: Dobbelttilstand er kun relevant for dimensionstabeller, hvis DirectQuery bruges til den tilsvarende faktatabel
de_de: Der duale Modus ist für Dimensionstabellen nur relevant, wenn DirectQuery für die entsprechende Faktentabelle verwendet wird
el_gr: Η διπλή λειτουργία είναι σχετική μόνο για πίνακες διαστάσεων εάν το DirectQuery χρησιμοποιείται για τον αντίστοιχο πίνακα δεδομένων
fa_ir: حالت دوگانه فقط در صورتی برای جداول ابعاد مرتبط است که از DirectQuery برای جدول واقعیت مربوطه استفاده شود
ga_ie: Níl démhodh ábhartha ach amháin le haghaidh táblaí toise má úsáidtear DirectQuery don tábla fíricí comhfhreagrach
hu_hu: A kettős mód csak akkor releváns dimenziótáblák esetén, ha a megfelelő ténytáblához DirectQueryt használ
id_id: Mode ganda hanya relevan untuk tabel dimensi jika DirectQuery digunakan untuk tabel fakta yang sesuai
is_is: Tvöföld stilling á aðeins við fyrir víddartöflur ef DirectQuery er notað fyrir samsvarandi staðreyndatöflu
ja_jp: デュアル モードは、対応するファクト テーブルに DirectQuery が使用されている場合にのみ、ディメンション テーブルに関連します
mt_mt: Il-modalità doppja hija rilevanti biss għat-tabelli tad-dimensjoni jekk id-DirectQuery jintuża għat-tabella tal-fatti korrispondenti
nl_nl: Dubbele modus is alleen relevant voor dimensietabellen als DirectQuery wordt gebruikt voor de bijbehorende feitentabel
pt_br: O modo duplo só será relevante para tabelas de dimensões se o DirectQuery for usado para a tabela de fatos correspondente
ru_ru: Двойной режим применим только для таблиц измерений, если для соответствующей таблицы фактов используется DirectQuery
sk_sk: Duálny režim je relevantný len pre tabuľky dimenzií, ak sa pre príslušnú tabuľku faktov používa režim DirectQuery
sl_sl: Dvojni način je pomemben le za tabele razsežnosti, če je za ustrezno tabelo dejstev uporabljen DirectQuery
sv_se: Dubbelt läge är endast relevant för dimensionstabeller om DirectQuery används för motsvarande faktatabell
ta_in: தொடர்புடைய உண்மை அட்டவணைக்கு DirectQuery பயன்படுத்தப்பட்டால் பரிமாண அட்டவணைகளுக்கு மட்டுமே இரட்டை பயன்முறை பொருந்தும்
zu_za: Imodi emibili ihambelana kuphela namatafula obukhulu uma i-DirectQuery isetshenziselwa itafula leqiniso elihambisanayo

source: Set dimensions tables to dual mode instead of import when using DirectQuery on fact tables
ar_ae: تعيين جداول الأبعاد إلى الوضع المزدوج بدلا من الاستيراد عند استخدام DirectQuery في جداول الحقائق
bg_bg: Задаване на таблици с измерения в двоен режим вместо импортиране, когато използвате DirectQuery върху таблици с факти
da_dk: Indstil dimensionstabeller til dobbelttilstand i stedet for import, når du bruger DirectQuery på faktatabeller
de_de: Festlegen von Dimensionstabellen auf den Dualmodus anstelle des Imports bei Verwendung von DirectQuery für Faktentabellen
el_gr: Ορισμός πινάκων διαστάσεων σε διπλή λειτουργία αντί για εισαγωγή κατά τη χρήση του DirectQuery σε πίνακες δεδομένων
fa_ir: هنگام استفاده از DirectQuery در جداول فکت، جداول ابعاد را به جای وارد کردن روی حالت دوگانه تنظیم کنید
ga_ie: Socraigh táblaí toisí go mód dé in ionad allmhairiú agus DirectQuery á úsáid ar tháblaí fíricí
hu_hu: Dimenziótáblák beállítása kettős módba importálás helyett, ha a DirectQueryt ténytáblákon használja
id_id: Mengatur tabel dimensi ke mode ganda, bukan impor saat menggunakan DirectQuery pada tabel fakta
is_is: Stilltu víddartöflur á tvöfalda stillingu í stað innflutnings þegar DirectQuery er notað á staðreyndatöflum
ja_jp: ファクト テーブルで DirectQuery を使用する場合、ディメンション テーブルをインポートではなくデュアル モードに設定するSet dimensions tables to dual mode using DirectQuery on fact tables
mt_mt: Issettja t-tabelli tad-dimensjonijiet għall-modalità doppja minflok timporta meta tuża DirectQuery fuq tabelli tal-fatti
nl_nl: Stel dimensietabellen in op dubbele modus in plaats van importeren wanneer u DirectQuery gebruikt voor feitentabellen
pt_br: Definir tabelas de dimensões como modo duplo em vez de importar ao usar o DirectQuery em tabelas de fatos
ru_ru: Установка двойного режима таблиц измерений вместо импорта при использовании DirectQuery в таблицах фактов
sk_sk: Pri použití režimu DirectQuery v tabuľkách faktov nastavte tabuľky dimenzií na duálny režim namiesto importu
sl_sl: Nastavite tabele razsežnosti v dvojni način namesto uvoza, ko uporabljate DirectQuery za tabele z dejstvi
sv_se: Ställ in dimensionstabeller på dubbelt läge i stället för import när du använder DirectQuery på faktatabeller
ta_in: உண்மை அட்டவணைகளில் DirectQuery ஐப் பயன்படுத்தும் போது இறக்குமதிக்கு பதிலாக பரிமாண அட்டவணைகளை இரட்டை பயன்முறைக்கு அமைக்கவும்
zu_za: Setha ubukhulu amatafula kwimodi emibili esikhundleni sokungenisa uma usebenzisa i-DirectQuery kumathebula amaqiniso

source: Minimize Power Query transformations
ar_ae: تقليل تحويلات استعلام الطاقة
bg_bg: Минимизиране на трансформациите на Power Query
da_dk: Minimer Power Query-transformationer
de_de: Minimieren von Power Query-Transformationen
el_gr: Ελαχιστοποίηση μετασχηματισμών Power Query
fa_ir: به حداقل رساندن تبدیلات Power Query
ga_ie: Íoslaghdaigh claochluithe Iarratas Cumhachta
hu_hu: Power Query-átalakítások minimalizálása
id_id: Minimalkan transformasi Power Query
is_is: Lágmarka Power Query umbreytingar
ja_jp: Power Query 変換を最小限に抑える
mt_mt: Imminimizza t-trasformazzjonijiet tal-Power Query
nl_nl: Power Query-transformaties minimaliseren
pt_br: Minimizar transformações do Power Query
ru_ru: Сведите к минимуму преобразования Power Query
sk_sk: Minimalizácia transformácií doplnku Power Query
sl_sl: Zmanjševanje pretvorb dodatka Power Query
sv_se: Minimera Power Query omvandlingar
ta_in: சக்தி வினவல் மாற்றங்களை குறைக்கவும்
zu_za: Nciphisa izinguquko ze-Power Query

source: Consider a star-schema instead of a snowflake architecture
ar_ae: ضع في اعتبارك مخطط النجوم بدلا من بنية ندفة الثلج
bg_bg: Помислете за звездна схема вместо архитектура на снежинка
da_dk: Overvej et stjerneskema i stedet for en snefnugarkitektur
de_de: Betrachten Sie ein Sternschema anstelle einer Schneeflockenarchitektur
el_gr: Σκεφτείτε ένα αστρικό σχήμα αντί για μια αρχιτεκτονική νιφάδας χιονιού
fa_ir: به جای معماری دانه برف، یک طرحواره ستاره ای را در نظر بگیرید
ga_ie: Smaoinigh ar scéimre réalta in ionad ailtireacht snowflake
hu_hu: Fontolja meg a csillagsémát a hópehely architektúra helyett
id_id: Pertimbangkan skema bintang alih-alih arsitektur kepingan salju
is_is: Lítum á stjörnuskema í stað snjókornaarkitektúrs
ja_jp: スノーフレーク アーキテクチャの代わりにスター スキーマを検討してください
mt_mt: Ikkunsidra schema stilla minflok arkitettura snowflake
nl_nl: Overweeg een ster-schema in plaats van een sneeuwvlok-architectuur
pt_br: Considere um esquema em estrela em vez de uma arquitetura de floco de neve
ru_ru: Рассмотрите схему типа «звезда» вместо архитектуры в виде снежинки
sk_sk: Zvážte hviezdnu schému namiesto architektúry snehovej vločky
sl_sl: Razmislite o zvezdni shemi namesto arhitekture snežinke
sv_se: Överväg ett star-schema i stället för en snöflingearkitektur
ta_in: ஸ்னோஃப்ளேக் கட்டிடக்கலைக்கு பதிலாக ஒரு நட்சத்திர-திட்டத்தைக் கவனியுங்கள்
zu_za: Cabanga nge-star-schema esikhundleni sesakhiwo seqhwa

source: Avoid using views when using Direct Lake mode
ar_ae: تجنب استخدام طرق العرض عند استخدام وضع Direct Lake
bg_bg: Избягвайте използването на изгледи, когато използвате режим Direct Lake
da_dk: Undgå at bruge visninger, når du bruger Direct Lake-tilstand
de_de: Vermeiden Sie die Verwendung von Ansichten, wenn Sie den Direct Lake-Modus verwenden
el_gr: Αποφύγετε τη χρήση προβολών κατά τη χρήση της λειτουργίας Direct Lake
fa_ir: خودداری از استفاده از نماها هنگام استفاده از حالت Direct Lake
ga_ie: Seachain tuairimí a úsáid agus mód Direct Lake á úsáid agat
hu_hu: Kerülje a nézetek használatát a Direct Lake mód használatakor
id_id: Hindari menggunakan tampilan saat menggunakan mode Direct Lake
is_is: Forðastu að nota útsýni þegar þú notar Direct Lake ham
ja_jp: Direct Lake モードを使用する場合は、ビューの使用を避けてください
mt_mt: Evita li tuża veduti meta tuża l-modalità Direct Lake
nl_nl: Vermijd het gebruik van weergaven bij het gebruik van de Direct Lake-modus
pt_br: Evite usar exibições ao usar o modo Direct Lake
ru_ru: Избегайте использования видов при использовании режима Direct Lake
sk_sk: Vyhnite sa používaniu zobrazení pri používaní režimu Direct Lake
sl_sl: Izogibanje uporabi pogledov pri uporabi načina Direct Lake
sv_se: Undvik att använda vyer när du använder Direct Lake-läge
ta_in: நேரடி ஏரி பயன்முறையைப் பயன்படுத்தும் போது காட்சிகளைப் பயன்படுத்துவதைத் தவிர்க்கவும்
zu_za: Gwema ukusebenzisa imibono uma usebenzisa imodi ye-Direct Lake

source: Avoid adding 0 to a measure
ar_ae: تجنب إضافة 0 إلى مقياس
bg_bg: Избягвайте добавянето на 0 към мярка
da_dk: Undgå at føje 0 til en måling
de_de: Vermeiden Sie das Hinzufügen von 0 zu einer Kennzahl
el_gr: Αποφύγετε την προσθήκη 0 σε μια μέτρηση
fa_ir: از افزودن 0 به یک اندازه گیری خودداری کنید
ga_ie: Seachain 0 a chur le beart
hu_hu: Ne adjon hozzá 0-t egy mértékhez
id_id: Hindari menambahkan 0 ke ukuran
is_is: Forðastu að bæta 0 við mál
ja_jp: メジャーに 0 を加算しないようにする
mt_mt: Evita li żżid 0 ma' miżura
nl_nl: Vermijd het toevoegen van 0 aan een maat
pt_br: Evite adicionar 0 a uma medida
ru_ru: Избегайте добавления 0 к мере
sk_sk: Vyhnite sa pridávaniu 0 k taktu
sl_sl: Izogibanje dodajanju 0 k meri
sv_se: Undvik att lägga till 0 i ett mått
ta_in: ஒரு நடவடிக்கையில் 0 ஐச் சேர்ப்பதைத் தவிர்க்கவும்
zu_za: Gwema ukwengeza i-0 esilinganisweni

source: Reduce usage of calculated tables
ar_ae: تقليل استخدام الجداول المحسوبة
bg_bg: Намалете използването на изчисляеми таблици
da_dk: Reducer brugen af beregnede tabeller
de_de: Reduzieren Sie die Verwendung von berechneten Tabellen
el_gr: Μειώστε τη χρήση των υπολογιζόμενων πινάκων
fa_ir: کاهش استفاده از جداول محاسبه شده
ga_ie: Úsáid táblaí ríofa a laghdú
hu_hu: A számított táblák használatának csökkentése
id_id: Mengurangi penggunaan tabel terhitung
is_is: Draga úr notkun á reiknuðum töflum
ja_jp: 計算テーブルの使用量を削減
mt_mt: Naqqas l-użu tat-tabelli kkalkulati
nl_nl: Verminder het gebruik van berekende tabellen
pt_br: Reduzir o uso de tabelas calculadas
ru_ru: Сокращение использования вычисляемых таблиц
sk_sk: Znížte používanie vypočítavaných tabuliek
sl_sl: Zmanjšanje uporabe izračunanih tabel
sv_se: Minska användningen av beräknade tabeller
ta_in: கணக்கிடப்பட்ட அட்டவணைகளின் பயன்பாட்டைக் குறைக்கவும்
zu_za: Nciphisa ukusetshenziswa kwamatafula abalwe
