Repository: pypi-data/pypi-mirror-384
Catalog: packages/semantic-link-labs/semantic_link_labs-0.12.4-py3-none-any.whl/sempy_labs/_bpa_translation/_model/_translations_*.po
Languages: ar_ae, bg_bg, da_dk, de_de, el_gr, fa_ir, ga_ie, hu_hu, id_id, is_is, ja_jp, mt_mt, nl_nl, pt_br, ru_ru, sk_sk, sl_sl, sv_se, ta_in, zu_za

source: Avoid using '1-(x/y)' syntax
ar_ae: تجنب استخدام بناء الجملة "1- (x / y)"
bg_bg: Избягвайте използването на синтаксис "1-(x/y)"
da_dk: Undgå at bruge '1-(x/y)'-syntaks
de_de: Vermeiden Sie die Verwendung der Syntax "1-(x/y)".
el_gr: Αποφύγετε τη χρήση σύνταξης '1-(x/y)'
fa_ir: از استفاده از نحو "1-(x/y)" خودداری کنید
ga_ie: Seachain comhréir '1-(x/y)' a úsáid
hu_hu: Kerülje az "1-(x/y)" szintaxis használatát
id_id: Hindari menggunakan sintaks '1-(x/y)'
is_is: Forðastu að nota "1-(x/y)" setningafræði
ja_jp: '1-(x/y)' 構文の使用は避けてください
mt_mt: Evita li tuża s-sintassi "1-(x/y)"
nl_nl: Vermijd het gebruik van de '1-(x/y)'-syntaxis
pt_br: Evite usar a sintaxe '1-(x/y)'
ru_ru: Избегайте использования синтаксиса '1-(x/y)'
sk_sk: Nepoužívajte syntax "1-(x/y)"
sl_sl: Izogibajte se uporabi sintakse »1-(x/y)«
sv_se: Undvik att använda syntaxen "1-(x/y)"
ta_in: '1-(x/y)' syntax பயன்படுத்துவதை தவிர்க்கவும்
zu_za: Gwema ukusebenzisa i-syntax '1- (x / y)'

source: Filter measure values by columns, not tables
ar_ae: تصفية قياس القيم حسب الأعمدة، وليس الجداول
bg_bg: Филтриране на стойностите на мерките по колони, а не по таблици
da_dk: Filtrere målingsværdier efter kolonner, ikke tabeller
de_de: Filtern von Measurewerten nach Spalten, nicht nach Tabellen
el_gr: Φιλτράρισμα τιμών μέτρησης κατά στήλες και όχι κατά πίνακες
fa_ir: مقادیر اندازه گیری را بر اساس ستون ها فیلتر کنید، نه جداول
ga_ie: Scag luachanna tomhais de réir colúin, ní táblaí
hu_hu: A mértékértékek szűrése oszlopok, nem táblázatok szerint
id_id: Memfilter nilai pengukuran berdasarkan kolom, bukan tabel
is_is: Sía mæligildi eftir dálkum, ekki töflum
ja_jp: メジャー値をテーブルではなく列でフィルタリングする
mt_mt: Iffiltra l-valuri tal-kejl bil-kolonni, mhux it-tabelli
nl_nl: Meetwaarden filteren op kolommen, niet op tabellen
pt_br: Filtrar valores de medida por colunas, não por tabelas
ru_ru: Фильтрация значений мер по столбцам, а не по таблицам
sk_sk: Filtrovanie hodnôt mierky podľa stĺpcov, nie tabuliek
sl_sl: Filtriranje vrednosti mer po stolpcih, ne po tabelah
sv_se: Filtrera mätvärden efter kolumner, inte tabeller
ta_in: வடிகட்டி அளவீட்டு மதிப்புகளை அட்டவணைகளால் அல்ல, நெடுவரிசைகளால் வடிகட்டவும்
zu_za: Hlunga amanani okulinganisa ngamakholomu, hhayi amatafula

source: Filter column values with proper syntax
ar_ae: تصفية قيم الأعمدة ذات بناء الجملة المناسب
bg_bg: Филтриране на стойностите на колони с правилен синтаксис
da_dk: Filtrere kolonneværdier med korrekt syntaks
de_de: Filtern von Spaltenwerten mit der richtigen Syntax
el_gr: Φιλτράρισμα τιμών στηλών με σωστή σύνταξη
fa_ir: فیلتر کردن مقادیر ستون با نحو مناسب
ga_ie: Scag luachanna colúin le comhréir chuí
hu_hu: Oszlopértékek szűrése megfelelő szintaxissal
id_id: Filter nilai kolom dengan sintaks yang tepat
is_is: Sía dálkgildi með réttri setningafræði
ja_jp: 適切な構文で列の値をフィルタリングする
mt_mt: Valuri tal-kolonna tal-filtru b'sintassi xierqa
nl_nl: Kolomwaarden filteren met de juiste syntaxis
pt_br: Filtrar valores de coluna com sintaxe adequada
ru_ru: Фильтруйте значения столбцов с правильным синтаксисом
sk_sk: Filtrovanie hodnôt stĺpcov so správnou syntaxou
sl_sl: Filtriranje vrednosti stolpcev z ustrezno sintakso
sv_se: Filtrera kolumnvärden med rätt syntax
ta_in: நெடுவரிசை மதிப்புகளை சரியான தொடரியல் மூலம் வடிகட்டவும்
zu_za: Hlunga amanani ekholomu nge-syntax efanele

source: Use the DIVIDE function for division
ar_ae: استخدم الدالة DIVIDE للتقسيم
bg_bg: Използвайте функцията DIVIDE за разделяне
da_dk: Brug funktionen DIVIDER til division
de_de: Verwenden Sie die DIVIDE-Funktion für die Division
el_gr: Χρήση της συνάρτησης DIVIDE για διαίρεση
fa_ir: استفاده از تابع DIVIDE برای تقسیم
ga_ie: Bain úsáid as an fheidhm DIVIDE le haghaidh roinnte
hu_hu: Az osztás függvény használata osztáshoz
id_id: Gunakan fungsi DIVIDE untuk pembagian
is_is: Nota aðgerðina DEILA fyrir deilingu
ja_jp: 除算には DIVIDE 関数を使用します
mt_mt: Uża l-funzjoni DIVIDE għad-diviżjoni
nl_nl: Gebruik de functie DELEN voor deling
pt_br: Use a função DIVIDIR para divisão
ru_ru: Использование функции РАЗДЕЛИТЬ для деления
sk_sk: Použitie funkcie DIVIDE na delenie
sl_sl: Uporaba funkcije DIVIDE za delitev
sv_se: Använd funktionen DIVIDERA för division
ta_in: வகுத்தலுக்கு DIVIDE செயல்பாட்டைப் பயன்படுத்தவும்
zu_za: Sebenzisa umsebenzi we-DIVIDE wokuhlukanisa

source: Column references should be fully qualified
ar_ae: يجب أن تكون مراجع الأعمدة مؤهلة تماما
bg_bg: Препратките към колоните трябва да са напълно квалифицирани
da_dk: Kolonnereferencer skal være fuldt kvalificerede
de_de: Spaltenverweise sollten vollständig qualifiziert sein
el_gr: Οι αναφορές στηλών θα πρέπει να είναι πλήρως εξειδικευμένες
fa_ir: مراجع ستون باید کاملا واجد شرایط باشند
ga_ie: Ba cheart tagairtí colúin a bheith láncháilithe
hu_hu: Az oszlophivatkozásoknak teljes mértékben minősítettnek kell lenniük
id_id: Referensi kolom harus sepenuhnya memenuhi syarat
is_is: Dálkatilvísanir ættu að vera fullgildar
ja_jp: 列参照は完全修飾する必要があります
mt_mt: Ir-referenzi tal-kolonna għandhom ikunu kkwalifikati bis-sħiħ
nl_nl: Kolomverwijzingen moeten volledig gekwalificeerd zijn
pt_br: As referências de coluna devem ser totalmente qualificadas
ru_ru: Ссылки на столбцы должны быть полностью квалифицированными
sk_sk: Odkazy na stĺpce by mali byť plne kvalifikované
sl_sl: Sklicevanja na stolpce morajo biti v celoti kvalificirana
sv_se: Kolumnreferenser ska vara fullständigt kvalificerade
ta_in: நெடுவரிசை குறிப்புகள் முழுமையாக தகுதி பெற்றிருக்க வேண்டும்
zu_za: Izinkomba zekholomu kufanele zifaneleke ngokugcwele

source: Measure references should be unqualified
ar_ae: يجب أن تكون مراجع القياس غير مشروطة
bg_bg: Референтните мерки трябва да бъдат безрезервни
da_dk: Referencer til målinger bør være ukvalificerede
de_de: Kennzahlenreferenzen sollten nicht qualifiziert sein
el_gr: Οι αναφορές στα μέτρα δεν πρέπει να είναι έγκυρες
fa_ir: ارجاعات اندازه گیری باید فاقد صلاحیت باشند
ga_ie: Ba cheart tagairtí birt a bheith neamhcháilithe
hu_hu: Az intézkedéshivatkozásoknak minősítés nélkülieknek kell lenniük
id_id: Referensi ukuran harus tidak memenuhi syarat
is_is: Tilvísanir í mælikvarða ættu að vera óhæfar
ja_jp: メジャー参照は修飾されていない必要があります
mt_mt: Ir-referenzi tal-miżura ma għandhomx jiġu kkwalifikati
nl_nl: Verwijzingen naar maatregelen moeten zonder voorbehoud zijn
pt_br: As referências de medida devem ser não qualificadas
ru_ru: Ссылки на меры должны быть неквалифицированными
sk_sk: Odkazy na opatrenia by mali byť nekvalifikované
sl_sl: Sklicevanja na ukrepe morajo biti nekvalificirana
sv_se: Måttreferenser bör vara okvalificerade
ta_in: அளவீட்டு குறிப்புகள் தகுதியற்றதாக இருக்க வேண்டும்
zu_za: Izinkomba zesilinganiso kufanele zingafaneleki

source: Inactive relationships that are never activated
ar_ae: العلاقات غير النشطة التي لا يتم تنشيطها مطلقا
bg_bg: Неактивни връзки, които никога не се активират
da_dk: Inaktive relationer, der aldrig aktiveres
de_de: Inaktive Beziehungen, die nie aktiviert werden
el_gr: Ανενεργές σχέσεις που δεν ενεργοποιούνται ποτέ
fa_ir: روابط غیرفعال که هرگز فعال نمی شوند
ga_ie: Caidrimh neamhghníomhacha nach ngníomhaítear riamh
hu_hu: Inaktív kapcsolatok, amelyek soha nincsenek aktiválva
id_id: Hubungan tidak aktif yang tidak pernah diaktifkan
is_is: Óvirk sambönd sem eru aldrei virkjuð
ja_jp: アクティブ化されない非アクティブな関係
mt_mt: Relazzjonijiet inattivi li qatt ma jiġu attivati
nl_nl: Inactieve relaties die nooit worden geactiveerd
pt_br: Relacionamentos inativos que nunca são ativados
ru_ru: Неактивные отношения, которые никогда не активируются
sk_sk: Neaktívne vzťahy, ktoré sa nikdy neaktivujú
sl_sl: Neaktivni odnosi, ki se nikoli ne aktivirajo
sv_se: Inaktiva relationer som aldrig aktiveras
ta_in: ஒருபோதும் செயல்படுத்தப்படாத செயலற்ற உறவுகள்
zu_za: Ubudlelwano obungasebenzi obungakaze busebenze

source: Remove unnecessary columns
ar_ae: إزالة الأعمدة غير الضرورية
bg_bg: Премахване на ненужните колони
da_dk: Fjern unødvendige kolonner
de_de: Entfernen nicht benötigter Spalten
el_gr: Κατάργηση περιττών στηλών
fa_ir: ستون های غیر ضروری را حذف کنید
ga_ie: Bain colúin gan ghá
hu_hu: Távolítsa el a felesleges oszlopokat
id_id: Menghapus kolom yang tidak perlu
is_is: Fjarlægja óþarfa dálka
ja_jp: 不要な列を削除する
mt_mt: Neħħi kolonni mhux meħtieġa
nl_nl: Onnodige kolommen verwijderen
pt_br: Remover colunas desnecessárias
ru_ru: Удалите ненужные столбцы
sk_sk: Odstránenie nepotrebných stĺpcov
sl_sl: Odstranjevanje nepotrebnih stolpcev
sv_se: Ta bort onödiga kolumner
ta_in: தேவையற்ற பத்திகளை அகற்றவும்
zu_za: Susa amakholomu angadingekile

source: Remove unnecessary measures
ar_ae: إزالة التدابير غير الضرورية
bg_bg: Премахнете ненужните мерки
da_dk: Fjern unødvendige foranstaltninger
de_de: Entfernen Sie unnötige Maßnahmen
el_gr: Κατάργηση περιττών μέτρων
fa_ir: اقدامات غیرضروری را حذف کنید
ga_ie: Bain bearta neamhriachtanacha
hu_hu: Távolítsa el a felesleges intézkedéseket
id_id: Hapus tindakan yang tidak perlu
is_is: Fjarlægðu óþarfa ráðstafanir
ja_jp: 不要な対策を削除する
mt_mt: Neħħi miżuri mhux meħtieġa
nl_nl: Overbodige maatregelen schrappen
pt_br: Remova medidas desnecessárias
ru_ru: Избавьтесь от ненужных мер
sk_sk: Odstráňte nepotrebné opatrenia
sl_sl: Odstranite nepotrebne ukrepe
sv_se: Ta bort onödiga åtgärder
ta_in: தேவையற்ற நடவடிக்கைகளை நீக்கவும்
zu_za: Susa izinyathelo ezingadingekile

source: Ensure tables have relationships
ar_ae: التأكد من وجود علاقات بين الجداول
bg_bg: Уверете се, че таблиците имат релации
da_dk: Sørg for, at tabeller har relationer
de_de: Sicherstellen, dass Tabellen Beziehungen haben
el_gr: Βεβαιωθείτε ότι οι πίνακες έχουν σχέσεις
fa_ir: اطمینان حاصل کنید که جداول دارای روابط هستند
ga_ie: Cinntigh go bhfuil caidrimh ag táblaí
hu_hu: Győződjön meg arról, hogy a táblák rendelkeznek kapcsolatokkal
id_id: Pastikan tabel memiliki hubungan
is_is: Gakktu úr skugga um að töflur hafi tengsl
ja_jp: テーブルにリレーションシップがあることを確認する
mt_mt: Kun żgur li t-tabelli għandhom relazzjonijiet
nl_nl: Zorg ervoor dat tabellen relaties hebben
pt_br: Garantir que as tabelas tenham relações
ru_ru: Убедитесь, что у таблиц есть связи
sk_sk: Zabezpečenie vzťahov medzi tabuľkami
sl_sl: Zagotavljanje, da imajo tabele relacije
sv_se: Se till att tabeller har relationer
ta_in: அட்டவணைகள் உறவுகளைக் கொண்டிருப்பதை உறுதிப்படுத்தவும்
zu_za: Qinisekisa ukuthi amatafula anobudlelwano

source: Calculation groups with no calculation items
ar_ae: مجموعات الحساب التي لا تحتوي على عناصر حسابية
bg_bg: Изчислителни групи без изчислителни елементи
da_dk: Beregningsgrupper uden beregningselementer
de_de: Berechnungsgruppen ohne Berechnungselemente
el_gr: Ομάδες υπολογισμού χωρίς στοιχεία υπολογισμού
fa_ir: گروه های محاسباتی بدون آیتم های محاسباتی
ga_ie: Grúpaí ríofa gan aon ítimí ríofa
hu_hu: Számítási elemek nélküli számítási csoportok
id_id: Grup perhitungan tanpa item perhitungan
is_is: Reikniflokkar án útreikningsatriða
ja_jp: 計算項目がない計算グループ
mt_mt: Gruppi ta' kalkolu mingħajr partiti ta' kalkolu
nl_nl: Berekeningsgroepen zonder berekeningsitems
pt_br: Grupos de cálculo sem itens de cálculo
ru_ru: Группы расчетов без элементов расчета
sk_sk: Výpočtové skupiny bez výpočtových položiek
sl_sl: Skupine za izračun brez elementov za izračun
sv_se: Beräkningsgrupper utan beräkningsobjekt
ta_in: கணக்கீட்டு உருப்படிகள் இல்லாத கணக்கீட்டு குழுக்கள்
zu_za: Amaqembu okubala ngaphandle kwezinto zokubala

source: Visible objects with no description
ar_ae: كائنات مرئية بدون وصف
bg_bg: Видими обекти без описание
da_dk: Synlige objekter uden beskrivelse
de_de: Sichtbare Objekte ohne Beschreibung
el_gr: Ορατά αντικείμενα χωρίς περιγραφή
fa_ir: اشیاء قابل مشاهده بدون توضیحات
ga_ie: Réada infheicthe gan tuairisc
hu_hu: Látható objektumok leírás nélkül
id_id: Objek yang terlihat tanpa deskripsi
is_is: Sýnilegir hlutir án lýsingar
ja_jp: 説明のない表示オブジェクト
mt_mt: Oġġetti viżibbli mingħajr deskrizzjoni
nl_nl: Zichtbare objecten zonder beschrijving
pt_br: Objetos visíveis sem descrição
ru_ru: Видимые объекты без описания
sk_sk: Viditeľné objekty bez popisu
sl_sl: Vidni predmeti brez opisa
sv_se: Synliga objekt utan beskrivning
ta_in: விளக்கம் இல்லாமல் காணக்கூடிய பொருள்கள்
zu_za: Izinto ezibonakalayo ngaphandle kwencazelo

source: Provide format string for 'Date' columns
ar_ae: توفير سلسلة تنسيق لأعمدة "التاريخ"
bg_bg: Предоставяне на форматиран низ за графите "Дата"
da_dk: Angiv formatstreng for kolonnerne "Dato"
de_de: Geben Sie eine Formatzeichenfolge für "Date"-Spalten an
el_gr: Παροχή συμβολοσειράς μορφής για στήλες "Ημερομηνία"
fa_ir: رشته فرمت را برای ستون های "تاریخ" ارائه دهید
ga_ie: Cuir teaghrán formáide ar fáil do cholúin 'Dáta'
hu_hu: Adja meg a "Dátum" oszlopok formázási karakterláncát
id_id: Menyediakan string format untuk kolom 'Tanggal'
is_is: Gefa upp sniðstreng fyrir dálka "Dagsetning"
ja_jp: 'Date' 列の書式指定文字列を指定する
mt_mt: Ipprovdi s-sekwenza tal-format għall-kolonni "Data"
nl_nl: Opmaak opgeven voor 'Datum'-kolommen
pt_br: Fornecer cadeia de caracteres de formato para colunas de 'Data'
ru_ru: Укажите строку формата для столбцов "Дата"
sk_sk: Poskytnutie reťazca formátu pre stĺpce Dátum
sl_sl: Navedite niz oblike zapisa za stolpce »Datum«
sv_se: Ange formatsträng för "Datum"-kolumner
ta_in: 'தேதி' நெடுவரிசைகளுக்கான வடிவமைப்பு சரத்தை வழங்கவும்
zu_za: Nikeza umucu wefomethi yamakholomu 'Osuku'

source: Do not summarize numeric columns
ar_ae: عدم تلخيص الأعمدة الرقمية
bg_bg: Не обобщавайте числови колони
da_dk: Opsummer ikke numeriske kolonner
de_de: Numerische Spalten nicht zusammenfassen
el_gr: Χωρίς σύνοψη αριθμητικών στηλών
fa_ir: ستون های عددی را خلاصه نکنید
ga_ie: Ná déan achoimre ar cholúin uimhriúla
hu_hu: Numerikus oszlopok összegzésének mellőzése
id_id: Jangan meringkas kolom numerik
is_is: Ekki taka saman tölulega dálka
ja_jp: 数値列を集計しない
mt_mt: Tiġborx fil-qosor il-kolonni numeriċi
nl_nl: Numerieke kolommen niet samenvatten
pt_br: Não resumir colunas numéricas
ru_ru: Не суммируйте числовые столбцы
sk_sk: Nesumarizovať číselné stĺpce
sl_sl: Ne povzemaj številskih stolpcev
sv_se: Summera inte numeriska kolumner
ta_in: எண் நெடுவரிசைகளை சுருக்க வேண்டாம்
zu_za: Ungafingqi amakholomu ezinombolo

source: Provide format string for measures
ar_ae: توفير سلسلة تنسيق للمقاييس
bg_bg: Предоставяне на форматиран низ за мерки
da_dk: Angiv formatstreng for målinger
de_de: Bereitstellen einer Formatzeichenfolge für Measures
el_gr: Παροχή συμβολοσειράς μορφής για μετρήσεις
fa_ir: رشته فرمت را برای اندازه گیری ها ارائه دهید
ga_ie: Tabhair teaghrán formáide do bhearta
hu_hu: Formázási karakterlánc megadása mértékekhez
id_id: Menyediakan string format untuk pengukuran
is_is: Gefa upp sniðstreng fyrir mælingar
ja_jp: メジャーの書式指定文字列を指定する
mt_mt: Ipprovdi s-sekwenza tal-format għall-miżuri
nl_nl: Opmaak tekenreeks voor metingen opgeven
pt_br: Fornecer cadeia de caracteres de formato para medidas
ru_ru: Предоставление строки формата для мер
sk_sk: Poskytnutie reťazca formátu pre mierky
sl_sl: Določanje niza oblike zapisa za mere
sv_se: Ange formatsträng för mått
ta_in: அளவீடுகளுக்கு வடிவமைப்பு சரத்தை வழங்கவும்
zu_za: Nikeza umucu wefomethi yezinyathelo

source: Add data category for columns
ar_ae: إضافة فئة بيانات للأعمدة
bg_bg: Добавяне на категория данни за колони
da_dk: Tilføj datakategori for kolonner
de_de: Hinzufügen einer Datenkategorie für Spalten
el_gr: Προσθήκη κατηγορίας δεδομένων για στήλες
fa_ir: افزودن دسته داده برای ستون ها
ga_ie: Cuir catagóir sonraí le haghaidh colúin
hu_hu: Adatkategória hozzáadása oszlopokhoz
id_id: Menambahkan kategori data untuk kolom
is_is: Bæta við gagnaflokki fyrir dálka
ja_jp: 列のデータ カテゴリを追加する
mt_mt: Żid il-kategorija tad-dejta għall-kolonni
nl_nl: Gegevenscategorie voor kolommen toevoegen
pt_br: Adicionar categoria de dados para colunas
ru_ru: Добавление категории данных для столбцов
sk_sk: Pridanie kategórie údajov pre stĺpce
sl_sl: Dodajanje kategorije podatkov za stolpce
sv_se: Lägga till datakategori för kolumner
ta_in: நெடுவரிசைகளுக்கான தரவு வகையைச் சேர்க்கவும்
zu_za: Engeza isigaba sedatha yamakholomu

source: Percentages should be formatted with thousands separators and 1 decimal
ar_ae: يجب تنسيق النسب المئوية بآلاف الفواصل و 1 عشري
bg_bg: Процентите трябва да бъдат форматирани с хиляди разделители и 1 десетичен знак
da_dk: Procenter skal formateres med tusindtalsseparatorer og 1 decimal
de_de: Prozentsätze sollten mit Tausendertrennzeichen und 1 Dezimalstelle formatiert werden
el_gr: Τα ποσοστά πρέπει να μορφοποιούνται με διαχωριστικά χιλιάδων και 1 δεκαδικό
fa_ir: درصدها باید با هزاران جداکننده و 1 اعشار قالب بندی شوند
ga_ie: Ba cheart céatadáin a fhormáidiú leis na mílte deighilteoirí agus 1 dheachúil
hu_hu: A százalékértékeket ezreselválasztóval és 1 tizedesjellel kell formázni
id_id: Persentase harus diformat dengan pemilah ribuan dan 1 desimal
is_is: Prósentur ættu að vera sniðnar með þúsundaskiltáknum og 1 aukastaf
ja_jp: パーセンテージは、千の位の区切り記号と小数点以下 1 桁で書式設定する必要があります
mt_mt: Il-perċentwali għandhom jiġu fformattjati b'eluf ta' separaturi u deċimali 1
nl_nl: Percentages moeten worden opgemaakt met scheidingstekens voor duizendtallen en 1 decimaal
pt_br: As porcentagens devem ser formatadas com separadores de milhares e 1 casa decimal
ru_ru: Проценты должны быть отформатированы с помощью разделителей тысяч и 1 знака после запятой
sk_sk: Percentá by mali byť formátované pomocou oddeľovačov tisícov a 1 desatinného miesta
sl_sl: Odstotki morajo biti oblikovani s tisoč ločili in 1 decimalno številko
sv_se: Procentsatser ska formateras med tusentalsavgränsare och 1 decimal
ta_in: சதவீதங்கள் ஆயிரக்கணக்கான பிரிப்பான்கள் மற்றும் 1 தசமத்துடன் வடிவமைக்கப்பட வேண்டும்
zu_za: Amaphesenti kufanele ahlelwe ngezinkulungwane zezihlukanisi kanye ne-1 decimal

source: Whole numbers should be formatted with thousands separators and no decimals
ar_ae: يجب تنسيق الأعداد الصحيحة بآلاف الفواصل وبدون كسور عشرية
bg_bg: Целите числа трябва да бъдат форматирани с хиляди разделители и без десетични знаци
da_dk: Hele tal skal formateres med tusindtalsseparatorer og ingen decimaler
de_de: Ganze Zahlen sollten mit Tausendertrennzeichen und ohne Dezimalstellen formatiert werden
el_gr: Οι ακέραιοι αριθμοί πρέπει να μορφοποιούνται με διαχωριστικά χιλιάδων και χωρίς δεκαδικά ψηφία
fa_ir: اعداد کامل باید با هزاران جداکننده و بدون اعشار قالب بندی شوند
ga_ie: Ba cheart slánuimhreacha a fhormáidiú leis na mílte deighilteoirí agus gan aon deachúlacha
hu_hu: Az egész számokat ezreselválasztójellel kell formázni, tizedesjegyek nélkül
id_id: Bilangan bulat harus diformat dengan pemilah ribuan dan tanpa desimal
is_is: Heilar tölur ættu að vera sniðnar með þúsundaskiltáknum og engum aukastöfum
ja_jp: 整数は、小数点以下の桁数ではなく、千の位の区切り記号で書式設定する必要があります
mt_mt: In-numri sħaħ għandhom jiġu fformattjati b'eluf ta' separaturi u mingħajr deċimali
nl_nl: Gehele getallen moeten worden opgemaakt met scheidingstekens voor duizendtallen en geen decimalen
pt_br: Os números inteiros devem ser formatados com separadores de milhares e sem decimais
ru_ru: Целые числа должны быть отформатированы с помощью разделителей тысяч и без десятичных дробей
sk_sk: Celé čísla by mali byť formátované pomocou oddeľovačov tisícov a bez desatinných miest
sl_sl: Cela števila morajo biti oblikovana z ločili na tisoče in brez decimalk
sv_se: Heltal ska formateras med tusentalsavgränsare och inga decimaler
ta_in: முழு எண்கள் ஆயிரக்கணக்கான பிரிப்பான்களுடன் வடிவமைக்கப்பட வேண்டும், தசமங்கள் இல்லாமல் இருக்க வேண்டும்
zu_za: Izinombolo eziphelele kufanele zihlelwe ngezinkulungwane zezihlukanisi futhi akukho ama-decimals

source: Hide foreign keys
ar_ae: إخفاء المفاتيح الخارجية
bg_bg: Скриване на външни ключове
da_dk: Skjul fremmede nøgler
de_de: Fremdschlüssel ausblenden
el_gr: Απόκρυψη ξένων κλειδιών
fa_ir: پنهان کردن کلیدهای خارجی
ga_ie: Folaigh eochracha eachtracha
hu_hu: Idegen kulcsok elrejtése
id_id: Sembunyikan kunci asing
is_is: Fela erlenda lykla
ja_jp: 外部キーの非表示
mt_mt: Aħbi ċ-ċwievet barranin
nl_nl: Vreemde sleutels verbergen
pt_br: Ocultar chaves estrangeiras
ru_ru: Скрыть внешние ключи
sk_sk: Skrytie cudzích kľúčov
sl_sl: Skrivanje tujih ključev
sv_se: Dölj sekundärnycklar
ta_in: வெளிநாட்டு விசைகளை மறை
zu_za: Fihla okhiye bangaphandle

source: Mark primary keys
ar_ae: وضع علامة على المفاتيح الأساسية
bg_bg: Маркиране на първични ключове
da_dk: Markér primære nøgler
de_de: Markieren von Primärschlüsseln
el_gr: Σήμανση πρωτευόντων κλειδιών
fa_ir: علامت گذاری کلیدهای اصلی
ga_ie: Marcáil eochracha príomhúla
hu_hu: Elsődleges kulcsok megjelölése
id_id: Tandai kunci utama
is_is: Merktu aðallykla
ja_jp: プライマリ・キーのマーク
mt_mt: Immarka t-tasti primarji
nl_nl: Primaire sleutels markeren
pt_br: Marcar chaves primárias
ru_ru: Маркировка первичных ключей
sk_sk: Označenie primárnych kľúčov
sl_sl: Označevanje primarnih ključev
sv_se: Markera primärnycklar
ta_in: முதன்மை விசைகளை குறிக்கவும்
zu_za: Phawula okhiye abaphambili

source: Month (as a string) must be sorted
ar_ae: يجب فرز الشهر (كسلسلة)
bg_bg: Месецът (като низ) трябва да бъде сортиран
da_dk: Måned (som en streng) skal sorteres
de_de: Monat (als Zeichenfolge) muss sortiert werden
el_gr: Ο μήνας (ως συμβολοσειρά) πρέπει να ταξινομηθεί
fa_ir: ماه (به عنوان رشته) باید مرتب شود
ga_ie: Ní mór mí (mar theaghrán) a shórtáil
hu_hu: A hónapot (karakterláncként) rendezni kell
id_id: Bulan (sebagai string) harus diurutkan
is_is: Mánuður (sem strengur) verður að flokka
ja_jp: 月(文字列として)はソートする必要があります
mt_mt: Ix-xahar (bħala sekwenza) għandu jiġi ssortjat
nl_nl: Maand (als een tekenreeks) moet worden gesorteerd
pt_br: Mês (como uma string) deve ser classificado
ru_ru: Месяц (в виде строки) должен быть отсортирован
sk_sk: Mesiac (ako reťazec) musí byť zoradený
sl_sl: Mesec (kot niz) mora biti razvrščen
sv_se: Månad (som en sträng) måste sorteras
ta_in: மாதம் (ஒரு சரமாக) வரிசைப்படுத்தப்பட வேண்டும்
zu_za: Inyanga (njengentambo) kumele ihlelwe

source: Relationship columns should be of integer data type
ar_ae: يجب أن تكون أعمدة العلاقة من نوع بيانات عدد صحيح
bg_bg: Колоните на релацията трябва да са от целочислен тип данни
da_dk: Relationskolonner skal være af heltalsdatatypen
de_de: Beziehungsspalten sollten vom Datentyp "Integer" sein
el_gr: Οι στήλες σχέσεων πρέπει να είναι ακέραιου τύπου δεδομένων
fa_ir: ستون های رابطه باید از نوع داده های عدد صحیح باشند
ga_ie: Ba chóir colúin Gaol a bheith de chineál slánuimhir sonraí
hu_hu: A kapcsolati oszlopoknak egész szám adattípusúnak kell lenniük
id_id: Kolom relasi harus bertipe data bilangan bulat
is_is: Tengsladálkar ættu að vera af heiltölu gagnagerð
ja_jp: リレーションシップ列は整数データ型である必要があります
mt_mt: Il-kolonni tar-relazzjoni għandhom ikunu tat-tip ta' dejta interi
nl_nl: Relatiekolommen moeten van het gegevenstype geheel getal zijn
pt_br: As colunas de relacionamento devem ser do tipo de dados inteiro
ru_ru: Столбцы отношений должны иметь целочисленный тип данных
sk_sk: Stĺpce vzťahu by mali mať celočíselný typ údajov
sl_sl: Stolpci relacije morajo biti celoštevilskega podatkovnega tipa
sv_se: Relationskolumner ska vara av heltalsdatatypen
ta_in: உறவு நெடுவரிசைகள் முழுஎண் தரவினமாக இருக்க வேண்டும்
zu_za: Amakholomu obudlelwane kufanele abe ngohlobo lwedatha ye-integer
