Repository: pypi-data/pypi-mirror-384
Catalog: packages/semantic-link-labs/semantic_link_labs-0.12.4-py3-none-any.whl/sempy_labs/_bpa_translation/_model/_translations_*.po
Languages: ar_ae, bg_bg, da_dk, de_de, el_gr, fa_ir, ga_ie, hu_hu, id_id, is_is, ja_jp, mt_mt, nl_nl, pt_br, ru_ru, sk_sk, sl_sl, sv_se, ta_in, zu_za

source: Reduce usage of calculated columns that use the RELATED function
ar_ae: تقليل استخدام الأعمدة المحسوبة التي تستخدم الدالة RELATED
bg_bg: Намаляване на използването на изчисляеми колони, които използват функцията RELATED
da_dk: Reducere brugen af beregnede kolonner, der bruger funktionen RELATED
de_de: Reduzieren Sie die Verwendung von berechneten Spalten, die die RELATED-Funktion verwenden
el_gr: Μειώστε τη χρήση των υπολογιζόμενων στηλών που χρησιμοποιούν τη συνάρτηση RELATED
fa_ir: کاهش استفاده از ستون های محاسبه شده که از تابع RELATED استفاده می کنند
ga_ie: Laghdaigh úsáid na gcolún ríofa a úsáideann an fheidhm GHAOLMHAR
hu_hu: A RELATED függvényt használó számított oszlopok használatának csökkentése
id_id: Mengurangi penggunaan kolom terhitung yang menggunakan fungsi RELATED
is_is: Draga úr notkun reiknaðra dálka sem nota aðgerðina TENGT
ja_jp: RELATED 関数を使用する計算列の使用を減らす
mt_mt: Naqqas l-użu ta' kolonni kkalkulati li jużaw il-funzjoni RELATATA
nl_nl: Verminder het gebruik van berekende kolommen die gebruikmaken van de functie RELATED
pt_br: Reduzir o uso de colunas calculadas que usam a função RELATED
ru_ru: Сокращение использования вычисляемых столбцов, использующих функцию RELATED
sk_sk: Znížte používanie vypočítaných stĺpcov, ktoré používajú funkciu RELATED
sl_sl: Zmanjšanje uporabe izračunanih stolpcev, ki uporabljajo funkcijo RELATED
sv_se: Minska användningen av beräknade kolumner som använder funktionen RELATED
ta_in: தொடர்புடைய செயல்பாட்டைப் பயன்படுத்தும் கணக்கிடப்பட்ட நெடுவரிசைகளின் பயன்பாட்டைக் குறைக்கவும்
zu_za: Nciphisa ukusetshenziswa kwamakholomu abalwe asebenzisa umsebenzi we-RELATED

source: Avoid excessive bi-directional or many-to-many relationships
ar_ae: تجنب العلاقات المفرطة ثنائية الاتجاه أو العلاقات بين متعدد إلى متعدد
bg_bg: Избягвайте прекомерни двупосочни връзки или връзки много към много
da_dk: Undgå for mange tovejs- eller mange-til-mange-relationer
de_de: Vermeiden Sie übermäßige bidirektionale oder m:n-Beziehungen
el_gr: Αποφύγετε τις υπερβολικές αμφίδρομες σχέσεις ή σχέσεις πολλά-προς-πολλά
fa_ir: از روابط بیش از حد دو طرفه یا چند به چند خودداری کنید
ga_ie: Seachain caidrimh iomarcacha dhéthreoch nó go leor le go leor
hu_hu: Kerülje a túlzott kétirányú vagy több-a-többhöz kapcsolatokat
id_id: Hindari hubungan dua arah atau banyak-ke-banyak yang berlebihan
is_is: Forðastu óhófleg tvíátta eða margátta sambönd
ja_jp: 過度の双方向または多対多の関係を避ける
mt_mt: Evita relazzjonijiet bi-direzzjonali eċċessivi jew ħafna għal ħafna
nl_nl: Vermijd buitensporige bidirectionele of veel-op-veel-relaties
pt_br: Evite relacionamentos bidirecionais excessivos ou muitos para muitos
ru_ru: Избегайте чрезмерных двунаправленных отношений или отношений «многие ко многим»
sk_sk: Vyhnite sa nadmerným obojsmerným vzťahom alebo vzťahom typu many-to-many
sl_sl: Izogibajte se pretiranim dvosmernim odnosom ali odnosom več proti mnogim.
sv_se: Undvik överdrivna dubbelriktade eller många-till-många-relationer
ta_in: அதிகப்படியான இரு-திசை அல்லது பல உறவுகளைத் தவிர்க்கவும்
zu_za: Gwema ubudlelwane ngokweqile be-bi-directional noma obuningi

source: Remove auto-date table
ar_ae: إزالة جدول التاريخ التلقائي
bg_bg: Премахване на таблицата с автоматични дати
da_dk: Fjern tabel med automatisk datering
de_de: Entfernen der Tabelle für das automatische Datum
el_gr: Κατάργηση πίνακα αυτόματης ημερομηνίας
fa_ir: حذف جدول تاریخ خودکار
ga_ie: Bain tábla uathoibríoch-dáta
hu_hu: Automatikus dátumtáblázat eltávolítása
id_id: Menghapus tabel tanggal otomatis
is_is: Fjarlægja sjálfvirka dagsetningartöflu
ja_jp: 自動日付テーブルを削除する
mt_mt: Neħħi t-tabella tad-data awtomatika
nl_nl: Tabel met automatische datums verwijderen
pt_br: Remover tabela de data automática
ru_ru: Удаление таблицы автодат
sk_sk: Odstránenie tabuľky automatického dátumu
sl_sl: Odstranjevanje tabele samodejnega datuma
sv_se: Ta bort automatisk datumtabell
ta_in: தானியங்கு தேதி அட்டவணையை அகற்று
zu_za: Susa ithebula losuku oluzenzakalelayo

source: Date/calendar tables should be marked as a date table
ar_ae: يجب وضع علامة على جداول التاريخ / التقويم كجدول تواريخ
bg_bg: Таблиците с дати/календари трябва да бъдат маркирани като таблица с дати
da_dk: Dato-/kalendertabeller skal markeres som en datotabel
de_de: Datums-/Kalendertabellen sollten als Datumstabelle gekennzeichnet werden
el_gr: Οι πίνακες ημερομηνιών/ημερολογίου πρέπει να επισημαίνονται ως πίνακας ημερομηνιών
fa_ir: جداول تاریخ/تقویم باید به عنوان جدول تاریخ علامت گذاری شوند
ga_ie: Ba chóir táblaí dáta/féilire a mharcáil mar thábla dáta
hu_hu: A dátum-/naptártáblázatokat dátumtáblázatként kell megjelölni
id_id: Tabel tanggal/kalender harus ditandai sebagai tabel tanggal
is_is: Dagsetningar-/dagatalstöflur ættu að vera merktar sem dagsetningartafla
ja_jp: 日付/カレンダーテーブルは、日付テーブルとしてマークする必要があります
mt_mt: It-tabelli tad-data/kalendarju għandhom jiġu mmarkati bħala tabella tad-data
nl_nl: Datum-/kalendertabellen moeten worden gemarkeerd als een datumtabel
pt_br: As tabelas de data/calendário devem ser marcadas como uma tabela de datas
ru_ru: Таблицы дат/календаря должны быть помечены как таблица дат
sk_sk: Tabuľky dátumov/kalendárov by mali byť označené ako tabuľka dátumov
sl_sl: Tabele z datumi/koledarji morajo biti označene kot datumska tabela
sv_se: Datum-/kalendertabeller ska markeras som en datumtabell
ta_in: தேதி / காலண்டர் அட்டவணைகள் தேதி அட்டவணையாக குறிக்கப்பட வேண்டும்
zu_za: Amatafula osuku/ikhalenda kufanele aphawulwe njengethebula losuku

source: Large tables should be partitioned
ar_ae: يجب تقسيم الجداول الكبيرة
bg_bg: Големите маси трябва да бъдат разделени
da_dk: Store borde skal opdeles
de_de: Große Tabellen sollten partitioniert werden
el_gr: Τα μεγάλα τραπέζια πρέπει να χωριστούν
fa_ir: جداول بزرگ باید پارتیشن بندی شوند
ga_ie: Ba chóir táblaí móra a dheighilt
hu_hu: A nagy táblákat particionálni kell
id_id: Tabel besar harus dipartisi
is_is: Stórum borðum ætti að skipta
ja_jp: 大きなテーブルはパーティション分割する必要があります
mt_mt: Tabelli kbar għandhom jinqasmu
nl_nl: Grote tafels moeten worden gepartitioneerd
pt_br: Tabelas grandes devem ser particionadas
ru_ru: Большие таблицы должны быть секционированы
sk_sk: Veľké tabuľky by mali byť rozdelené
sl_sl: Velike tabele morajo biti razdeljene na particije
sv_se: Stora tabeller ska partitioneras
ta_in: பெரிய அட்டவணைகள் பகிரப்பட வேண்டும்
zu_za: Amatafula amakhulu kufanele ahlukaniswe

source: Limit row level security (RLS) logic
ar_ae: منطق الحد من الأمان على مستوى الصف (RLS)
bg_bg: Логика за ограничаване на защитата на ниво ред (RLS)
da_dk: Begræns sikkerhed på rækkeniveau (RLS)
de_de: Grenzwert-RLS-Logik (Limit Row Level Security)
el_gr: Λογική ασφάλειας ορίου επιπέδου γραμμών (RLS)
fa_ir: منطق امنیت سطح ردیف (RLS) را محدود کنید
ga_ie: Cuir teorainn le loighic slándála leibhéal an ró (RLS)
hu_hu: Sorszintű biztonsági (RLS) logika korlátozása
id_id: Batasi logika keamanan tingkat baris (RLS)
is_is: Takmarka öryggi á raðstigi (RLS) rökfræði
ja_jp: 行レベル・セキュリティー (RLS) ロジックの制限
mt_mt: Illimita l-loġika tas-sigurtà tal-livell ta' ringiela (RLS)
nl_nl: Logica voor beveiliging op rijniveau (RLS) beperken
pt_br: Limitar a lógica de RLS (segurança em nível de linha)
ru_ru: Ограничение логики безопасности на уровне строк (RLS)
sk_sk: Logika obmedzenia zabezpečenia na úrovni riadkov (RLS)
sl_sl: Logika omejitve varnosti na ravni vrstice (RLS)
sv_se: Begränsa logik för säkerhet på radnivå (RLS)
ta_in: வரம்பு வரிசை நிலை பாதுகாப்பு (RLS) தர்க்கம்
zu_za: Umkhawulo wezinga lokugwedla ukuphepha (RLS) logic

source: Model should have a date table
ar_ae: يجب أن يحتوي النموذج على جدول تواريخ
bg_bg: Моделът трябва да има таблица с дати
da_dk: Modellen skal have en datotabel
de_de: Das Modell sollte über eine Datumstabelle verfügen
el_gr: Το μοντέλο πρέπει να έχει πίνακα ημερομηνιών
fa_ir: مدل باید دارای جدول تاریخ باشد
ga_ie: Ba chóir go mbeadh tábla dáta ag an tsamhail
hu_hu: A modellnek dátumtáblával kell rendelkeznie
id_id: Model harus memiliki tabel tanggal
is_is: Líkan ætti að hafa dagsetningartöflu
ja_jp: モデルには日付テーブルが必要です
mt_mt: Il-mudell għandu jkollu tabella tad-data
nl_nl: Model moet een datumtabel hebben
pt_br: O modelo deve ter uma tabela de datas
ru_ru: Модель должна иметь таблицу дат
sk_sk: Model by mal mať tabuľku dátumov
sl_sl: Model mora imeti datumsko tabelo
sv_se: Modellen ska ha en datumtabell
ta_in: மாடலில் தேதி அட்டவணை இருக்க வேண்டும்
zu_za: Imodeli kufanele ibe netafula losuku

source: Calculation items must have an expression
ar_ae: يجب أن تحتوي عناصر الحساب على تعبير
bg_bg: Изчислителните елементи трябва да имат израз
da_dk: Beregningselementer skal have et udtryk
de_de: Berechnungselemente müssen einen Ausdruck haben
el_gr: Τα στοιχεία υπολογισμού πρέπει να έχουν μια έκφραση
fa_ir: موارد محاسبه باید یک عبارت داشته باشند
ga_ie: Ní mór slonn a bheith ag míreanna ríofa
hu_hu: A számítási elemeknek kifejezéssel kell rendelkezniük
id_id: Item perhitungan harus memiliki ekspresi
is_is: Reikniatriði verða að hafa segð
ja_jp: 計算項目には式が必要です
mt_mt: L-elementi ta' kalkolu għandu jkollhom espressjoni
nl_nl: Berekeningsitems moeten een expressie hebben
pt_br: Os itens de cálculo devem ter uma expressão
ru_ru: Элементы вычислений должны иметь выражение
sk_sk: Položky výpočtu musia mať výraz
sl_sl: Elementi za izračun morajo imeti izraz
sv_se: Beräkningsobjekt måste ha ett uttryck
ta_in: கணக்கீட்டு உருப்படிகளில் ஒரு வெளிப்பாடு இருக்க வேண்டும்
zu_za: Izinto zokubala kumele zibe nenkulumo

source: Relationship columns should be of the same data type
ar_ae: يجب أن تكون أعمدة العلاقة من نفس نوع البيانات
bg_bg: Колоните на релацията трябва да са от един и същ тип данни
da_dk: Relationskolonner skal være af samme datatype
de_de: Beziehungsspalten sollten denselben Datentyp aufweisen
el_gr: Οι στήλες σχέσεων πρέπει να είναι του ίδιου τύπου δεδομένων
fa_ir: ستون های رابطه باید از یک نوع داده باشند
ga_ie: Ba cheart colúin chaidrimh a bheith den chineál céanna sonraí
hu_hu: A kapcsolati oszlopoknak azonos adattípusúaknak kell lenniük
id_id: Kolom relasi harus memiliki tipe data yang sama
is_is: Tengsladálkar ættu að vera af sömu gagnagerð
ja_jp: リレーションシップ列は同じデータ型である必要があります
mt_mt: Il-kolonni tar-relazzjoni għandhom ikunu tal-istess tip ta' dejta
nl_nl: Relatiekolommen moeten van hetzelfde gegevenstype zijn
pt_br: As colunas de relacionamento devem ser do mesmo tipo de dados
ru_ru: Столбцы отношений должны иметь один и тот же тип данных
sk_sk: Stĺpce vzťahov by mali mať rovnaký typ údajov
sl_sl: Stolpci relacij morajo biti istega podatkovnega tipa
sv_se: Relationskolumner ska vara av samma datatyp
ta_in: உறவு பத்திகள் ஒரே தரவினத்தில் இருக்க வேண்டும்
zu_za: Amakholomu obudlelwane kufanele abe uhlobo olufanayo lwedatha

source: Data columns must have a source column
ar_ae: يجب أن تحتوي أعمدة البيانات على عمود مصدر
bg_bg: Колоните с данни трябва да имат колона източник
da_dk: Datakolonner skal have en kildekolonne
de_de: Datenspalten müssen eine Quellspalte haben
el_gr: Οι στήλες δεδομένων πρέπει να έχουν μια στήλη προέλευσης
fa_ir: ستون های داده باید دارای ستون منبع باشند
ga_ie: Ní mór colún foinseach a bheith ag colúin sonraí
hu_hu: Az adatoszlopoknak forrásoszloppal kell rendelkezniük
id_id: Kolom data harus memiliki kolom sumber
is_is: Gagnadálkar verða að hafa upprunadálk
ja_jp: データ列にはソース列が必要です
mt_mt: Il-kolonni tad-dejta għandu jkollhom kolonna tas-sors
nl_nl: Gegevenskolommen moeten een bronkolom hebben
pt_br: As colunas de dados devem ter uma coluna de origem
ru_ru: Столбцы данных должны иметь исходный столбец
sk_sk: Stĺpce údajov musia mať zdrojový stĺpec
sl_sl: Stolpci podatkov morajo imeti izvorni stolpec
sv_se: Datakolumner måste ha en källkolumn
ta_in: தரவு நெடுவரிசைகள் மூல நெடுவரிசையைக் கொண்டிருக்க வேண்டும்
zu_za: Amakholomu wedatha kumele abe nekholomu yomthombo

source: Set IsAvailableInMdx to true on necessary columns
ar_ae: قم بتعيين IsAvailableInMdx إلى true على الأعمدة الضرورية
bg_bg: Задайте IsAvailableInMdx на true за необходимите колони
da_dk: Indstil IsAvailableInMdx til sand på de nødvendige kolonner
de_de: Legen Sie IsAvailableInMdx für die erforderlichen Spalten auf true fest.
el_gr: Ορίστε το IsAvailableInMdx σε true στις απαραίτητες στήλες
fa_ir: IsAvailableInMdx را روی true در ستون های ضروری تنظیم کنید
ga_ie: Socraigh IsAvailableInMdx le fíor ar cholúin riachtanacha
hu_hu: Állítsa az IsAvailableInMdx értékét true értékre a szükséges oszlopokon
id_id: Atur IsAvailableInMdx ke true pada kolom yang diperlukan
is_is: Stilltu IsAvailableInMdx á true í nauðsynlegum dálkum
ja_jp: 必要な列で IsAvailableInMdx を true に設定します
mt_mt: Issettja IsAvailableInMdx għal veru fuq il-kolonni meħtieġa
nl_nl: Stel IsAvailableInMdx in op waar op noodzakelijke kolommen
pt_br: Defina IsAvailableInMdx como true nas colunas necessárias
ru_ru: Установите IsAvailableInMdx в значение true для необходимых столбцов
sk_sk: Nastavte IsAvailableInMdx na hodnotu true v potrebných stĺpcoch
sl_sl: Nastavitev IsAvailableInMdx na true v potrebnih stolpcih
sv_se: Ange IsAvailableInMdx till true för nödvändiga kolumner
ta_in: IsAvailableInMdx ஐ தேவையான நெடுவரிசைகளில் உண்மையாக அமைக்கவும்
zu_za: Setha IsAvailableInMdx kuyiqiniso kumakholomu adingekayo

source: Avoid the USERELATIONSHIP function and RLS against the same table
ar_ae: تجنب الدالة USERELATIONSHIP ومتلازمة تململ الساقين مقابل نفس الجدول
bg_bg: Избягвайте функцията USERELATION и RLS срещу една и съща таблица
da_dk: Undgå funktionen USERELATIONSHIP og sikkerhed på rækkeniveau i forhold til den samme tabel
de_de: Vermeiden Sie die USERELATIONSHIP-Funktion und RLS für dieselbe Tabelle
el_gr: Αποφύγετε τη συνάρτηση USERELATIONSHIP και το RLS στον ίδιο πίνακα
fa_ir: از تابع USERELATIONSHIP و RLS در برابر یک جدول خودداری کنید
ga_ie: Seachain an fheidhm USERELATIONSHIP agus RLS i gcoinne an tábla céanna
hu_hu: Kerülje a USERELATIONSHIP függvényt és az RLS-t ugyanazon a táblán
id_id: Hindari fungsi USERELATIONSHIP dan RLS terhadap tabel yang sama
is_is: Forðastu aðgerðina USERELATIONSHIP og RLS gegn sömu töflu
ja_jp: 同じテーブルに対する USERELATIONSHIP 関数と RLS は避けてください
mt_mt: Evita l-funzjoni USERELATIONSHIP u RLS kontra l-istess tabella
nl_nl: Vermijd de USERELATIONSHIP-functie en RLS tegen dezelfde tabel
pt_br: Evite a função USERELATIONSHIP e a RLS na mesma tabela
ru_ru: Избегайте использования функции USERELATIONSHIP и RLS для одной и той же таблицы
sk_sk: Vyhnite sa funkcii USERELATIONSHIP a zabezpečeniu na úrovni riadkov v rovnakej tabuľke
sl_sl: Izogibanje funkciji USERELATIONSHIP in ravni na ravni dodatnih vrednosti za isto tabelo
sv_se: Undvik funktionen USERELATIONSHIP och RLS mot samma tabell
ta_in: ஒரே டேபிளுக்கு எதிராக USERELATIONSHIP செயல்பாடு மற்றும் RLS ஐ தவிர்க்கவும்
zu_za: Gwema umsebenzi we-USERELATIONSHIP kanye ne-RLS ngokumelene netafula elifanayo

source: Avoid using the IFERROR function
ar_ae: تجنب استخدام الدالة IFERROR
bg_bg: Избягвайте използването на функцията IFERROR
da_dk: Undgå at bruge funktionen HVISFEJL
de_de: Vermeiden Sie die Verwendung der WENNFEHLER-Funktion
el_gr: Αποφύγετε τη χρήση της συνάρτησης IFERROR
fa_ir: از استفاده از تابع IFERROR خودداری کنید
ga_ie: Seachain an fheidhm IFERROR a úsáid
hu_hu: Kerülje a HAHIBA függvény használatát
id_id: Hindari menggunakan fungsi IFERROR
is_is: Forðastu að nota aðgerðina IFERROR
ja_jp: IFERROR 関数の使用は避けてください
mt_mt: Evita li tuża l-funzjoni IFERROR
nl_nl: Vermijd het gebruik van de IFERROR-functie
pt_br: Evite usar a função IFERROR
ru_ru: Избегайте использования функции IFERROR
sk_sk: Vyhnite sa používaniu funkcie IFERROR
sl_sl: Izogibajte se uporabi funkcije IFERROR
sv_se: Undvik att använda funktionen OMFEL
ta_in: IFERROR செயல்பாட்டைப் பயன்படுத்துவதைத் தவிர்க்கவும்
zu_za: Gwema ukusebenzisa umsebenzi we-IFERROR

source: Use the TREATAS function instead of INTERSECT for virtual relationships
ar_ae: استخدم الدالة TREATAS بدلا من INTERSECT للعلاقات الظاهرية
bg_bg: Използвайте функцията TREATAS вместо INTERSECT за виртуални релации
da_dk: Brug funktionen BEHANDL i stedet for SKÆRING til virtuelle relationer
de_de: Verwenden Sie die Funktion TREATAS anstelle von INTERSECT für virtuelle Beziehungen
el_gr: Χρησιμοποιήστε τη συνάρτηση TREATAS αντί για τη συνάρτηση INTERSECT για εικονικές σχέσεις
fa_ir: استفاده از تابع TREATAS به جای INTERSECT برای روابط مجازی
ga_ie: Bain úsáid as an fheidhm TREATAS in ionad INTERSECT do chaidrimh fhíorúla
hu_hu: Használja a TREATAS függvényt az INTERSECT helyett virtuális kapcsolatokhoz
id_id: Gunakan fungsi TREATAS alih-alih INTERSECT untuk hubungan virtual
is_is: Nota aðgerðina SKERA í stað SKERA fyrir sýndarvenslur
ja_jp: 仮想リレーションシップには、INTERSECT の代わりに TREATAS 関数を使用します
mt_mt: Uża l-funzjoni TREATAS minflok INTERSECT għal relazzjonijiet virtwali
nl_nl: Gebruik de functie TREATAS in plaats van INTERSECT voor virtuele relaties
pt_br: Use a função TREATAS em vez de INTERSECT para relacionamentos virtuais
ru_ru: Использование функции TREATAS вместо INTERSECT для виртуальных отношений
sk_sk: Použite funkciu TREATAS namiesto funkcie INTERSECT pre virtuálne vzťahy
sl_sl: Uporaba funkcije TREATAS namesto funkcije INTERSECT za navidezne relacije
sv_se: Använd funktionen TREATAS i stället för INTERSECT för virtuella relationer
ta_in: மெய்நிகர் உறவுகளுக்கு INTERSECT க்கு பதிலாக TREATAS செயல்பாட்டைப் பயன்படுத்தவும்
zu_za: Sebenzisa umsebenzi we-TREATAS esikhundleni se-INTERSECT yobudlelwane obubonakalayo

source: The EVALUATEANDLOG function should not be used in production models
ar_ae: يجب عدم استخدام الدالة EVALUATEANDLOG في نماذج الإنتاج
bg_bg: Функцията EVALUATEANDLOG не трябва да се използва в производствени модели
da_dk: EVALUATEANDLOG-funktionen bør ikke bruges i produktionsmodeller
de_de: Die Funktion EVALUATEANDLOG sollte nicht in Produktionsmodellen verwendet werden
el_gr: Η συνάρτηση EVALUATEANDLOG δεν πρέπει να χρησιμοποιείται σε μοντέλα παραγωγής
fa_ir: تابع EVALUATEANDLOG نباید در مدل های تولیدی استفاده شود
ga_ie: Níor cheart feidhm EVALUATEANDLOG a úsáid i samhlacha táirgthe
hu_hu: Az EVALUATEANDLOG függvény nem használható éles modellekben
id_id: Fungsi EVALUATEANDLOG tidak boleh digunakan dalam model produksi
is_is: Ekki má nota EVALUATEANDLOG aðgerðina í framleiðslulíkönum
ja_jp: EVALUATEANDLOG 関数は、運用モデルでは使用しないでください
mt_mt: Il-funzjoni EVALUATEANDLOG m'għandhiex tintuża f'mudelli ta' produzzjoni
nl_nl: De functie EVALUATEANDLOG mag niet worden gebruikt in productiemodellen
pt_br: A função EVALUATEANDLOG não deve ser usada em modelos de produção
ru_ru: Функцию EVALUATEANDLOG не следует использовать в производственных моделях
sk_sk: Funkcia EVALUATEANDLOG by sa nemala používať v produkčných modeloch
sl_sl: Funkcija EVALUATEANDLOG se ne sme uporabljati v proizvodnih modelih
sv_se: Funktionen EVALUATEANDLOG ska inte användas i produktionsmodeller
ta_in: EVALUATEANDLOG செயல்பாடு உற்பத்தி மாதிரிகளில் பயன்படுத்தப்படக்கூடாது
zu_za: Umsebenzi we-EXPLOREANDLOG akufanele usetshenziswe kumamodeli wokukhiqiza

source: Measures should not be direct references of other measures
ar_ae: وينبغي ألا تكون التدابير إشارات مباشرة إلى تدابير أخرى
bg_bg: Мерките не следва да бъдат преки препратки към други мерки
da_dk: Foranstaltninger bør ikke være direkte henvisninger til andre foranstaltninger
de_de: Die Maßnahmen sollten keine direkten Verweise auf andere Maßnahmen
el_gr: Τα μέτρα δεν θα πρέπει να αποτελούν άμεσες αναφορές σε άλλα μέτρα
fa_ir: اقدامات نباید ارجاع مستقیم به سایر اقدامات باشد
ga_ie: Níor cheart bearta a bheith ina dtagairtí díreacha do bhearta eile
hu_hu: Az intézkedések nem lehetnek más intézkedésekre való közvetlen hivatkozások
id_id: Tindakan tidak boleh menjadi referensi langsung dari tindakan lain
is_is: Ráðstafanir ættu ekki að vera beinar tilvísanir í aðrar ráðstafanir
ja_jp: メジャーは、他のメジャーを直接参照しないでください
mt_mt: Il-miżuri m'għandhomx ikunu referenzi diretti ta' miżuri oħra
nl_nl: Maatregelen mogen geen rechtstreekse verwijzingen zijn naar andere maatregelen
pt_br: As medidas não devem ser referências diretas a outras medidas
ru_ru: Меры не должны быть прямыми ссылками на другие меры
sk_sk: Opatrenia by nemali byť priamymi odkazmi na iné opatrenia
sl_sl: Ukrepi ne bi smeli biti neposredna sklicevanja na druge ukrepe
sv_se: Åtgärder bör inte vara direkta hänvisningar till andra åtgärder
ta_in: நடவடிக்கைகள் மற்ற நடவடிக்கைகளின் நேரடி குறிப்புகளாக இருக்கக்கூடாது
zu_za: Izinyathelo akufanele zibe izinkomba eziqondile zezinye izinyathelo

source: No two measures should have the same definition
ar_ae: لا ينبغي أن يكون لمقياسين نفس التعريف
bg_bg: Няма две мерки с еднакво определение
da_dk: Ikke to foranstaltninger bør have samme definition
de_de: Keine zwei Kennzahlen sollten die gleiche Definition haben
el_gr: Κανένα μέτρο δεν πρέπει να έχει τον ίδιο ορισμό
fa_ir: هیچ دو معیاری نباید تعریف یکسانی داشته باشند
ga_ie: Níor cheart an sainmhíniú céanna a bheith ag aon dá bheart
hu_hu: Nincs két olyan intézkedés, amelynek ugyanaz a meghatározása
id_id: Tidak ada dua ukuran yang harus memiliki definisi yang sama
is_is: Engir tveir mælikvarðar ættu að hafa sömu skilgreiningu
ja_jp: 2 つのメジャーが同じ定義を持つ必要はありません
mt_mt: L-ebda żewġ miżuri ma għandu jkollhom l-istess definizzjoni
nl_nl: Geen twee maatregelen mogen dezelfde definitie hebben
pt_br: Não há duas medidas que tenham a mesma definição
ru_ru: Никакие две меры не должны иметь одинаковое определение
sk_sk: Žiadne dve opatrenia by nemali mať rovnakú definíciu
sl_sl: Noben ukrep ne bi smel imeti enake opredelitve
sv_se: Det finns inte två åtgärder som bör definieras på samma sätt
ta_in: எந்த இரண்டு நடவடிக்கைகளும் ஒரே வரையறையைக் கொண்டிருக்கக்கூடாது
zu_za: Azikho izinyathelo ezimbili okufanele zibe nencazelo efanayo

source: Avoid addition or subtraction of constant values to results of divisions
ar_ae: تجنب جمع أو طرح القيم الثابتة لنتائج القسمة
bg_bg: Избягвайте събирането или изваждането на константни стойности към резултатите от деленията
da_dk: Undgå addition eller subtraktion af konstante værdier til resultater af divisioner
de_de: Vermeiden der Addition oder Subtraktion von konstanten Werten zu den Ergebnissen von Divisionen
el_gr: Αποφύγετε την πρόσθεση ή την αφαίρεση σταθερών τιμών στα αποτελέσματα των διαιρέσεων
fa_ir: از جمع یا تفریق مقادیر ثابت به نتایج تقسیمات خودداری کنید
ga_ie: Seachain luachanna tairiseacha a chur le torthaí rannáin nó iad a dhealú
hu_hu: Kerülje az állandó értékek összeadását vagy kivonását az osztások eredményeiből
id_id: Hindari penambahan atau pengurangan nilai konstanta untuk hasil pembagian
is_is: Forðastu að leggja saman eða draga föst gildi frá niðurstöðum deilinga
ja_jp: 除算の結果に対する定数値の加算または減算を避ける
mt_mt: Evita żieda jew tnaqqis ta' valuri kostanti mar-riżultati tad-diviżjonijiet
nl_nl: Vermijd het optellen of aftrekken van constante waarden aan de resultaten van delingen
pt_br: Evite adição ou subtração de valores constantes aos resultados das divisões
ru_ru: Избегайте сложения или вычитания константных значений к результатам делений
sk_sk: Vyhnite sa pridávaniu alebo odčítavaniu konštantných hodnôt k výsledkom delenia
sl_sl: Izogibajte se seštevanju ali odštevanju konstantnih vrednosti rezultatom delitev
sv_se: Undvik addition eller subtraktion av konstanta värden till resultaten av divisioner
ta_in: வகுத்தலின் முடிவுகளுடன் மாறிலி மதிப்புகளைக் கூட்டுவதையோ அல்லது கழிப்பதையோ தவிர்க்கவும்
zu_za: Gwema ukwengeza noma ukukhipha amanani ahlala njalo emiphumeleni yokuhlukana
