RECORDING_IS_EXPIRED_ERROR = (
    'Время записи теста вышло. Необходимо пересобрать тестовый стенд и '
    'осуществить запись повторно!'
)


TEST_RECORDING_ALREADY_FINISHED_ERROR = (
    'Запись теста уже завершена. Для записи нового теста необходимо '
    'пересобрать приложение с возвращением базы данных к эталонному наполнению!'
)

TEST_RECORDING_ERROR_ENDED = 'Запись теста была прервана из-за непредвиденной ошибки!'


TEST_RECORDING_EMPTY_STEP_ERROR = (
    'Следующий шаг сценария не может быть пустым. Укажите шаг сценария!'
)

TEST_RECORDING_NO_RECORDER_REQUESTS = (
    'Невозможно завершить запись текущего шага, ни одно действие не было выполнено. '
    'Выполните действия относящиеся к шагу.'
)

TEST_RECORDING_DB_HAS_CHANGES = (
    'В БД были обнаружены изменения, это может повлиять на корректность записи автотеста.'
    'Для записи необходимо пересобрать приложение с возвращением базы данных к эталонному наполнению!<br/><br/>'
    'Если вы точно уверены что ни вы и ни кто-то другой не выполнял никаких действий на приложении после последнего перезапуска БД, то нажмите "ОК" и снова нажмите "Начать запись".'
)

STEP_DEFINITION_WRONG_DIVIDER_COUNT = (
    '- Минимальное количество разделителей в строке должно быть 2.<br/>'
    '- Количество разделителей должно быть одинаковым для всех строк таблицы.'
)

STEP_DEFINITION_WRONG_TABLE_FORMAT = (
    '- Каждая строка таблицы должна начинаться и заканчиваться символом |'
)

STEP_DEFINITION_WRONG_TABLE_ROWS_COUNT = (
    'Минимальное количество строк таблицы включая строку заголовка - 2.<br/>'
    'Не корректное значение:<br/>{}'
)

WRONG_TESTLINK_TESTCASE_NAME = (
    'Наименование сценария не должно начинаться со знака пробела:<br>'
    '<b>"{testcase_name}"</b>.<br>'
    'Для корректной работы синхронизации нужно предварительно '
    'отредактировать наименование сценария {testlink_id} в testlink.'
)
