Repository: pypi-data/pypi-mirror-384
Catalog: packages/liege.urban/liege.urban-1.0.10.tar.gz/liege.urban-1.0.10/src/liege/urban/locales/*/LC_MESSAGES/liege.urban.po
Languages: fr

source: Environment validation type marker interface
fr: Validation environnement

source: IInspectionBuidlingDivisionAttestationCollege type marker interface
fr: Courrier attestation conformité

source: IInspectionBuidlingDivisionAttestationMail type marker interface
fr: Collège attestation conformité

source: IInternalOpinionRequestEvent type marker interface
fr: Demande d'avis interne

source: Street code
fr: Code rue

source: Street name
fr: Nom de la rue

source: Street number
fr: Numéro

source: The above listed tasks are not done yet !!!
fr: Attention, il reste des actions à prendre pour les tâches ci-dessus!!!

source: urban_label_CommentsOnDecisionProject
fr: Commentaire sur le projet de décision

source: urban_label_ExploitationUsage
fr: Nature de l'exploitation

source: urban_label_LiegeEnvironmentConditions
fr: conditions Ville de Liège

source: urban_label_RCB
fr: Réglement communal sur les Bâtisses

source: urban_label_UsageTownship
fr: Nature des travaux (codes Ville)

source: urban_label_closeDate
fr: Date de séance de clôture

source: urban_label_decisionNotificationTo
fr: Notification de la décision à

source: urban_label_description
fr: Observations

source: urban_label_device
fr: Dispositif

source: urban_label_deviceContinuation
fr: Suite du dispositif

source: urban_label_deviceEnd
fr: Fin du dispositif

source: urban_label_explanationDate
fr: Date de soirée de consultation

source: urban_label_exploitationAddress
fr: Adresse de l'exploitation

source: urban_label_folderCategory
fr: Type de dossier

source: urban_label_formal_notice_old_reference
fr: Ancien n° d'AD

source: urban_label_futurePathCoating
fr: Revêtement de trottoir futur

source: urban_label_motivation
fr: Motivation

source: urban_label_pathCoating
fr: Revêtement de trottoir existant

source: urban_label_pipeSevesoDetails
fr: Détails sur les canalisations et sites Seveso

source: urban_label_pmObject
fr: Objet

source: urban_label_procedureType
fr: Type de dossier

source: urban_label_rcbDetails
fr: Détails concernant le RCB

source: urban_label_referenceFD
fr: Référence FD

source: urban_label_roadDescription
fr: Observations/commentaires

source: urban_label_solicitExternalOpinionsTo
fr: Avis externe(s) sollicité(s)

source: urban_label_solicitInternalOpinionsTo
fr: Avis interne(s) sollicité(s)

source: urban_label_urbanReference
fr: Référence urbanisme
