Repository: pypi-data/pypi-mirror-384
Catalog: packages/aa-metenox/aa_metenox-1.6.3-py3-none-any.whl/metenox/locale/*/LC_MESSAGES/django.po
Languages: uk

source: Add a new webhook to corporation "%(corporation_name)s"
uk: Додати новий вебхук до корпорації "%(corporation_name)s"

source: Add a new webhook:
uk: Додати новий вебхук:

source: This method will create a brand new webhook on the auth.
uk: Цей метод створить новий вебхук для авторизації.

source: Webhook's name:
uk: Назва вебхука:

source: This name will be assigned to ease finding the webhook back
uk: Це назва буде призначена для зручності пошуку вебхука

source: Enter the webhook's url:
uk: Введіть адресу вебхука:

source: Create webhook
uk: Створити вебхук

source: Add an existing webhook:
uk: Додати існуючий вебхук:

source: This method allows to add a webhook already present in the auth. You only need to enter the webhook's id.
uk: Цей метод дозволяє додати вебхук, який вже існує в авторизації. Ви повинні ввести ідентифікатор вебхука.

source: Webhook's id:
uk: Ідентифікатор вебхука:

source: Metenox
uk: Метенокс

source: Add owner
uk: Додати власника

source: Corporation name
uk: Назва корпорації

source: Alliance name
uk: Назва альянсу

source: Number metenoxes
uk: Кількість метеноксів

source: Raw revenue
uk: Дохід з сировини

source: Profit
uk: Прибуток

source: Metenox name
uk: Назва метеноксу

source: Moon
uk: Місяць

source: Owner corporation
uk: Корпорація власника

source: System
uk: Система

source: Constellation
uk: Сузір'я

source: Region
uk: Регіон

source: Remaining fuel blocks
uk: Залишок паливних блоків

source: Remaining magmatic
uk: Залишок магматичного палива

source: Est. Value
uk: Розрахункове значення

source: Est. Profit
uk: Розрахунковий прибуток

source: Close
uk: Закрити

source: The Raw revenue represents the monthly (30 days) harvest of all metenoxes moon goo sold for jita buy price. <br> The profit is the previous value minus %(monthly_fuel_price)s for every metenox's fuel.
uk: Чистий дохід представляє собою місячний (30 днів) метенокс видобуток усієї місячної сировини, проданої за ціною покупки в Джиті. <br> Прибуток — це попереднє значення " "мінус %(monthly_fuel_price)s за кожне паливо метенокса.

source: Current notification parameters:
uk: Поточні параметри сповіщень:

source: Ping on remaining fuel days:
uk: Пінг про залишок днів на паливних блоках:

source: Ping on remaining magmatic days:
uk: Пінг про залишок днів на магматичному паливі:

source: Save new values
uk: Зберегти нові значення

source: Current webhooks:
uk: Поточні вебхуки:

source: Name
uk: Назва

source: Slug
uk: Слаг

source: Remove webhook
uk: Видалити вебхук

source: Add new webhook
uk: Додати новий вебхук

source: The est. value represents the monthly (30 days) harvest of a metenox moon goo sold for jita buy price. <br> The est. profit includes the monthly fuel price of approx %(monthly_fuel_price)s.
uk: Оцінена вартість представляє собою місячний (30 днів) метенокc видобуток місячної сировини, проданого за ціну покупки в Джиті. <br> Оцінений прибуток включає місячну вартість пального в розмірі приблизно %(monthly_fuel_price)s.

source: Moons
uk: Місяці

source: Metenoxes
uk: Метенокси

source: Corporations
uk: Корпорації

source: Prices
uk: Ціни

source: Location
uk: Розташування

source: Corporation
uk: Корпорація

source: Fuel block remaining
uk: Залишилось паливних блоків

source: Magmatic gas remaining
uk: Залишилось магматичного газу

source: Moon products stored in the Metenox
uk: Продукти, що зберігаються в Метеноксі

source: No Moon Materials stored in this Metenox detected.
uk: Жодних місячних матеріалів, що зберігаються у цьому Metenox, не виявлено.

source: Total stored value
uk: Загальна збережена вартість

source: Total stored volume
uk: Загальний збережений об'єм

source: Unit price
uk: Ціна за одиницю

source: Amount
uk: Кількість

source: Volume
uk: Обсяг

source: Total value
uk: Загальна вартість

source: Time before full moon material bay
uk: Час до повного заповнення трюму матеріалів

source: Monthly moon products harvest
uk: Щомісячний урожай місячних продуктів

source: There is no survey for this moon in the database.
uk: У базі даних немає результатів сканування цього місяця.

source: Hourly amount
uk: Кількість за годину

source: Monthly Price
uk: Ціна за місяць

source: Icon
uk: Іконка

source: Price
uk: Ціна

source: An error occurred
uk: Сталася помилка

source: Successfully changed %(corporation_name)s ping settings
uk: Успішно змінено налаштування пінгу для корпорації %(corporation_name)s

source: Successfully created webhook %(webhook_name)s for corporation %(corporation_name)s
uk: Успішно створено вебхук %(webhook_name)s для корпорації %(corporation_name)s

source: Successfully added webhook %(webhook_name)s to corporation %(corporation_name)s
uk: Успішно додано вебхук %(webhook_name)s до корпорації %(corporation_name)s

source: Webhook id was not found
uk: Ідентифікатор вебхука не знайдено

source: Unexpected argument received when creating a webhook for corporation %(corporation_name)s
uk: Отримано неочікуваний параметр під час створення вебхука для корпорації %(corporation_name)s

source: Error when trying to add a webhook to corporation %(corporation_name)s
uk: Помилка при спробі додати вебхук до корпорації %(corporation_name)s

source: Webhook %(webhook_name)s was successfully removed from %(corporation_name)s
uk: Вебхук %(webhook_name)s було успішно видалено з %(corporation_name)s

source: An error occured
uk: Виникла помилка
